{
	"sahih-bukhari": [
		{
			"id": 1,
			"hadithNumber": "1",
			"englishNarrator": "Narrated 'Umar bin Al-Khattab (May Allah be pleased with him):",
			"hadithEnglish": "I heard Allah's Messenger (ﷺ) saying, \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\"",
			"hadithUrdu": "آپ صلی اللہ علیہ وسلم فرما رہے تھے کہ تمام اعمال کا دارومدار نیت پر ہے اور ہر عمل کا نتیجہ ہر انسان کو اس کی نیت کے مطابق ہی ملے گا ۔ پس جس کی ہجرت ( ترک وطن ) دولت دنیا حاصل کرنے کے لیے ہو یا کسی عورت سے شادی کی غرض ہو ۔ پس اس کی ہجرت ان ہی چیزوں کے لیے ہو گی جن کے حاصل کرنے کی نیت سے اس نے ہجرت کی ہے ۔",
			"urduNarrator": "ہم کو حمیدی نے یہ حدیث بیان کی ، انھوں نے کہا کہ ہم کو سفیان نے یہ حدیث بیان کی ، وہ کہتے ہیں ہم کو یحییٰ بن سعید انصاری نے یہ حدیث بیان کی ، انھوں نے کہا کہ مجھے یہ حدیث محمد بن ابراہیم تیمی سے حاصل ہوئی ۔ انھوں نے اس حدیث کو علقمہ بن وقاص لیثی سے سنا ، ان کا بیان ہے کہ میں نے مسجدنبوی میں منبر رسول صلی اللہ علیہ وسلم پر حضرت عمر بن خطاب رضی اللہ عنہ کی زبان سے سنا ، وہ فرما رہے تھے کہ میں نے جناب رسول اللہ صلی اللہ علیہ وسلم سے سنا",
			"hadithArabic": "حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأَنْصَارِيُّ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى الْمِنْبَرِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ ‏ \"‏ إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ ‏\"‏‏.‏",
			"headingArabic": "كَيْفَ كَانَ بَدْءُ الْوَحْىِ إِلَى رَسُولِ اللَّهِ صلى الله عليه وسلم",
			"headingUrdu": "رسول اللہ ﷺ پر وحی کا آغاز کیونکر ہوا؟ نیز اللہ عزوجل کے فرمان (کی وضاحت): ہم نے آپ کی طرف اسی طرح وحی نازل فرمائی ہے جیسے حضرت نوح علیہ السلام ان کے بعد آنے والے تمام انبیاء (علیہ السلام) کی طرف نازل کی تھی۔",
			"headingEnglish": "How the Divine Revelation started being revealed to Allah's Messenger (peace be upon him)",
			"chapterId": "1",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 1,
				"chapterNumber": "1",
				"chapterEnglish": "Revelation",
				"chapterUrdu": "وحی کے بیان میں",
				"chapterArabic": "كتاب بدء الوحى",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 8,
			"hadithNumber": "8",
			"englishNarrator": "Narrated Ibn 'Umar:",
			"hadithEnglish": "Allah's Messenger (ﷺ) said: Islam is based on (the following) five (principles):\r\n1. To testify that none has the right to be worshipped but Allah and Muhammad is Allah's Messenger (ﷺ).\r\n2. To offer the (compulsory congregational) prayers dutifully and perfectly.\r\n3. To pay Zakat (i.e. obligatory charity) . \r\n4. To perform Hajj. (i.e. Pilgrimage to Mecca)\r\n5. To observe fast during the month of Ramadan.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا اسلام کی بنیاد پانچ چیزوں پر قائم کی گئی ہے۔ اول گواہی دینا کہ اللہ کے سوا کوئی معبود نہیں اور بیشک حضرت محمد صلی اللہ علیہ وسلم اللہ کے سچے رسول ہیں اور نماز قائم کرنا اور زکوٰۃ ادا کرنا اور حج کرنا اور رمضان کے روزے رکھنا ۔",
			"urduNarrator": "ہم سے عبیداللہ بن موسیٰ نے یہ حدیث بیان کی۔ انھوں نے کہا کہ ہمیں اس کی بابت حنظلہ بن ابی سفیان نے خبر دی۔ انھوں نے عکرمہ بن خالد سے روایت کی انھوں نے حضرت عبداللہ بن عمر رضی اللہ عنہما سے روایت کی کہ",
			"hadithArabic": "حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، قَالَ أَخْبَرَنَا حَنْظَلَةُ بْنُ أَبِي سُفْيَانَ، عَنْ عِكْرِمَةَ بْنِ خَالِدٍ، عَنِ ابْنِ عُمَرَ ـ رضى الله عنهما ـ قَالَ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ بُنِيَ الإِسْلاَمُ عَلَى خَمْسٍ شَهَادَةِ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلاَةِ، وَإِيتَاءِ الزَّكَاةِ، وَالْحَجِّ، وَصَوْمِ رَمَضَانَ ‏\"‏‏.‏",
			"headingArabic": "دُعَاؤُكُمْ إِيمَانُكُمْ",
			"headingUrdu": "تمہاری دعا سے مراد  تمہارا  ایمان ہے \r\nارشاد باری تعالٰی ہے: ’’(اے پیغمبر!)کہ دیجیے: اگر تمہاری دعا نہ ہوتی تو میرا رب تمہاری مطلق پروانہ کرتا۔‘‘ اورعربی لغت میں دعاکے معنی ایمان بھی ھے",
			"headingEnglish": "Your invocation means your faith",
			"chapterId": "2",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 2,
				"chapterNumber": "2",
				"chapterEnglish": "Belief",
				"chapterUrdu": "ایمان کے بیان میں",
				"chapterArabic": "كتاب الإيمان",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 59,
			"hadithNumber": "59",
			"englishNarrator": "Narrated Abu Huraira:",
			"hadithEnglish": "While the Prophet (ﷺ) was saying something in a gathering, a Bedouin came and asked him, \"When would the Hour (Doomsday) take place?\" Allah's Messenger (ﷺ) continued his talk, so some people said that Allah's Messenger (ﷺ) had heard the question, but did not like what that Bedouin had asked. Some of them said that Allah's Messenger (ﷺ) had not heard it. When the Prophet (ﷺ) finished his speech, he said, \"Where is the questioner, who inquired about the Hour (Doomsday)?\" The Bedouin said, \"I am here, O Allah's Apostle .\" Then the Prophet (ﷺ) said, \"When honesty is lost, then wait for the Hour (Doomsday).\" The Bedouin said, \"How will that be lost?\" The Prophet (ﷺ) said, \"When the power or authority comes in the hands of unfit persons, then wait for the Hour (Doomsday.)\"",
			"hadithUrdu": "ایک بار آنحضرت صلی اللہ علیہ وسلم لوگوں میں بیٹھے ہوئے ان سے باتیں کر رہے تھے ۔ اتنے میں ایک دیہاتی آپ کے پاس آیا اور پوچھنے لگا کہ قیامت کب آئے گی ؟ آپ صلی اللہ علیہ وسلم اپنی گفتگو میں مصروف رہے ۔ بعض لوگ ( جو مجلس میں تھے ) کہنے لگے آپ صلی اللہ علیہ وسلم نے دیہاتی کی بات سنی لیکن پسند نہیں کی اور بعض کہنے لگے کہ نہیں بلکہ آپ نے اس کی بات سنی ہی نہیں ۔ جب آپ صلی اللہ علیہ وسلم اپنی باتیں پوری کر چکے تو میں سمجھتا ہوں کہ آپ صلی اللہ علیہ وسلم نے یوں فرمایا وہ قیامت کے بارے میں پوچھنے والا کہاں گیا اس ( دیہاتی ) نے کہا ( حضور ) میں موجود ہوں ۔ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب امانت ( ایمانداری دنیا سے ) اٹھ جائے تو قیامت قائم ہونے کا انتظار کر ۔ اس نے کہا ایمانداری اٹھنے کا کیا مطلب ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ جب ( حکومت کے کاروبار ) نالائق لوگوں کو سونپ دئیے جائیں تو قیامت کا انتظار کر ۔",
			"urduNarrator": "ہم سے محمد بن سنان نے بیان کیا ، کہا ہم سے فلیح نے بیان کیا ( دوسری سند ) اور مجھ سے ابراہیم بن المنذر نے بیان کیا ، کہا مجھ سے میرے باپ ( فلیح ) نے بیان کیا ، کہا ہلال بن علی نے ، انھوں نے عطاء بن یسار سے نقل کیا ، انھوں نے حضرت ابوہریرہ رضی اللہ عنہ سے کہ",
			"hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ سِنَانٍ، قَالَ حَدَّثَنَا فُلَيْحٌ، ح وَحَدَّثَنِي إِبْرَاهِيمُ بْنُ الْمُنْذِرِ، قَالَ حَدَّثَنَا مُحَمَّدُ بْنُ فُلَيْحٍ، قَالَ حَدَّثَنِي أَبِي قَالَ، حَدَّثَنِي هِلاَلُ بْنُ عَلِيٍّ، عَنْ عَطَاءِ بْنِ يَسَارٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ بَيْنَمَا النَّبِيُّ صلى الله عليه وسلم فِي مَجْلِسٍ يُحَدِّثُ الْقَوْمَ جَاءَهُ أَعْرَابِيٌّ فَقَالَ مَتَى السَّاعَةُ فَمَضَى رَسُولُ اللَّهِ صلى الله عليه وسلم يُحَدِّثُ، فَقَالَ بَعْضُ الْقَوْمِ سَمِعَ مَا قَالَ، فَكَرِهَ مَا قَالَ، وَقَالَ بَعْضُهُمْ بَلْ لَمْ يَسْمَعْ، حَتَّى إِذَا قَضَى حَدِيثَهُ قَالَ ‏\"‏ أَيْنَ ـ أُرَاهُ ـ السَّائِلُ عَنِ السَّاعَةِ ‏\"‏‏.‏ قَالَ هَا أَنَا يَا رَسُولَ اللَّهِ‏.‏ قَالَ ‏\"‏ فَإِذَا ضُيِّعَتِ الأَمَانَةُ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏ قَالَ كَيْفَ إِضَاعَتُهَا قَالَ ‏\"‏ إِذَا وُسِّدَ الأَمْرُ إِلَى غَيْرِ أَهْلِهِ فَانْتَظِرِ السَّاعَةَ ‏\"‏‏.‏",
			"headingArabic": "مَنْ سُئِلَ عِلْمًا وَهُوَ مُشْتَغِلٌ فِي حَدِيثِهِ فَأَتَمَّ الْحَدِيثَ ثُمَّ أَجَابَ السَّائِلَ",
			"headingUrdu": "جس سے علم کے متعلق سوال کیا گیا جب وہ کسی گفتگو میں مصروف ہو تو اس نے بات ختم کی اور پھر سائل کو جواب دیا۔",
			"headingEnglish": "Whoever is asked about knowledge while he is busy in some conversation, so he finished talking and then answered the questioner",
			"chapterId": "3",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 3,
				"chapterNumber": "3",
				"chapterEnglish": "Knowledge",
				"chapterUrdu": "علم کے بیان میں",
				"chapterArabic": "كتاب العلم",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 135,
			"hadithNumber": "135",
			"englishNarrator": "Narrated Abu Huraira:",
			"hadithEnglish": "Allah's Messenger (ﷺ) said, \"The prayer of a person who does Hadath (passes urine, stool or wind) is not accepted till he performs the ablution.\" A person from Hadaramout asked Abu Huraira, \"What is 'Hadath'?\" Abu Huraira replied, \" 'Hadath' means the passing of wind.\"",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا کہ جو شخص حدث کرے اس کی نماز قبول نہیں ہوتی جب تک کہ وہ ( دوبارہ ) وضو نہ کر لے ۔ حضرموت کے ایک شخص نے پوچھا کہ حدث ہونا کیا ہے ؟ آپ صلی اللہ علیہ وسلم نے فرمایا کہ ( پاخانہ کے مقام سے نکلنے والی ) آواز والی یا بےآواز والی ہوا ۔",
			"urduNarrator": "ہم سے اسحاق بن ابراہیم الحنظلی نے بیان کیا ۔ انہیں عبدالرزاق نے خبر دی ، انہیں معمر نے ہمام بن منبہ کے واسطے سے بتلایا کہ انھوں نے ابوہریرہ رضی اللہ عنہ سے سنا ، وہ کہہ رہے تھے کہ",
			"hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، قَالَ أَخْبَرَنَا عَبْدُ الرَّزَّاقِ، قَالَ أَخْبَرَنَا مَعْمَرٌ، عَنْ هَمَّامِ بْنِ مُنَبِّهٍ، أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم ‏ \"‏ لاَ تُقْبَلُ صَلاَةُ مَنْ أَحْدَثَ حَتَّى يَتَوَضَّأَ ‏\"‏‏.‏ قَالَ رَجُلٌ مِنْ حَضْرَمَوْتَ مَا الْحَدَثُ يَا أَبَا هُرَيْرَةَ قَالَ فُسَاءٌ أَوْ ضُرَاطٌ‏.‏",
			"headingArabic": "اَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍ",
			"headingUrdu": "کوئی نماز بغیر وضو کے قبول نہیں ہوتی (یعنی وضو سے چھوٹی حدیث یا غسل کرکے بڑی حدیث)",
			"headingEnglish": "No Salat (prayer) Is Accepted Without Ablution (i.e, To Remove, The Small Hadith By Ablution Or The Big Hadith By Taking A Bath)",
			"chapterId": "4",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 4,
				"chapterNumber": "4",
				"chapterEnglish": "Ablutions (Wudu')",
				"chapterUrdu": "وضو کے بیان میں",
				"chapterArabic": "كتاب الوضوء",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 248,
			"hadithNumber": "248",
			"englishNarrator": "Narrated `Aisha:",
			"hadithEnglish": "Whenever the Prophet (ﷺ) took a bath after Janaba he started by washing his hands and then performed ablution like that for the prayer. After that he would put his fingers in water and move the roots of his hair with them, and then pour three handfuls of water over his head and then pour water all over his body.",
			"hadithUrdu": "نبی کریم صلی اللہ علیہ وسلم جب غسل فرماتے تو آپ صلی اللہ علیہ وسلم پہلے اپنے دونوں ہاتھ دھوتے پھر اسی طرح وضو کرتے جیسا نماز کے لیے آپ صلی اللہ علیہ وسلم وضو کیا کرتے تھے ۔ پھر پانی میں اپنی انگلیاں داخل فرماتے اور ان سے بالوں کی جڑوں کا خلال کرتے ۔ پھر اپنے ہاتھوں سے تین چلو سر پر ڈالتے پھر تمام بدن پر پانی بہا لیتے ۔",
			"urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں مالک نے ہشام سے خبر دی ، وہ اپنے والد سے ، وہ نبی کریم صلی اللہ علیہ وسلم کی زوجہ مطہرہ حضرت عائشہ رضی اللہ عنہا سے روایت کرتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامٍ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم أَنَّ النَّبِيَّ صلى الله عليه وسلم كَانَ إِذَا اغْتَسَلَ مِنَ الْجَنَابَةِ بَدَأَ فَغَسَلَ يَدَيْهِ، ثُمَّ يَتَوَضَّأُ كَمَا يَتَوَضَّأُ لِلصَّلاَةِ، ثُمَّ يُدْخِلُ أَصَابِعَهُ فِي الْمَاءِ، فَيُخَلِّلُ بِهَا أُصُولَ شَعَرِهِ ثُمَّ يَصُبُّ عَلَى رَأْسِهِ ثَلاَثَ غُرَفٍ بِيَدَيْهِ، ثُمَّ يُفِيضُ الْمَاءَ عَلَى جِلْدِهِ كُلِّهِ‏.‏",
			"headingArabic": "الْوُضُوءِ قَبْلَ الْغُسْلِ",
			"headingUrdu": "نہانے سے پہلے وضو کرنے کا عمل",
			"headingEnglish": "The performance of ablution before taking a bath",
			"chapterId": "5",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 5,
				"chapterNumber": "5",
				"chapterEnglish": "Bathing (Ghusl)",
				"chapterUrdu": "غسل کے احکام و مسائل",
				"chapterArabic": "كتاب الغسل",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 293,
			"hadithNumber": "294",
			"englishNarrator": "Narrated `Aisha رضی اللہ عنہا :",
			"hadithEnglish": "\"We set out with the sole intention of performing Hajj and when we reached Sarif, (a place six miles from Mecca) I got my menses. Allah's Messenger (ﷺ) came to me while I was weeping. He said 'What is the matter with you? Have you got your menses?' I replied, 'Yes.' He said, 'This is a thing which Allah has ordained for the daughters of Adam. So do what all the pilgrims do with the exception of the Tawaf (Circumambulation) round the Ka`ba.\" `Aisha رضی اللہ عنہا added, \"Allah's Messenger (ﷺ) sacrificed cows on behalf of his wives.\"",
			"hadithUrdu": "ہم حج کے ارادہ سے نکلے ۔ جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی اور اس رنج میں رونے لگی کہ رسول اللہ صلی اللہ علیہ وسلم تشریف لائے ، آپ صلی اللہ علیہ وسلم نے پوچھا تمہیں کیا ہو گیا ۔ کیا حائضہ ہو گئی ہو ۔ میں نے کہا ، ہاں ! آپ صلی اللہ علیہ وسلم نے فرمایا کہ یہ ایک ایسی چیز ہے جس کو اللہ تعالیٰ نے آدم کی بیٹیوں کے لیے لکھ دیا ہے ۔ اس لیے تم بھی حج کے افعال پورے کر لو ۔ البتہ بیت اللہ کا طواف نہ کرنا ۔ حضرت عائشہ رضی اللہ عنہا نے فرمایا کہ رسول کریم صلی اللہ علیہ وسلم نے اپنی بیویوں کی طرف سے گائے کی قربانی کی ۔ ( سرف ایک مقام مکہ سے چھ سات میل کے فاصلہ پر ہے ) ۔",
			"urduNarrator": "ہم سے علی بن عبداللہ نے بیان کیا ، کہا ہم سے سفیان نے ، کہا میں نے عبدالرحمٰن بن قاسم سے سنا ، کہا میں نے قاسم سے سنا ۔ وہ کہتے تھے میں نے حضرت عائشہ رضی اللہ عنہا سے سنا ۔ آپ فرماتی تھیں کہ",
			"hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ عَبْدِ اللَّهِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ سَمِعْتُ عَبْدَ الرَّحْمَنِ بْنَ الْقَاسِمِ، قَالَ سَمِعْتُ الْقَاسِمَ، يَقُولُ سَمِعْتُ عَائِشَةَ، تَقُولُ خَرَجْنَا لاَ نَرَى إِلاَّ الْحَجَّ، فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ، فَدَخَلَ عَلَىَّ رَسُولُ اللَّهِ صلى الله عليه وسلم وَأَنَا أَبْكِي قَالَ ‏\"‏ مَا لَكِ أَنُفِسْتِ ‏\"‏‏.‏ قُلْتُ نَعَمْ‏.‏ قَالَ ‏\"‏ إِنَّ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَلَى بَنَاتِ آدَمَ، فَاقْضِي مَا يَقْضِي الْحَاجُّ، غَيْرَ أَنْ لاَ تَطُوفِي بِالْبَيْتِ ‏\"‏‏.‏ قَالَتْ وَضَحَّى رَسُولُ اللَّهِ صلى الله عليه وسلم عَنْ نِسَائِهِ بِالْبَقَرِ‏.‏",
			"headingArabic": "الأَمْرِ بِالنُّفَسَاءِ إِذَا نُفِسْنَ",
			"headingUrdu": "حیض (ایک چیز) جو عورتوں کے لیے (اللہ کی طرف سے اور ہدایات) مقرر کی گئی ہے جب انہیں حیض آتا ہے۔",
			"headingEnglish": "Menses (a thing) ordained (by Allah and instructions) for women when they get their menses",
			"chapterId": "6",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 6,
				"chapterNumber": "6",
				"chapterEnglish": "Menstrual Periods",
				"chapterUrdu": "حیض کے احکام و مسائل",
				"chapterArabic": "كتاب الحيض",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 330,
			"hadithNumber": "334",
			"englishNarrator": "Narrated `Aisha (the wife of the Prophet):",
			"hadithEnglish": "We set out with Allah's Messenger (ﷺ) on one of his journeys till we reached Al- Baida' or Dhatul-Jaish, a necklace of mine was broken (and lost). Allah's Messenger (ﷺ) stayed there to search for it, and so did the people along with him. There was no water at that place, so the people went to Abu- Bakr As-Siddiq and said, \"Don't you see what `Aisha has done? She has made Allah's Apostle and the people stay where there is no water and they have no water with them.\" Abu Bakr came while Allah's Messenger (ﷺ) was sleeping with his head on my thigh, He said, to me: \"You have detained Allah's Messenger (ﷺ) and the people where there is no water and they have no water with them. So he admonished me and said what Allah wished him to say and hit me on my flank with his hand. Nothing prevented me from moving (because of pain) but the position of Allah's Messenger (ﷺ) on my thigh. Allah's Messenger (ﷺ) got up when dawn broke and there was no water. So Allah revealed the Divine Verses of Tayammum. So they all performed Tayammum. Usaid bin Hudair said, \"O the family of Abu Bakr! This is not the first blessing of yours.\" Then the camel on which I was riding was caused to move from its place and the necklace was found beneath it.",
			"hadithUrdu": "ہم رسول اللہ صلی اللہ علیہ وسلم کے ساتھ بعض سفر ( غزوہ بنی المصطلق ) میں تھے ۔ جب ہم مقام بیداء یا ذات الجیش پر پہنچے تو میرا ایک ہار کھو گیا ۔ رسول اللہ صلی اللہ علیہ وسلم اس کی تلاش میں وہیں ٹھہر گئے اور لوگ بھی آپ صلی اللہ علیہ وسلم کے ساتھ ٹھہر گئے ۔ لیکن وہاں پانی کہیں قریب میں نہ تھا ۔ لوگ حضرت ابوبکر رضی اللہ عنہ کے پاس آئے اور کہا ” حضرت عائشہ رضی اللہ عنہا نے کیا کام کیا ؟ کہ رسول اللہ صلی اللہ علیہ وسلم اور تمام لوگوں کو ٹھہرا دیا ہے اور پانی بھی کہیں قریب میں نہیں ہے اور نہ لوگوں ہی کے ساتھ ہے ۔ “ پھر ابوبکر صدیق رضی اللہ عنہ تشریف لائے ، رسول اللہ صلی اللہ علیہ وسلم اپنا سرمبارک میری ران پر رکھے ہوئے سو رہے تھے ۔ فرمانے لگے کہ تم نے رسول اللہ صلی اللہ علیہ وسلم اور تمام لوگوں کو روک لیا ۔ حالانکہ قریب میں کہیں پانی بھی نہیں ہے اور نہ لوگوں کے پاس ہے ۔ حضرت عائشہ رضی اللہ عنہا کہتی ہیں کہ والد ماجد ( رضی اللہ عنہ ) مجھ پر بہت خفا ہوئے اور اللہ نے جو چاہا انھوں نے مجھے کہا اور اپنے ہاتھ سے میری کوکھ میں کچوکے لگائے ۔ رسول اللہ صلی اللہ علیہ وسلم کا سرمبارک میری ران پر تھا ۔ اس وجہ سے میں حرکت بھی نہیں کر سکتی تھی ۔ رسول اللہ صلی اللہ علیہ وسلم جب صبح کے وقت اٹھے تو پانی کا پتہ تک نہ تھا ۔ پس اللہ تعالیٰ نے تیمم کی آیت اتاری اور لوگوں نے تیمم کیا ۔ اس پر اسید بن حضیر رضی اللہ عنہ نے کہا ” اے آل ابی بکر ! یہ تمہاری کوئی پہلی برکت نہیں ہے ۔ “ عائشہ ( رضی اللہ عنہا ) نے فرمایا ۔ پھر ہم نے اس اونٹ کو ہٹایا جس پر میں سوار تھی تو ہار اسی کے نیچے مل گیا ۔",
			"urduNarrator": "ہم سے عبداللہ بن یوسف نے بیان کیا ، انھوں نے کہا ہمیں مالک نے عبدالرحمٰن بن قاسم سے خبر دی ، انھوں نے اپنے والد سے ، انھوں نے نبی کریم صلی اللہ علیہ وسلم کی زوجہ محترمہ حضرت عائشہ رضی اللہ عنہا سے ، آپ نے بتلایا کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، زَوْجِ النَّبِيِّ صلى الله عليه وسلم قَالَتْ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صلى الله عليه وسلم فِي بَعْضِ أَسْفَارِهِ، حَتَّى إِذَا كُنَّا بِالْبَيْدَاءِ ـ أَوْ بِذَاتِ الْجَيْشِ ـ انْقَطَعَ عِقْدٌ لِي، فَأَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم عَلَى الْتِمَاسِهِ، وَأَقَامَ النَّاسُ مَعَهُ، وَلَيْسُوا عَلَى مَاءٍ، فَأَتَى النَّاسُ إِلَى أَبِي بَكْرٍ الصِّدِّيقِ فَقَالُوا أَلاَ تَرَى مَا صَنَعَتْ عَائِشَةُ أَقَامَتْ بِرَسُولِ اللَّهِ صلى الله عليه وسلم وَالنَّاسِ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ‏.‏ فَجَاءَ أَبُو بَكْرٍ وَرَسُولُ اللَّهِ صلى الله عليه وسلم وَاضِعٌ رَأْسَهُ عَلَى فَخِذِي قَدْ نَامَ فَقَالَ حَبَسْتِ رَسُولَ اللَّهِ صلى الله عليه وسلم وَالنَّاسَ، وَلَيْسُوا عَلَى مَاءٍ، وَلَيْسَ مَعَهُمْ مَاءٌ‏.‏ فَقَالَتْ عَائِشَةُ فَعَاتَبَنِي أَبُو بَكْرٍ، وَقَالَ مَا شَاءَ اللَّهُ أَنْ يَقُولَ، وَجَعَلَ يَطْعُنُنِي بِيَدِهِ فِي خَاصِرَتِي، فَلاَ يَمْنَعُنِي مِنَ التَّحَرُّكِ إِلاَّ مَكَانُ رَسُولِ اللَّهِ صلى الله عليه وسلم عَلَى فَخِذِي، فَقَامَ رَسُولُ اللَّهِ صلى الله عليه وسلم حِينَ أَصْبَحَ عَلَى غَيْرِ مَاءٍ، فَأَنْزَلَ اللَّهُ آيَةَ التَّيَمُّمِ فَتَيَمَّمُوا‏.‏ فَقَالَ أُسَيْدُ بْنُ الْحُضَيْرِ مَا هِيَ بِأَوَّلِ بَرَكَتِكُمْ يَا آلَ أَبِي بَكْرٍ‏.‏ قَالَتْ فَبَعَثْنَا الْبَعِيرَ الَّذِي كُنْتُ عَلَيْهِ، فَأَصَبْنَا الْعِقْدَ تَحْتَهُ‏.‏",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "7",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 7,
				"chapterNumber": "7",
				"chapterEnglish": "Rubbing hands and feet with dust (Tayammum)",
				"chapterUrdu": "تیمم کے احکام و مسائل",
				"chapterArabic": "كتاب التيمم",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 345,
			"hadithNumber": "349",
			"englishNarrator": "Narrated Abu Dhar:",
			"hadithEnglish": "Allah's Messenger (ﷺ) said, \"While I was at Mecca the roof of my house was opened and Gabriel descended, opened my chest, and washed it with Zamzam water. Then he brought a golden tray full of wisdom and faith and having poured its contents into my chest, he closed it. Then he took my hand and ascended with me to the nearest heaven, when I reached the nearest heaven, Gabriel said to the gatekeeper of the heaven, 'Open (the gate).' The gatekeeper asked, 'Who is it?' Gabriel answered: 'Gabriel.' He asked, 'Is there anyone with you?' Gabriel replied, 'Yes, Muhammad I is with me.' He asked, 'Has he been called?' Gabriel said, 'Yes.' So the gate was opened and we went over the nearest heaven and there we saw a man sitting with some people on his right and some on his left. When he looked towards his right, he laughed and when he looked toward his left he wept. Then he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' He replied, 'He is Adam عليه السّلام and the people on his right and left are the souls of his offspring. Those on his right are the people of Paradise and those on his left are the people of Hell and when he looks towards his right he laughs and when he looks towards his left he weeps.' Then he ascended with me till he reached the second heaven and he (Gabriel) said to its gatekeeper, 'Open (the gate).' The gatekeeper said to him the same as the gatekeeper of the first heaven had said and he opened the gate. Anas said: \"Abu Dhar added that the Prophet (ﷺ) met Adam, Idris, Moses, Jesus and Abraham علیہم السلام, he (Abu Dhar) did not mention on which heaven they were but he mentioned that he (the Prophet (ﷺ) ) met Adam on the nearest heaven and Abraham on the sixth heaven. Anas said, \"When Gabriel along with the Prophet (ﷺ) passed by Idris, the latter said, 'Welcome! O pious Prophet and pious brother.' The Prophet (ﷺ) asked, 'Who is he?' Gabriel replied, 'He is Idris.\" The Prophet (ﷺ) added, \"I passed by Moses and he said, 'Welcome! O pious Prophet and pious brother.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Moses.' Then I passed by Jesus and he said, 'Welcome! O pious brother and pious Prophet.' I asked, 'Who is he?' Gabriel replied, 'He is Jesus عليه السّلام. Then I passed by Abraham and he said, 'Welcome! O pious Prophet and pious son.' I asked Gabriel, 'Who is he?' Gabriel replied, 'He is Abraham عليه السّلام. The Prophet (ﷺ) added, 'Then Gabriel ascended with me to a place where I heard the creaking of the pens.\" Ibn Hazm and Anas bin Malik said: The Prophet (ﷺ) said, \"Then Allah enjoined fifty prayers on my followers when I returned with this order of Allah, I passed by Moses who asked me, 'What has Allah enjoined on your followers?' I replied, 'He has enjoined fifty prayers on them.' Moses said, 'Go back to your Lord (and appeal for reduction) for your followers will not be able to bear it.' (So I went back to Allah and requested for reduction) and He reduced it to half. When I passed by Moses again and informed him about it, he said, 'Go back to your Lord as your followers will not be able to bear it.' So I returned to Allah and requested for further reduction and half of it was reduced. I again passed by Moses and he said to me: 'Return to your Lord, for your followers will not be able to bear it. So I returned to Allah and He said, 'These are five prayers and they are all (equal to) fifty (in reward) for My Word does not change.' I returned to Moses and he told me to go back once again. I replied, 'Now I feel shy of asking my Lord again.' Then Gabriel took me till we '' reached Sidrat-il-Muntaha (Lote tree of; the utmost boundary) which was shrouded in colors, indescribable. Then I was admitted into Paradise where I found small (tents or) walls (made) of pearls and its earth was of musk.\"",
			"hadithUrdu": "آنحضرت صلی اللہ علیہ وسلم نے فرمایا کہ میرے گھر کی چھت کھول دی گئی ، اس وقت میں مکہ میں تھا ۔ پھر جبرائیل علیہ السلام اترے اور انھوں نے میرا سینہ چاک کیا ۔ پھر اسے زمزم کے پانی سے دھویا ۔ پھر ایک سونے کا طشت لائے جو حکمت اور ایمان سے بھرا ہوا تھا ۔ اس کو میرے سینے میں رکھ دیا ، پھر سینے کو جوڑ دیا ، پھر میرا ہاتھ پکڑا اور مجھے آسمان کی طرف لے کر چلے ۔ جب میں پہلے آسمان پر پہنچا تو جبرائیل علیہ السلام نے آسمان کے داروغہ سے کہا کھولو ۔ اس نے پوچھا ، آپ کون ہیں ؟ جواب دیا کہ جبرائیل ، پھر انھوں نے پوچھا کیا آپ کے ساتھ کوئی اور بھی ہے ؟ جواب دیا ، ہاں میرے ساتھ محمد ( صلی اللہ علیہ وسلم ) ہیں ۔ انھوں نے پوچھا کہ کیا ان کے بلانے کے لیے آپ کو بھیجا گیا تھا ؟ کہا ، جی ہاں ! پھر جب انھوں نے دروازہ کھولا تو ہم پہلے آسمان پر چڑھ گئے ، وہاں ہم نے ایک شخص کو بیٹھے ہوئے دیکھا ۔ ان کے داہنی طرف کچھ لوگوں کے جھنڈ تھے اور کچھ جھنڈ بائیں طرف تھے ۔ جب وہ اپنی داہنی طرف دیکھتے تو مسکرا دیتے اور جب بائیں طرف نظر کرتے تو روتے ۔ انھوں نے مجھے دیکھ کر فرمایا ، آؤ اچھے آئے ہو ۔ صالح نبی اور صالح بیٹے ! میں نے جبرائیل علیہ السلام سے پوچھا یہ کون ہیں ؟ انھوں نے کہا کہ یہ آدم علیہ السلام ہیں اور ان کے دائیں بائیں جو جھنڈ ہیں یہ ان کے بیٹوں کی روحیں ہیں ۔ جو جھنڈ دائیں طرف ہیں وہ جنتی ہیں اور بائیں طرف کے جھنڈ دوزخی روحیں ہیں ۔ اس لیے جب وہ اپنے دائیں طرف دیکھتے ہیں تو خوشی سے مسکراتے ہیں اور جب بائیں طرف دیکھتے ہیں تو ( رنج سے ) روتے ہیں ۔ پھر جبرائیل مجھے لے کر دوسرے آسمان تک پہنچے اور اس کے داروغہ سے کہا کہ کھولو ۔ اس آسمان کے داروغہ نے بھی پہلے کی طرح پوچھا پھر کھول دیا ۔ حضرت انس نے کہا کہ ابوذر نے ذکر کیا کہ آپ صلی اللہ علیہ وسلم یعنی نبی کریم صلی اللہ علیہ وسلم نے آسمان پر آدم ، ادریس ، موسیٰ ، عیسیٰ اور ابراہیم علیہم السلام کو موجود پایا ۔ اور ابوذر رضی اللہ عنہ نے ہر ایک کا ٹھکانہ نہیں بیان کیا ۔ البتہ اتنا بیان کیا کہ آنحضور صلی اللہ علیہ وسلم نے حضرت آدم کو پہلے آسمان پر پایا اور حضرت ابراہیم علیہ السلام کو چھٹے آسمان پر ۔ انس نے بیان کیا کہ جب جبرائیل علیہ السلام نبی کریم صلی اللہ علیہ وسلم کے ساتھ ادریس علیہ السلام پر گزرے ۔ تو انھوں نے فرمایا کہ آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جواب دیا کہ یہ ادریس علیہ السلام ہیں ۔ پھر موسیٰ علیہ السلام تک پہنچا تو انھوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ موسیٰ علیہ السلام ہیں ۔ پھر میں عیسیٰ علیہ السلام تک پہنچا ، انھوں نے کہا آؤ اچھے آئے ہو صالح نبی اور صالح بھائی ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ عیسیٰ علیہ السلام ہیں ۔ پھر میں ابراہیم علیہ السلام تک پہنچا ۔ انھوں نے فرمایا آؤ اچھے آئے ہو صالح نبی اور صالح بیٹے ۔ میں نے پوچھا یہ کون ہیں ؟ جبرائیل علیہ السلام نے بتایا کہ یہ حضرت ابراہیم علیہ السلام ہیں ۔ ابن شہاب نے کہا کہ مجھے ابوبکر بن حزم نے خبر دی کہ عبداللہ بن عباس اور ابوحبۃ الانصاری رضی اللہ عنہم کہا کرتے تھے کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ، پھر مجھے جبرائیل علیہ السلام لے کر چڑھے ، اب میں اس بلند مقام تک پہنچ گیا جہاں میں نے قلم کی آواز سنی ( جو لکھنے والے فرشتوں کی قلموں کی آواز تھی ) ابن حزم نے ( اپنے شیخ سے ) اور انس بن مالک نے ابوذر رضی اللہ عنہ سے نقل کیا کہ نبی کریم صلی اللہ علیہ وسلم نے فرمایا ۔ پس اللہ تعالیٰ نے میری امت پر پچاس وقت کی نمازیں فرض کیں ۔ میں یہ حکم لے کر واپس لوٹا ۔ جب موسیٰ علیہ السلام تک پہنچا تو انھوں نے پوچھا کہ آپ کی امت پر اللہ نے کیا فرض کیا ہے ؟ میں نے کہا کہ پچاس وقت کی نمازیں فرض کی ہیں ۔ انھوں نے فرمایا آپ واپس اپنے رب کی بارگاہ میں جائیے ۔ کیونکہ آپ کی امت اتنی نمازوں کو ادا کرنے کی طاقت نہیں رکھتی ہے ۔ میں واپس بارگاہ رب العزت میں گیا تو اللہ نے اس میں سے ایک حصہ کم کر دیا ، پھر موسیٰ علیہ السلام کے پاس آیا اور کہا کہ ایک حصہ کم کر دیا گیا ہے ، انھوں نے کہا کہ دوبارہ جائیے کیونکہ آپ کی امت میں اس کے برداشت کی بھی طاقت نہیں ہے ۔ پھر میں بارگاہ رب العزت میں حاضر ہوا ۔ پھر ایک حصہ کم ہوا ۔ جب موسیٰ علیہ السلام کے پاس پہنچا تو انھوں نے فرمایا کہ اپنے رب کی بارگاہ میں پھر جائیے ، کیونکہ آپ کی امت اس کو بھی برداشت نہ کر سکے گی ، پھر میں باربار آیا گیا پس اللہ تعالیٰ نے فرمایا کہ یہ نمازیں ( عمل میں ) پانچ ہیں اور ( ثواب میں ) پچاس ( کے برابر ) ہیں ۔ میری بات بدلی نہیں جاتی ۔ اب میں موسیٰ علیہ السلام کے پاس آیا تو انھوں نے پھر کہا کہ اپنے رب کے پاس جائیے ۔ لیکن میں نے کہا مجھے اب اپنے رب سے شرم آتی ہے ۔ پھر جبرائیل مجھے سدرۃالمنتہیٰ تک لے گئے جسے کئی طرح کے رنگوں نے ڈھانک رکھا تھا ۔ جن کے متعلق مجھے معلوم نہیں ہوا کہ وہ کیا ہیں ۔ اس کے بعد مجھے جنت میں لے جایا گیا ، میں نے دیکھا کہ اس میں موتیوں کے ہار ہیں اور اس کی مٹی مشک کی ہے ۔",
			"urduNarrator": "ہم سے یحییٰ بن بکیر نے بیان کیا ، انھوں نے کہا ہم سے لیث بن سعد نے یونس کے واسطہ سے بیان کیا ، انھوں نے ابن شہاب سے ، انھوں نے انس بن مالک سے ، انھوں نے فرمایا کہ ابوذر غفاری رضی اللہ عنہ یہ حدیث بیان کرتے تھے کہ",
			"hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ أَبُو ذَرٍّ يُحَدِّثُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ فُرِجَ عَنْ سَقْفِ بَيْتِي وَأَنَا بِمَكَّةَ، فَنَزَلَ جِبْرِيلُ فَفَرَجَ صَدْرِي، ثُمَّ غَسَلَهُ بِمَاءِ زَمْزَمَ، ثُمَّ جَاءَ بِطَسْتٍ مِنْ ذَهَبٍ مُمْتَلِئٍ حِكْمَةً وَإِيمَانًا، فَأَفْرَغَهُ فِي صَدْرِي ثُمَّ أَطْبَقَهُ، ثُمَّ أَخَذَ بِيَدِي فَعَرَجَ بِي إِلَى السَّمَاءِ الدُّنْيَا، فَلَمَّا جِئْتُ إِلَى السَّمَاءِ الدُّنْيَا قَالَ جِبْرِيلُ لِخَازِنِ السَّمَاءِ افْتَحْ‏.‏ قَالَ مَنْ هَذَا قَالَ هَذَا جِبْرِيلُ‏.‏ قَالَ هَلْ مَعَكَ أَحَدٌ قَالَ نَعَمْ مَعِي مُحَمَّدٌ صلى الله عليه وسلم‏.‏ فَقَالَ أُرْسِلَ إِلَيْهِ قَالَ نَعَمْ‏.‏ فَلَمَّا فَتَحَ عَلَوْنَا السَّمَاءَ الدُّنْيَا، فَإِذَا رَجُلٌ قَاعِدٌ عَلَى يَمِينِهِ أَسْوِدَةٌ وَعَلَى يَسَارِهِ أَسْوِدَةٌ، إِذَا نَظَرَ قِبَلَ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ يَسَارِهِ بَكَى، فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ لِجِبْرِيلَ مَنْ هَذَا قَالَ هَذَا آدَمُ‏.‏ وَهَذِهِ الأَسْوِدَةُ عَنْ يَمِينِهِ وَشِمَالِهِ نَسَمُ بَنِيهِ، فَأَهْلُ الْيَمِينِ مِنْهُمْ أَهْلُ الْجَنَّةِ، وَالأَسْوِدَةُ الَّتِي عَنْ شِمَالِهِ أَهْلُ النَّارِ، فَإِذَا نَظَرَ عَنْ يَمِينِهِ ضَحِكَ، وَإِذَا نَظَرَ قِبَلَ شِمَالِهِ بَكَى، حَتَّى عَرَجَ بِي إِلَى السَّمَاءِ الثَّانِيَةِ فَقَالَ لِخَازِنِهَا افْتَحْ‏.‏ فَقَالَ لَهُ خَازِنُهَا مِثْلَ مَا قَالَ الأَوَّلُ فَفَتَحَ ‏\"‏‏.‏ قَالَ أَنَسٌ فَذَكَرَ أَنَّهُ وَجَدَ فِي السَّمَوَاتِ آدَمَ وَإِدْرِيسَ وَمُوسَى وَعِيسَى وَإِبْرَاهِيمَ ـ صَلَوَاتُ اللَّهِ عَلَيْهِمْ ـ وَلَمْ يُثْبِتْ كَيْفَ مَنَازِلُهُمْ، غَيْرَ أَنَّهُ ذَكَرَ أَنَّهُ وَجَدَ آدَمَ فِي السَّمَاءِ الدُّنْيَا، وَإِبْرَاهِيمَ فِي السَّمَاءِ السَّادِسَةِ‏.‏ قَالَ أَنَسٌ فَلَمَّا مَرَّ جِبْرِيلُ بِالنَّبِيِّ صلى الله عليه وسلم بِإِدْرِيسَ قَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ فَقُلْتُ مَنْ هَذَا قَالَ هَذَا إِدْرِيسُ‏.‏ ثُمَّ مَرَرْتُ بِمُوسَى فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالأَخِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا مُوسَى‏.‏ ثُمَّ مَرَرْتُ بِعِيسَى فَقَالَ مَرْحَبًا بِالأَخِ الصَّالِحِ وَالنَّبِيِّ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا عِيسَى‏.‏ ثُمَّ مَرَرْتُ بِإِبْرَاهِيمَ فَقَالَ مَرْحَبًا بِالنَّبِيِّ الصَّالِحِ وَالاِبْنِ الصَّالِحِ‏.‏ قُلْتُ مَنْ هَذَا قَالَ هَذَا إِبْرَاهِيمُ صلى الله عليه وسلم ‏\"‏‏.‏ قَالَ ابْنُ شِهَابٍ فَأَخْبَرَنِي ابْنُ حَزْمٍ أَنَّ ابْنَ عَبَّاسٍ وَأَبَا حَبَّةَ الأَنْصَارِيَّ كَانَا يَقُولاَنِ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ ثُمَّ عُرِجَ بِي حَتَّى ظَهَرْتُ لِمُسْتَوًى أَسْمَعُ فِيهِ صَرِيفَ الأَقْلاَمِ ‏\"‏‏.‏ قَالَ ابْنُ حَزْمٍ وَأَنَسُ بْنُ مَالِكٍ قَالَ النَّبِيُّ صلى الله عليه وسلم ‏\"‏ فَفَرَضَ اللَّهُ عَلَى أُمَّتِي خَمْسِينَ صَلاَةً، فَرَجَعْتُ بِذَلِكَ حَتَّى مَرَرْتُ عَلَى مُوسَى فَقَالَ مَا فَرَضَ اللَّهُ لَكَ عَلَى أُمَّتِكَ قُلْتُ فَرَضَ خَمْسِينَ صَلاَةً‏.‏ قَالَ فَارْجِعْ إِلَى رَبِّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ‏.‏ فَرَاجَعْتُ فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَى مُوسَى قُلْتُ وَضَعَ شَطْرَهَا‏.‏ فَقَالَ رَاجِعْ رَبَّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ، فَرَاجَعْتُ فَوَضَعَ شَطْرَهَا، فَرَجَعْتُ إِلَيْهِ فَقَالَ ارْجِعْ إِلَى رَبِّكَ، فَإِنَّ أُمَّتَكَ لاَ تُطِيقُ ذَلِكَ، فَرَاجَعْتُهُ‏.‏ فَقَالَ هِيَ خَمْسٌ وَهْىَ خَمْسُونَ، لاَ يُبَدَّلُ الْقَوْلُ لَدَىَّ‏.‏ فَرَجَعْتُ إِلَى مُوسَى فَقَالَ رَاجِعْ رَبَّكَ‏.‏ فَقُلْتُ اسْتَحْيَيْتُ مِنْ رَبِّي‏.‏ ثُمَّ انْطَلَقَ بِي حَتَّى انْتَهَى بِي إِلَى سِدْرَةِ الْمُنْتَهَى، وَغَشِيَهَا أَلْوَانٌ لاَ أَدْرِي مَا هِيَ، ثُمَّ أُدْخِلْتُ الْجَنَّةَ، فَإِذَا فِيهَا حَبَايِلُ اللُّؤْلُؤِ، وَإِذَا تُرَابُهَا الْمِسْكُ ‏\"‏‏.‏",
			"headingArabic": "كَيْفَ فُرِضَتِ الصَّلاَةُ فِي الإِسْرَاءِ",
			"headingUrdu": "رسول اللہ صلی اللہ علیہ وسلم کے یروشلم (اور پھر آسمانوں کی طرف) کی رات الاسراء (معجزانہ رات کے سفر) میں نماز کس طرح فرض کی گئی؟",
			"headingEnglish": "How As-Salat (the Prayer) was prescribed on the night of Al-Isra (miraculous night journey) of the Prophet (pbuh) to Jerusalem (and then to the heavens)",
			"chapterId": "8",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 8,
				"chapterNumber": "8",
				"chapterEnglish": "Prayers (Salat)",
				"chapterUrdu": "نماز کے احکام و مسائل",
				"chapterArabic": "كتاب الصلاة",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 511,
			"hadithNumber": "521, 522",
			"englishNarrator": "Narrated Ibn Shihab:",
			"hadithEnglish": "Once `Umar bin `Abdul `Aziz delayed the prayer and `Urwa bin Az-Zubair رضی اللہ عنہ went to him and said, \"Once in 'Iraq, Al-Mughira bin Shu`ba delayed his prayers and Abi Mas`ud Al-Ansari went to him and said, 'O Mughira! What is this? Don't you know that once Gabriel came and offered the prayer (Fajr prayer) and Allah's Messenger (ﷺ) prayed too, then he prayed again (Zuhr prayer) and so did Allah's Apostle and again he prayed (`Asr prayers and Allah's Messenger (ﷺ) did the same; again he prayed (Maghrib-prayer) and so did Allah's Messenger (ﷺ) and again prayed (`Isha prayer) and so did Allah's Apostle and (Gabriel) said, 'I was ordered to do so (to demonstrate the prayers prescribed to you)?'\" `Umar (bin `Abdul `Aziz) said to `Urwa, \"Be sure of what you Say. Did Gabriel lead Allah's Messenger (ﷺ) at the stated times of the prayers?\" `Urwa replied, \"Bashir bin Abi Mas`ud رضی اللہ عنہ narrated like this on the authority of his father.\" `Urwa added, \"Aisha told me that Allah's Messenger (ﷺ) used to pray `Asr prayer when the sunshine was still inside her residence (during the early time of `Asr).",
			"hadithUrdu": "حضرت عمر بن عبدالعزیز رحمہ اللہ علیہ نے ایک دن ( عصر کی ) نماز میں دیر کی ، پس عروہ بن زبیر رضی اللہ عنہ کے پاس تشریف لے گئے ، اور انھوں نے بتایا کہ ( اسی طرح ) مغیرہ بن شعبہ رضی اللہ عنہ نے ایک دن ( عراق کے ملک میں ) نماز میں دیر کی تھی جب وہ عراق میں ( حاکم ) تھے ۔ پس ابومسعود انصاری ( عقبہ بن عمر ) ان کی خدمت میں گئے ۔ اور فرمایا ، مغیرہ رضی اللہ عنہ ! آخر یہ کیا بات ہے ، کیا آپ کو معلوم نہیں کہ جب جبرائیل علیہ السلام تشریف لائے تو انھوں نے نماز پڑھی اور رسول کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے نماز پڑھی تو نبی کریم صلی اللہ علیہ وسلم نے بھی نماز پڑھی ، پھر جبرائیل علیہ السلام نے کہا کہ میں اسی طرح حکم دیا گیا ہوں ۔ اس پر حضرت عمر بن عبدالعزیز رحمہ اللہ نے عروہ سے کہا ، معلوم بھی ہے آپ کیا بیان کر رہے ہیں ؟ کیا جبرائیل علیہ السلام نے نبی کریم صلی اللہ علیہ وسلم کو نماز کے اوقات ( عمل کر کے ) بتلائے تھے ۔ عروہ نے کہا ، کہ ہاں اسی طرح بشیر بن ابی مسعود رضی اللہ عنہ اپنے والد کے واسطہ سے بیان کرتے تھے۔ عروہ رحمہ اللہ علیہ نے کہا کہ مجھ سے عائشہ رضی اللہ عنہا نے بیان کیا کہ رسول اللہ صلی اللہ علیہ وسلم عصر کی نماز اس وقت پڑھ لیتے تھے جب ابھی دھوپ ان کے حجرہ میں موجود ہوتی تھی اس سے بھی پہلے کہ وہ دیوار پر چڑھے ۔",
			"urduNarrator": "ہم سے عبداللہ بن مسلمہ نے بیان کیا ، انھوں نے کہا کہ میں نے امام مالک رحمہ اللہ علیہ کو پڑھ کر سنایا ابن شہاب کی روایت سے کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنِ ابْنِ شِهَابٍ، أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ، أَخَّرَ الصَّلاَةَ يَوْمًا، فَدَخَلَ عَلَيْهِ عُرْوَةُ بْنُ الزُّبَيْرِ، فَأَخْبَرَهُ أَنَّ الْمُغِيرَةَ بْنَ شُعْبَةَ أَخَّرَ الصَّلاَةَ يَوْمًا وَهْوَ بِالْعِرَاقِ، فَدَخَلَ عَلَيْهِ أَبُو مَسْعُودٍ الأَنْصَارِيُّ فَقَالَ مَا هَذَا يَا مُغِيرَةُ أَلَيْسَ قَدْ عَلِمْتَ أَنَّ جِبْرِيلَ نَزَلَ فَصَلَّى، فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ صَلَّى فَصَلَّى رَسُولُ اللَّهِ صلى الله عليه وسلم ثُمَّ قَالَ ‏ \"‏ بِهَذَا أُمِرْتُ ‏\"‏‏.‏ فَقَالَ عُمَرُ لِعُرْوَةَ اعْلَمْ مَا تُحَدِّثُ أَوَإِنَّ جِبْرِيلَ هُوَ أَقَامَ لِرَسُولِ اللَّهِ صلى الله عليه وسلم وَقْتَ الصَّلاَةِ‏.‏ قَالَ عُرْوَةُ كَذَلِكَ كَانَ بَشِيرُ بْنُ أَبِي مَسْعُودٍ يُحَدِّثُ عَنْ أَبِيهِ‏.‏قَالَ عُرْوَةُ وَلَقَدْ حَدَّثَتْنِي عَائِشَةُ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم كَانَ يُصَلِّي الْعَصْرَ، وَالشَّمْسُ فِي حُجْرَتِهَا قَبْلَ أَنْ تَظْهَرَ‏.‏",
			"headingArabic": "مَوَاقِيتِ الصَّلاَةِ وَفَضْلِهَا",
			"headingUrdu": "نماز کے اوقات اور وقت پر نماز پڑھنے کی فضیلت",
			"headingEnglish": "The times of As-Salat (the prayers) and the superiority of offering Salat (prayers) in time",
			"chapterId": "9",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 9,
				"chapterNumber": "9",
				"chapterEnglish": "Times of the Prayers",
				"chapterUrdu": "اوقات نماز کے بیان میں",
				"chapterArabic": "كتاب مواقيت الصلاة",
				"bookSlug": "sahih-bukhari"
			}
		},
		{
			"id": 588,
			"hadithNumber": "603",
			"englishNarrator": "Narrated Anas رضی اللہ عنہ :",
			"hadithEnglish": "The people mentioned the fire and the bell (they suggested those as signals to indicate the starting of prayers), and by that they mentioned the Jews and the Christians. Then Bilal رضی اللہ عنہ was ordered to pronounce Adhan for the prayer by saying its wordings twice, and for the Iqama (the call for the actual standing for the prayers in rows) by saying its wordings once. (Iqama is pronounced when the people are ready for the prayer).",
			"hadithUrdu": "( نماز کے وقت کے اعلان کے لیے ) لوگوں نے آگ اور ناقوس کا ذکر کیا ۔ پھر یہود و نصاریٰ کا ذکر آ گیا ۔ پھر بلال رضی اللہ عنہ کو یہ حکم ہوا کہ اذان کے کلمات دو دو مرتبہ کہیں اور اقامت میں ایک ایک مرتبہ ۔",
			"urduNarrator": "ہم سے عمران بن میسرہ نے بیان کیا ، کہا کہ ہم سے عبدالوارث بن سعید نے بیان کیا ، کہا کہ ہم سے خالد حذاء نے ابوقلابہ عبداللہ بن زید سے ، انھوں نے حضرت انس رضی اللہ عنہ سے کہ",
			"hadithArabic": "حَدَّثَنَا عِمْرَانُ بْنُ مَيْسَرَةَ، حَدَّثَنَا عَبْدُ الْوَارِثِ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ أَبِي قِلاَبَةَ، عَنْ أَنَسٍ، قَالَ ذَكَرُوا النَّارَ وَالنَّاقُوسَ، فَذَكَرُوا الْيَهُودَ وَالنَّصَارَى، فَأُمِرَ بِلاَلٌ أَنْ يَشْفَعَ الأَذَانَ وَأَنْ يُوتِرَ الإِقَامَةَ‏.‏",
			"headingArabic": "بَدْءُ الأَذَانِ",
			"headingUrdu": "نماز کے لیے اذان کیسے شروع ہوئی؟",
			"headingEnglish": "How the Adhan for Salat (Prayer) was started",
			"chapterId": "10",
			"bookSlug": "sahih-bukhari",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 1,
				"bookName": "Sahih Bukhari",
				"writerName": "Imam Bukhari",
				"aboutWriter": null,
				"writerDeath": "256 ھ",
				"bookSlug": "sahih-bukhari"
			},
			"chapter": {
				"id": 10,
				"chapterNumber": "10",
				"chapterEnglish": "Call to Prayers (Adhaan)",
				"chapterUrdu": "اذان کے مسائل کے بیان میں",
				"chapterArabic": "كتاب الأذان",
				"bookSlug": "sahih-bukhari"
			}
		}
	],
	"sahih-muslim": [
		{
			"id": 7564,
			"hadithNumber": "0",
			"englishNarrator": null,
			"hadithEnglish": "In the Name of Allah, the Merciful, the Beneficent - All praise is due to Allah, Lord of the worlds, and the [praiseworthy] end is for those who fear Him; and may Allah send blessings upon Muhammad, seal of the Prophets, and upon all the Prophets and Messengers. As for what follows: Indeed you mentioned, may Allah have mercy on you, by the guidance of your Creator, that you were interested in an examination of what is known of all the transmitted reports on authority of the Messenger of Allah, peace and blessings upon him, regarding traditions of the Dīn, its rulings, and everything from it regarding rewards, punishments, motivations, admonishments, and other descriptive topics through chains of narration which were related by and circulated between Ahl ul-Ilm. Thus you wished, may Allah guide you aright, to be informed about all of [the transmitted reports] in the form of a calculated composition and you asked me to abridge [it] for you in writing without a great amount of repetition. You allege that [much repetition] would distract you from what you intended in terms of understanding and deriving rulings from [the reports]. And because of that which you have asked, may Allah be generous with you, when I am attributed to its successful management and whatever condition can be construed by it, if Allah wills, (it will lead to) a praiseworthy ending and obtainable benefit. I thought at the time you asked me to undertake that [task]- if it was determined for me to do so, and preordained for me to complete it- that the first to benefit from that would be me specifically before anyone else and this is due to a great number of reasons which are too lengthy to describe except [to say] that in summary, having precision regarding a select few [narrations], and accuracy in them, is easier for a person than to undertake of a great number of them, and especially for one who is indistinguishable in it from the common people [in this matter] unless someone else informs him of the distinction. If the matter is just as we described, then focusing on the few authentic narrations is worthier for them than seeking an abundance of weak narrations. Although indeed it is hoped for that some benefit is attained by seeking after a large number [of Ḥadīth] of this type, and gathering the repetitions for them, but only for the elite who are endowed with some awareness and knowledge in their means [of ascertaining authenticity] and defects. Thus that, if Allah wills, will happen through whatever will be brought to bear of that [awareness, distinction, knowledge of the means, and defects] on the advantage in seeking large numbers of [the various categories of Ḥadīth]. And as for the common people who are different from the elite in terms of awareness and knowledge, then it is senseless for them to seek large numbers [of various categories of Ḥadīth], while they are unaware of the few [Sahīh]. Then we, if Allah wills, will begin to extract and compose what you have asked upon conditions which we shall mention to you. We set ourselves upon the entirety of what is transmitted from the reports on authority of the Messenger of Allah, peace and blessings upon him. Then we divided it up into three sections and three levels of people without repetition except: 1) When coming to a point where it was essential to repeat a narration in which there is an addition that clarifies the meaning of the first one; or 2) When there is a second chain that supports the first one in some hidden defect present since the additional significance in the second Ḥadīth assumes the position of a complete Ḥadīth. Repeating narrations which have the kind of ‘addition’ we described is inevitable [since it eliminates the perceived hidden defect of the first narration]; or that significance [of the addition] is separated from the entire narration by abbreviating it when it is possible [to understand the significance from a small part of the narration], however separating the relevant part of the narration from the rest might make it difficult to understand the link between them, so repeating it in its original form when that proves difficult is safest. Thus when we find that it is avoidable to repeat the narrations in their entirety we take care not to do so, if Allah wills. As for the first category, we aspired to advance the report which is safer from defects than any others, and is purified due to being related by people of integrity in Ḥadīth, and certitude for what they relate; there are no strong disputes found [compared to the reports of other Thiqāt] regarding their transmissions, and no excessive inconsistencies [in their own reports] - just as is the case regarding a great number of Muhaddithīn and which appears in their narrations. Thus when we examined reports of this description from the people, we also came across reports in whose chains there fell some of those who are not described with memorization and precision, like those of the previous description before them. Although they fell below what we described [from the first group], they still have the designation of protection [from ill-repute] and truthfulness; and they acquired knowledge, included among them are the likes of Atā’ bin is-Sā’ib, and Yazīd bin Abī Ziyād, and Layth bin Abī Sulaym, from among the carriers of Āthār and the relaters of Akhbār. So even though they possessed what we described of knowledge, protection and being known as scholars among Ahl ul-Ilm, their contemporaries who we mentioned as precise and sound in transmission were above them in status and rank because this [the first category] is a high rank and sublime characteristic according to Ahl ul-Ilm. Do you not see that when you weigh these three people we mentioned- Atā’, Yazīd, and Layth- with Mansūr bin il-Mu’tamir, Sulaymān al-A’mash and Ismā’īl bin Abī Khālid in regards to precision in Ḥadīth and soundness in it, you will find them distinct from others and not near them [in rank?]- there is no doubt regarding that among the people knowledgeable in Ḥadīth since the soundness of the memorization of Mansūr, al-A’mash, and Ismā’īl, and their precision in Ḥadīth was well-known among [the people knowledgeable in Ḥadīth] and they were not aware of examples of that from Atā’, Yazīd, and Layth. Upon the same course as the above, when you weigh between the two levels like Ibn Awn and Ayyūb as-Sakhtiyānī with Awf ibn Abī Jamīlah and Ash’ath al-Humrānī- and all 4 are companions of al-Hasan and Ibn Sīrīn- there is disparity between the two groups. Between these two groups is a distance in terms of perfection of virtue and soundness of reporting even though Awf and Ash’ath are not repelled from [the status] of truthfulness and honesty according to Ahl ul-Ilm, rather the situation is as we described regarding their position. We only mentioned these examples by way of naming them specifically so that their examples might be an indication for whoever is ignorant of the path to return to understanding of Ahl ul-Ilm regarding the ranking of its people. Thus there is no shortchanging the men of elevated rank any amount of what is due his level, and there is no elevation of those who are lower any amount of knowledge above his position- and each who possesses the right is given his right and is settled in his rank. It has been mentioned on authority of Ā’ishah, may Allah be pleased with her, that she said: ‘The Messenger of Allah, peace and blessings of Allah upon him, ordered us to afford people their (rightful) positions according to what the Qur’ān states: {And above all who possess knowledge is another who is knowledgeable}[Yūsuf: 76] . Thus based on the example of what we mentioned [regarding the narrators of Hifẓ and Itqān, and narrations which lack excessive inconsistency or strong contradiction], we compiled what you asked for of [those kind] of reports on authority of the Messenger of Allah, peace and blessings of Allah upon him. As for anything of that wherein the people were charged [with some criticism] by the people of Ḥadīth, or by the majority of [the people of Ḥadīth], then we did not preoccupy ourselves with bringing forward their narrations, such as Abd Allah ibn Miswar Abī Ja’far il-Madā’inī, Amr bin Khālid, Abd il-Quddūs ash-Shāmī, Muhammad ibn Sa’īd il-Maslūb, Ghiyāth ibn Ibrāhīm, Sulaymān bin Amr Abī Dāwud an-Nakha’ī, and those like them whereof they were accused of fabricating narrations and manufacturing reports; and like that are those whose narrations are dominated with Munkar, or mistakes- we withheld from their narrations as well. An indication of Munkar in the narration of a Muhaddith is when his transmission differs with the transmission of a Muhaddith from the people of memorization and acceptance, or does not agree with it when the two are compared. When the majority of a person’s narrations are like that, he is abandoned [Mahjūr] in Ḥadīth, and not accepted in it, and his narrations are not acted upon. The following are those Muhaddithīn who are among this group: Abd Allah ibn Muharrar, Yahyā bin Abī Unaysah, Al-Jarrāh bin ul-Minhāl Abūl-Atūf, Abbād bin Kathīr, Husayn bin Abd Illah ibn Ḍumayrah, Umar bin Suhbān, and those of the same type in terms of transmission of Munkar Ḥadīth. We did not pause upon their narrations or preoccupy ourselves with them due to the ruling of Ahl ul-Ilm. That which we are aware of from their school of thought in accepting what is singularly reported by a Muhaddith from the narrations is that (the Muhaddith) took part along with the trustworthy narrators from Ahl ul-Ilm wal-Hifẓ in transmitting some of what they transmitted, and [the Muhaddith] is predominantly in agreement with them; when one is found like that, then if he adds to [the transmission] anything not found with his companions, then his addition is accepted. As for those who you see resorting to the likes of az-Zuhrī due to his greatness, and due to the great number of his companions being among the precise Huffāẓ, [resorting to] his Ḥadīth and the Ḥadīth of those like him, or to the likes of Hishām ibn Urwah, then their Ḥadīth are extensively shared among Ahl ul-Ilm. The greater majority of their companions related their Ḥadīth in agreement with one another [with few having contradictions]. Thus to transmit from [Urwah and az-Zuhrī], or one of them, from among the multitude of Ḥadīth, what is not known among any of their companions, and [the Rāwī] is not of those who share in the Sahīh narrations [found] among them, then it is not allowed to accept the narrations of this category of people, and Allah knows best. We have explained from the school of Ḥadīth and its people some of what those who wish to traverse the path of [the Muhaddithīn] should aim for, and be guided towards. We will, if Allah wills, add to the explanation and clarification in another place in this book upon the mention of defective reports [Mu’allalah] when we come to it, in the places where explanation and clarification are appropriate, if Allah wills. And what follows: May Allah have mercy on you, if not for that which we saw of an evil act, largely from those who claim to be Muhaddithīn, in what they were supposed to adhere to when putting forward weak narrations and abominable transmissions and their neglect for the investigation of famous Sahīh narrations related by the trustworthy narrators, well-known for their truthfulness and honesty, after knowledge of them and affirmation with their tongues, that a great many of [weak and abominable narrations] which were cast towards heedless people are denounced and spoken of as not acceptable whereof the A’immah of the people of Ḥadīth criticized their transmissions- A’immah like Mālik ibn Anas, Shu’bat bin al-Hajjāj, Sufyān bin Uyaynah, Yahyā bin Sa’īd al-Qattān, Abd ir-Rahman ibn Mahdī, and other A’immah- then the establishment of what you asked for of distinction [between the types of Ḥadīth] and collection [of those which were Sahīh] would be easy for us. However on account of what we informed you of regarding the people’s circulation of abominable reports with weak, unknown chains, and their casting them towards the common people who are not aware of their defects, responding to what you asked became lighter upon our hearts.",
			"hadithUrdu": "صحیح مسلم اردو ترجمہ کتا ب الایمان شروع سب سے زیادہ رحم کرنے والے ، ہمیشہ مہربانی کرنے والے اللہ کے نام سے ۔ تمام تر حمد وثنا سارے جہانوں کے پالنے والے اللہ کے لیے اور بہترین جزا تقویٰ اختیار کرنے والوں کے لیے ہے ۔ اللہ خاتم النبیین محمدﷺ پر اپنی رحمت نازل فرمائے اور تمام نبیوں اور رسولوں پر بھی ۔ اس کے بع اللہ آپ رحم فرمائے! بلاشبہ آپ نے اپنے پیدا کرنے والے کی توفیق سے یہ ذکر کیا ہے کہ آپ دین کے طریقوں اور احکام کے بارے میں رسول اللہ ﷺ سے ( امت تک ) پہنچنے والی تمام احادیث کو ان کی منقولہ اسناد سمیت جاننا چاہتے ہیں اور ان احادیث کو بھی جو ثواب اور عذاب ، رغبت دلانے اور ڈرانے اور ان جیسی دوسری چیزوں کے بارے میں ہیں اور اہل علم نے ایک دوسرے سے لیں اور پہنچائیں ۔ اللہ آپ کی رہنمائی فرمائے ! آپ چاہتے ہیں کہ یہ تمام احادیث شمار کر کے مجموعے کی شکل میں آپ کی دسترس میں لائی جائیں ۔ آپ نے مجھ سے یہ مطالبہ کیا ہے کہ میں ان احادیث کو زیادہ تکرار کے بغیر آپ کے لیے ایک تالیف کی شکل میں ملخص کر دوں کیونکہ آپ سمجھتے ہیں کہ یہ ( تکرار ) ان احادیث کو اچھی طرح سمجھنے اور ان سے استنباط کرنے میں آپ کے لیے رکاوٹ کا باعث بنے گا جو کہ آپ کا ( اصل ) مقصد ہے ( اللہ آپ کو عزت دے! ) آپ نے جس چیز کا ( مجھ سے ) مطالبہ کیا ہے ، جب میں نے اس کے اور اس سے حاصل ہونے والے ثمرات کے بارے میں غوروفکر کی طرف رجوع کیا تو ( مجھے یقین ہو گیا کہ ) ان شاء اللہ اس کے نتائج قابل تعریف اور فوائد یقینی ہوں گے ۔ اور جب آپ نے مجھ سے اس کام کی زحمت اٹھانے کا مطالبہ کیا تو مجھے یقین ہو گیا کہ اگر مجھے اس کی توفیق ملی اور اللہ کی طرف سے اس کے مکمل ہونے کا فیصلہ ہوا تو پہلا شخص ، جسے دوسرے لوگوں سے قبل اس سے خاص طور پر فائدہ ہو گا ، وہ میں خود ہوں گا ۔ اس کی وجوہات اتنی زیادہ ہیں کہ ان کا ذکر طوالت کا باعث ہو گا ، البتہ اس کا خلاصہ یہ ہے کہ ان خصوصیات کی حامل کم احادیث کو محفوظ رکھنا اور ان میں اچھی طرح مہارت حاصل کرنا انسان کے لیے کثیر احادیث کو سنبھالنے کی نسبت زیادہ آسان ہے ، خصوصاً عوام میں سے ایک ایسے شخص کے لیے جو اس وقت تک ان میں ( سے صحیح اور ضعیف کے بار ے میں بھی ) امتیاز نہیں کر سکتا جب تک کوئی دوسرا اسے اس فرق سے آگاہ نہ کرے ۔ جب معاملہ اسی طرح ہے جیسے ہم نے بیان کیا تو کم تعداد میں صحیح ( احادیث ) چن لینا کثیر تعداد میں ضعیف احادیث کو جمع کرنے سے کہیں بہتر ہے ۔ یہ بات ( اپنی جگہ ) درست ہے کہ بہت سی احادیث کو اکٹھا کرنے اور مکرر ( احادیث ) کو جمع کرنے کے بھی کچھ فوائد ہیں ، خصوصاً ان لوگوں کے لیے جنہیں اس ( علم ) میں کسی قدر شعور اور اسباب وعلل کی معرفت سے نوازا گیا ہے ۔ اللہ کی مشیت سے ایسا انسان ان خصوصیات کی وجہ سے جو اسے عطا کی گئی ہیں ، کثیر احادیث کے مجموعے سے فائدہ حاصل کر سکتا ہے لیکن جہاں تک عوام الناس کا تعلق ہے جو شعو ومعرفت رکھنے والے خواص سے مختلف ہیں ، وہ کم احادیث کی معرفت سے بھی عاجز ہیں تو ان کے لیے کثیر احادیث کے حصول میں کوئی فائدہ نہیں ۔ پھر آپ نے جس ( کتاب ) کا مطالبہ کیا ہم ان شاء اللہ اس التزام کے ساتھ اس کی اس کی تخریج ( مختلف پہلوؤں سے اس کی وضاحت ) اور تالیف کا آغاز کرتے ہیں جس کا میں آپ کے سامنے ذکر کرنے لگا ہوں اور وہ یہ ہے کہ ہم ان تمام احادیث کو لے لیں گے جو سنداً نبی اکرمﷺ سے بیان کی گئیں اور تکرار کے بغیر انہیں تین اقسام اور ( بیان کرنے والے ) لوگوں کے تین طبقوں کے مطابق تقسیم کریں گے ، الا یہ کہ کوئی ایسا مقام آ جائے جہاں کسی حدیث کو دوبارہ ذکر کیے بغیر چارہ نہ ہو ، ( مثلاً : ) اس میں کوئی معنیٰ زیادہ ہو یا کوئی سند ایسی ہو جو کسی علت یا سبب کی بنا پر دوسری سند کے پہلو بہ پہلو آئی ہو کیونکہ حدیث میں ایک زائد معنیٰ ، جس کی ضرورت ہو ، ایک مکمل حدیث کے قائم مقام ہوتا ہے ، اس لیے ایسی حدیث کو ، جس میں ہمارا بیان کردہ کوئی ( معنوی ) اضافہ پایا جاتا ہے ، دوبارہ لائے بغیر چارہ نہیں یا جب ممکن ہوا تو ہم اس معنیٰ کو اختصار کے ساتھ پوری حدیث سے الگ ( کر کے ) بیان کر دیں گے لیکن بسااوقات اسے پوری حدیث سے الگ کرنا مشکل ہوتا ہے اور جب اس کی گنجائش نہ ہو تو اسے اصل شکل میں دوبارہ بیان کرنا زیادہ محفوظ ہوتا ہے ، البتہ جہاں ہمارے لیے اسے مکمل طور پر دہرانے سے بچنا ممکن ہو گا اور ( کامل شکل میں ) ہمیں اس کی ضرورت نہ ہو گی تو ہم ان شاء اللہ اس سے اجتناب کریں گے ۔ جہاں تک پہلی قسم کا تعلق ہے ( اس میں ) ہم یہ کوشش کریں گے کہ انہی احادیث کو ترجیح دیں جو دوسری احادیث کی نسبت ( فنی ) خامیوں سے زیادہ محفوظ اور زیادہ پاک ہوں ، یعنی ان کے ناقلین ( راوی ) نقل حدیث میں صحت اور ثقاہت رکھنے والے ہوں ، ان کی روایت میں شدید اختلاف پایا جائے نہ ( الفاظ ومعانی کو ) بہت برے طریقے سے خلط ملط کیا گیا ہو جس طرح کہ بہت سے احادیث بیان کرنے والوں میں پایا گیا ہے اور ان کی روایت میں یہ چیز واضح ہوچکی ہے ۔ جب ہم اس قسم کے ( ثقہ ) لوگوں کی مرویات کا احاطہ کر لیں گے تو بعد ازیں ایسی روایات لائیں گے جن کی سندوں میں کوئی ایسے راوی موجود ہوں گے جو طبقہ اولیٰ جیسے ( راویوں کے ) حفظ واتقان سے متصف نہیں لیکن وہ بھی ( انہی میں سے ہیں ) چاہے ان صفات میں ان سے ذرا کم ہیں جن کو ان سے مقدم رکھا گیا ہے لیکن عفت ، صدق اور علم سے شغف رکھنے جیسی صفات ان میں عام ہوں ، جس طرح عطاء بن سائب ، یزید بن ابی زیاد ، لیث بن ابی سلیم اور ان کی طرح کے ( دیگر ) حاملین آثار اور ناقلین اخبار ہیں ۔ یہ حضرات اگرچہ اہل علم کے ہاں علم اور عفت ( جیسی صفات ) میں معروف ہیں لیکن ان کے ہم عصر لوگوں میں سے ( بعض ) دیگر حضرات ایسے ہیں جو اتقان اور روایت کی صحت کے معاملے میں اپنے مقام اور مرتبے کے اعتبار سے ان سے افضل ہیں ۔ اس کی وجہ یہ ہے کہ اہل علم کے ہاں یہ ( حفظ واتقان ) ایک بہت اونچا مرتبہ اور ایک اعلیٰ ترین صفت ہے ۔ آپ دیکھتے نہیں کہ ان تینوں حضرات : عطاء ، یزید اور لیث ، جن کا ہم نے ابھی نام لیا ، کا موازنہ حدیث کے حفظ و اتقان میں منصور بن معتمر ، سلیمان اعمش اور اسماعیل بن ابی خالد سے کریں تو انہیں آپ ان حضرات سے خاصے فاصلے پر پائیں گے ، یہ ان کے قریب بھی نہیں آ پاتے ۔ ماہرین علم حدیث کو اس بارے میں کوئی شک نہیں کہ منصور ، اعمش اور اسماعیل کے ہاں حفظ کی صحت اور حدیث بیان کرنے میں مہارت کی جو صفات فراواں اہل علم کو نظر آتی ہیں ان کے نزدیک وہ عطاء ، یزید اور لیث کے ہاں اس طرح معروف نہیں ۔ اگر آپ ( دیگر ) ہمسروں کے درمیان موازنہ کریں تو ( بھی ) یہی ماجرا ( سامنے آتا ) ہے ، مثلاً آپ ابن عون اور ایوب سختیانی کا ( موازنہ ) عوف بن ابی جمیلہ اور اشعث حمرانی سے کریں ۔ یہ دونوں ( بھی اسی طرح ) حسن بصری اور ابن سیرین کے شاگرد ہیں جس طرح ابن عون اور ایوب ان کے شاگرد ہیں لیکن ان دونوں اور ان دونوں کے درمیان کمال فضل اور صحت نقل کے اعتبار سے بہت بڑا فاصلہ پایا جاتا ہے ۔ عوف اور اشعث بھی اگرچہ اہل علم کے ہاں صدق وامانت سے ہٹے ہوئے نہیں ( مانے جاتے ) لیکن جہاں تک مرتبے کا تعلق ہے تو اہل علم کے ہاں حقیقت وہی ہے جو ہم نے بیان کی ۔ ہم نے نام ذکر کر کے مثال اس لیے دی ہے تاکہ اس شخص کے لیے ، جو اہل علم کے ہاں حاملین حدیث کی درجہ کے طریقے سے ناواقف ہے ، یہ مثال ایسا واضح نشان ثابت ہو جس کے ذریعے سے وہ مکمل واقفیت حاصل کر لے اور اونچا درجہ رکھنے والے کو اس کے مرتبے سے گھٹائے اور نہ کم درجے والے کو اس کے مرتبے سے بڑھائے ، ہر ایک کو اس کا حق دے اور اس کے مرتبے پر رکھے ۔ حضرت عائشہ صدیقہؓ سے روایت بیان کی گئی ، انہوں نے کہا : ہمیں رسول اللہﷺ نے حکم دیا تھا کہ کہ ہم لوگوں کو ان کے مرتبوں پر رکھیں ۔ اس کے ساتھ ہی اللہ کا حکم جو قرآن نے بیان فرمایا : ’’ہر علم والے سے اوپر ایک علم رکھنے والا ہے ۔ ‘ ‘ ہم احادیث رسولﷺ کو اپنی ذکر کردہ صورتوں کے مطابق تالیف کریں گے ۔ جو احادیث ان لوگوں سے مروی ہیں جو ( تمام ) ماہرین علم حدیث یا ان میں سے اکثر کے نزدیک متہم ہیں ، ہم ان کی روایات سے کوئی سروکار نہ رکھیں گے ، جیسے : عبد اللہ بن مسور ابو جعفر مدائنی ، عمرو بن خالد ، عبد القدوس شامی ، محمد بن سعید مصلوب ، غیاث بن ابراہیم ، سلیمان بن عمرو نخعی اور ان جیسے دیگر لوگوں کی مرویات سے بھی ، جن پر وضع احادیث اور روایات سازی کے الزامات ہیں ۔ اسی طرح وہ لوگ جن کی مرویات کی غالب تعداد منکر اور غلط ( احادیث ) پر مشتمل ہے ، ہم ان کی احادیث سے بھی احتراز کریں گے ۔ کسی حدیث بیان کرنے والے کی منکر روایت کی نشانی یہ ہے کہ جب اس کی روایت کردہ حدیث کا دوسرے اصحاب حفظ اور مقبول ( محدثین ) کی روایت سے موازنہ کیا جائے تو وہ ان کی روایت کے مخالف ہو یا ان کے ساتھ موافق نہ ہو پائے ۔ جب کسی کی اکثر مرویات اس طرح کی ہوں تو وہ متروک الحدیث ہوتا ہے ، اس کی روایات غیر مقبول ہوتی ہیں ، ( اجتہاد واستنباط کے لیے ) استعمال نہیں ہوتیں ۔ اس قسم کے راویان حدیث میں عبد اللہ بن محرر ، یحییٰ بن ابی انیسہ ، جراح بن منہال ابو عطوف ، عباد بن کثیر ، حسین بن عبد اللہ بن ضمیرہ ، عمر بن صہبان اور اس طرح کے دیگر منکر روایات بیان کرنے والے لوگ شامل ہیں ، ہم ان کی روایت کا رخ نہیں کرتے نہ ان روایات سے کوئی سروکار ہی رکھتے ہیں ۔ کیونکہ حدیث میں متفرد راوی کی روایت قبول کرنے کے متعلق اہل علم کا معروف مذہب اور ان کا فیصلہ یہ ہے کہ اگر وہ ( راوی ) عام طور پر اہل علم وحفظ ثقات کی موافقت کرتا ہے اور اس نے گہرائی میں جا کر ان کی موافقت کی ہے تو ایسی صورت میں اگر وہ ( متفرد ) کوئی ایسا اضافہ بیان کرتا ہے جو اس کے دوسرے ہم مکتبوں کے ہاں نہیں ہے تو اس کا یہ اضافہ ( محدثین کے ہاں ) قبول کیا جائے گا لیکن جس ( حدیث بیان کرنے والے ) کو آپ دیکھیں کہ وہ امام زہری جیسے جلیل القدر ( محدث ) سے روایت بیان کرتا ہے جن کے کثیر تعداد میں ایسے شاگر د ہیں جو حفاظ ( حدیث ) ہیں ، ان کی اور دوسرے ( محدثین ) کی روایت کے ماہر ہیں یا وہ ہشام بن عروہ جیسے ( امام التابعین ) سے روایت کرتا ہے ۔ ان دونوں کی احادیث تو اہل علم کے ہاں خوب پھیلی ہوئی ہیں ، وہ سب ان کی روایت میں ( ایک دوسرے کے ساتھ ) اشتراک رکھتے ہیں اور ان دونوں کی اکثر احادیث میں ان کے شاگرد ایک دوسرے سے متفق ہیں اور یہ شخص ان دونوں یا ان میں سے کسی ایک سے متعدد ایسی احادیث روایت کرے جن میں ان کے شاگردوں میں سے اس کے ساتھ کوئی اور شریک نہیں تو اس جیسے لوگوں سے اس قسم کی کوئی حدیث قبول کرنا جائز نہیں ۔ اللہ ( ہی ) زیادہ جاننے والا ہے ۔ ہم نے حدیث اور اصحاب حدیث ( محدثین ) کے طریق کار کا کچھ حصہ ہر اس شخص کی توجہ کےلیے جو ان کے راستے پر چلنا چاہتا ہے اور جسے اس کی توفیق نصیب ہوتی ہے ، تفصیل سے بیان کر دیا ہے ۔ ان شاء اللہ ہم ( اس طریق کار کی ) مزید شرح اور وضاحت کتاب کے ان مقامات پر کریں گے جہاں معلول احادیث ( جن میں کوئی خفیہ علت پائی جاتی ہے ) کا ذکر ہو گا ، ( یعنی ) جب ہم وہاں پہنچیں گے جہاں اس ( موضوع ) کی شرح اور وضاحت کا مناسب موقع ہو گا ۔ ان شاء اللہ تعالیٰ اس ( وضاحت ) کے بعد ، اللہ آپ پر رحم فرمائے! ( ہم یہ کہنا چاہتے ہیں کہ ) اگر ہم نے اپنے آپ کو محدث کے منصب پر فائز کرنے والے بہت سےلوگوں کی ضعیف احادیث اور منکر روایات کے بیان کو ترک کرنے جیسے معاملات میں ، جن کا التزام ان کے لیے لازم تھا ، غلط کارروائیاں نہ دیکھی ہوتیں ، اور اگر انہوں نے صحیح روایات کے بیان پر اکتفا کو ترک نہ کیا ہوتا ، جنہیں ان ثقہ راویوں نے بیان کیا جو صدق وامانت میں معروف ہیں ، وہ بھی ان کے اس اعتراف کے بعد کہ جو کچھ وہ ( سیدھے سادھے ) کم عقل لوگوں کے سامنے بے پروائی سے بیان کیے جا رہے ہیں ، اس کا اکثر حصہ غیر مقبول ہے ، ان لوگوں سے نقل کیا گیا ہے جن سے لینے پر اہل علم راضی نہیں اور جن سے روایت کرنے کو ( بڑے بڑے ) ائمہ حدیث ، مثلاً مالک بن انس ، شعبہ بن حجاج ، سفیان بن عیینہ ، یحییٰ بن سعید قطان ، عبد الرحمن بن مہدی وغیرہم قابل مذمت سمجھتے ہیں ۔ اگر ہم نے یہ سب نہ دیکھا ہوتا تو آپ نے ( صحیح وضعیف میں ) امتیاز اور ( صرف صحیح کے ) حصول کے حوالے سے جو مطالبہ کیا ہے اسے قبول کرنا آسان نہ ہوتا ۔ لیکن جس طرح ہم نے آپ کو قوم کی طرف سے کمزور اور مجہول سندوں سے ( بیان کی گئی ) منکر حدیثوں کو بیان کرنے اور انہیں ایسے عوام میں ، جو ان ( احادیث ) کے عیوب سے ناواقف ہیں ، پھیلانے کے بارے میں بتایا تو ( صرف ) اسی بنا پر ہمارے دل کے لیے آپ کے مطالبے کو تسلیم کرنا آسان ہوا ۔",
			"urduNarrator": null,
			"hadithArabic": "بِسْمِ اللهِ الرَّحْمنِ الرَّحِيمِ. الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ، وَالْعَاقِبَةُ لِلْمُتَّقِينَ، وَصَلَّى الله عَلَى مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ، وَعَلَى جَمِيعِ الْأَنْبِيَاءِ وَالْمُرْسَلِينَ «أَمَّا بَعْدُ، فَإِنَّكَ يَرْحَمُكَ اللهُ بِتَوْفِيقِ خَالِقِكَ، ذَكَرْتَ أَنَّكَ هَمَمْتَ بِالْفَحْصِ عَنْ تَعَرُّفِ جُمْلَةِ الْأَخْبَارِ الْمَأْثُورَةِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فِي سُنَنِ الدِّينِ وَأَحْكَامِهِ، وَمَا كَانَ مِنْهَا فِي الثَّوَابِ وَالْعِقَابِ، وَالتَّرْغِيبِ وَالتَّرْهِيبِ، وَغَيْرِ ذَلِكَ مِنْ صُنُوفِ الْأَشْيَاءِ بِالْأَسَانِيدِ الَّتِي بِهَا نُقِلَتْ، وَتَدَاوَلَهَا أَهْلُ الْعِلْمِ فِيمَا بَيْنَهُمْ، فَأَرَدْتَ، أَرْشَدَكَ اللهُ أَنْ تُوَقَّفَ عَلَى جُمْلَتِهَا مُؤَلَّفَةً مُحْصَاةً، وَسَأَلْتَنِي أَنْ أُلَخِّصَهَا لَكَ فِي التَّأْلِيفِ بِلَا تَكْرَارٍ يَكْثُرُ، فَإِنَّ ذَلِكَ زَعَمْتَ مِمَّا يَشْغَلُكَ عَمَّا لَهُ قَصَدْتَ مِنَ التَّفَهُّمِ فِيهَا، وَالِاسْتِنْبَاطِ مِنْهَا، وَلِلَّذِي سَأَلْتَ أَكْرَمَكَ اللهُ حِينَ رَجَعْتُ إِلَى تَدَبُّرِهِ، وَمَا [ص:4] تَؤُولُ بِهِ الْحَالُ إِنْ شَاءَ اللهُ عَاقِبَةٌ مَحْمُودَةٌ وَمَنْفَعَةٌ مَوْجُودَةٌ، وَظَنَنْتُ حِينَ سَأَلْتَنِي تَجَشُّمَ ذَلِكَ أَنْ لَوْ عُزِمَ لِي عَلَيْهِ، وَقُضِيَ لِي تَمَامُهُ، كَانَ أَوَّلُ مِنْ يُصِيبُهُ نَفْعُ ذَلِكَ إِيَّايَ خَاصَّةً قَبْلَ غَيْرِي مِنَ النَّاسِ لِأَسْبَابٍ كَثِيرَةٍ يَطُولُ بِذِكْرِهَا الْوَصْفُ، إِلَّا أَنَّ جُمْلَةَ ذَلِكَ أَنَّ ضَبْطَ الْقَلِيلِ مِنْ هَذَا الشَّأْنِ، وَإِتْقَانَهُ، أَيْسَرُ عَلَى الْمَرْءِ مِنْ مُعَالَجَةِ الْكَثِيرِ مِنْهُ، وَلَا سِيَّمَا عِنْدَ مَنْ لَا تَمْيِيزَ عِنْدَهُ مَنِ الْعَوَامِّ، إِلَّا بِأَنْ يُوَقِّفَهُ عَلَى التَّمْيِيزِ غَيْرُهُ، فَإِذَا كَانَ الْأَمْرُ فِي هَذَا كَمَا وَصَفْنَا، فَالْقَصْدُ مِنْهُ إِلَى الصَّحِيحِ الْقَلِيلِ أَوْلَى بِهِمْ مِنَ ازْدِيَادِ السَّقِيمِ، وَإِنَّمَا يُرْجَى بَعْضُ الْمَنْفَعَةِ فِي الِاسْتِكْثَارِ مِنْ هَذَا الشَّأْنِ، وَجَمْعِ الْمُكَرَّرَاتِ مِنْهُ لِخَاصَّةٍ مِنَ النَّاسِ مِمَّنْ رُزِقَ فِيهِ بَعْضُ التَّيَقُّظِ، وَالْمَعْرِفَةِ بِأَسْبَابِهِ وَعِلَلِهِ، فَذَلِكَ إِنْ شَاءَ اللهُ يَهْجُمُ بِمَا أُوتِيَ مِنْ ذَلِكَ عَلَى الْفَائِدَةِ فِي الِاسْتِكْثَارِ مِنْ جَمْعِهِ، فَأَمَّا عَوَامُّ النَّاسِ الَّذِينَ هُمْ بِخِلَافِ مَعَانِي الْخَاصِّ مِنْ أَهْلِ التَّيَقُّظِ وَالْمَعْرِفَةِ، فَلَا مَعْنَى لَهُمْ فِي طَلَبِ الْكَثِيرِ، وَقَدْ عَجَزُوا عَنْ مَعْرِفَةِ الْقَلِيلِ‘ثُمَّ إِنَّا إِنْ شَاءَ اللهُ مُبْتَدِئُونَ فِي تَخْرِيجِ مَا سَأَلْتَ وَتَأْلِيفِهِ، عَلَى شَرِيطَةٍ سَوْفَ أَذْكُرُهَا لَكَ، وَهُوَ إِنَّا نَعْمِدُ إِلَى جُمْلَةِ مَا أُسْنِدَ مِنَ الْأَخْبَارِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَنَقْسِمُهَا عَلَى ثَلَاثَةِ أَقْسَامٍ، وَثَلَاثِ طَبَقَاتٍ مِنَ النَّاسِ عَلَى غَيْرِ تَكْرَارٍ، إِلَّا أَنْ يَأْتِيَ مَوْضِعٌ لَا يُسْتَغْنَى فِيهِ عَنْ تَرْدَادِ حَدِيثٍ فِيهِ زِيَادَةُ مَعْنًى، أَوْ إِسْنَادٌ يَقَعُ إِلَى جَنْبِ إِسْنَادٍ، لِعِلَّةٍ تَكُونُ هُنَاكَ، لِأَنَّ الْمَعْنَى الزَّائِدَ فِي الْحَدِيثِ الْمُحْتَاجَ [ص:5] إِلَيْهِ يَقُومُ مَقَامَ حَدِيثٍ تَامٍّ، فَلَا بُدَّ مِنْ إِعَادَةِ الْحَدِيثِ الَّذِي فِيهِ مَا وَصَفْنَا مِنَ الزِّيَادَةِ، أَوْ أَنْ يُفَصَّلَ ذَلِكَ الْمَعْنَى مِنْ جُمْلَةِ الْحَدِيثِ عَلَى اخْتِصَارِهِ إِذَا أَمْكَنَ، وَلَكِنْ تَفْصِيلُهُ رُبَّمَا عَسُرَ مِنْ جُمْلَتِهِ، فَإِعَادَتُهُ بِهَيْئَتِهِ إِذَا ضَاقَ ذَلِكَ أَسْلَمُ، فَأَمَّا مَا وَجَدْنَا بُدًّا مِنْ إِعَادَتِهِ بِجُمْلَتِهِ مِنْ غَيْرِ حَاجَةٍ مِنَّا إِلَيْهِ، فَلَا نَتَوَلَّى فِعْلَهُ إِنْ شَاءَ اللهُ تَعَالَى فَأَمَّا الْقِسْمُ الْأَوَّلُ، فَإِنَّا نَتَوَخَّى أَنْ نُقَدِّمَ الْأَخْبَارَ الَّتِي هِيَ أَسْلَمُ مِنَ الْعُيُوبِ مِنْ غَيْرِهَا، وَأَنْقَى مِنْ أَنْ يَكُونَ نَاقِلُوهَا أَهْلَ اسْتِقَامَةٍ فِي الْحَدِيثِ، وَإِتْقَانٍ لِمَا نَقَلُوا، لَمْ يُوجَدْ فِي رِوَايَتِهِمْ اخْتِلَافٌ شَدِيدٌ، وَلَا تَخْلِيطٌ فَاحِشٌ، كَمَا قَدْ عُثِرَ فِيهِ عَلَى كَثِيرٍ مِنَ الْمُحَدِّثِينَ، وَبَانَ ذَلِكَ فِي حَدِيثِهِمْ‘، وَقَدْ ذُكِرَ عَنْ عَائِشَةَ رَضِيَ اللهُ تَعَالَى عَنْهَا، أَنَّهَا قَالَتْ: أَمَرَنَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ أَنْ نُنَزِّلَ النَّاسَ مَنَازِلَهُمْ مَعَ مَا نَطَقَ بِهِ الْقُرْآنُ، مِنْ قَوْلِ اللهُ تَعَالَى: {وَفَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ} [يوسف: 76]، فَعَلَى نَحْوِ مَا ذَكَرْنَا مِنَ الْوُجُوهِ، نُؤَلِّفُ مَا سَأَلْتَ مِنَ الْأَخْبَارِ عَنْ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ [ص:7]، فَأَمَّا مَا كَانَ مِنْهَا عَنْ قَوْمٍ هُمْ عِنْدَ أَهْلِ الْحَدِيثِ مُتَّهَمُونَ، أَوْ عِنْدَ الْأَكْثَرِ مِنْهُمْ، فَلَسْنَا نَتَشَاغَلُ بِتَخْرِيجِ حَدِيثِهِمْ، كَعَبْدِ اللهِ بْنِ مِسْوَرٍ أَبِي جَعْفَرٍ الْمَدَائِنِيِّ، وَعَمْرِو بْنِ خَالِدٍ، وَعَبْدِ الْقُدُّوسِ الشَّامِيِّ، وَمُحَمَّدِ بْنِ سَعِيدٍ الْمَصْلُوبِ، وَغِيَاثِ بْنِ إِبْرَاهِيمَ، وَسُلَيْمَانَ بْنِ عَمْرٍو أَبِي دَاوُدَ النَّخَعِيِّ، وَأَشْبَاهِهِمْ مِمَّنِ اتُّهِمَ بِوَضْعِ الْأَحَادِيثِ، وَتَوْلِيدِ الْأَخْبَارِ وَكَذَلِكَ، مَنِ الْغَالِبُ عَلَى حَدِيثِهِ الْمُنْكَرُ، أَوِ الْغَلَطُ أَمْسَكْنَا أَيْضًا عَنْ حَدِيثِهِمْ، وَعَلَامَةُ الْمُنْكَرِ فِي حَدِيثِ الْمُحَدِّثِ، إِذَا مَا عُرِضَتْ رِوَايَتُهُ لِلْحَدِيثِ عَلَى رِوَايَةِ غَيْرِهِ مَنْ أَهْلِ الْحِفْظِ وَالرِّضَا، خَالَفَتْ رِوَايَتُهُ رِوَايَتَهُمْ، أَوْ لَمْ تَكَدْ تُوَافِقُهَا، فَإِذَا كَانَ الْأَغْلَبُ مِنْ حَدِيثِهِ كَذَلِكَ كَانَ مَهْجُورَ الْحَدِيثِ، غَيْرَ مَقْبُولِهِ، وَلَا مُسْتَعْمَلِهِ، فَمِنْ هَذَا الضَّرْبِ مِنَ الْمُحَدِّثِينَ: عَبْدُ اللهِ بْنُ مُحَرَّرٍ، وَيَحْيَى بْنُ أَبِي أُنَيْسَةَ، وَالْجَرَّاحُ بْنُ الْمِنْهَالِ أَبُو الْعَطُوفِ، وَعَبَّادُ بْنُ كَثِيرٍ، وَحُسَيْنُ بْنُ عَبْدِ اللهِ بْنِ ضُمَيْرَةَ، وَعُمَرُ بْنُ صُهْبَانَ، وَمَنْ نَحَا نَحْوَهُمْ فِي رِوَايَةِ الْمُنْكَرِ مِنَ الْحَدِيثِ، فَلَسْنَا نُعَرِّجُ عَلَى حَدِيثِهِمْ، وَلَا نَتَشَاغَلُ بِهِ، لِأَنَّ حُكْمَ أَهْلِ الْعِلْمِ، وَالَّذِي نَعْرِفُ مِنْ مَذْهَبِهِمْ فِي قَبُولِ مَا يَتَفَرَّدُ بِهِ الْمُحَدِّثُ مِنَ الْحَدِيثِ أَنْ يَكُونَ قَدْ شَارَكَ الثِّقَاتِ مِنْ أَهْلِ الْعِلْمِ وَالْحِفْظِ فِي بَعْضِ مَا رَوَوْا، وَأَمْعَنَ فِي ذَلِكَ عَلَى الْمُوَافَقَةِ لَهُمْ، فَإِذَا وُجِدَ كَذَلِكَ، ثُمَّ زَادَ بَعْدَ ذَلِكَ شَيْئًا لَيْسَ عِنْدَ أَصْحَابِهِ قُبِلَتْ زِيَادَتُهُ، فَأَمَّا مَنْ تَرَاهُ يَعْمِدُ لِمِثْلِ الزُّهْرِيِّ فِي جَلَالَتِهِ، وَكَثْرَةِ أَصْحَابِهِ الْحُفَّاظِ الْمُتْقِنِينَ لِحَدِيثِهِ وَحَدِيثِ غَيْرِهِ، أَوْ لِمِثْلِ هِشَامِ بْنِ عُرْوَةَ، وَحَدِيثُهُمَا عِنْدَ أَهْلِ الْعِلْمِ مَبْسُوطٌ مُشْتَرَكٌ، قَدْ نَقَلَ أَصْحَابُهُمَا عَنْهُمَا حَدِيثَهُمَا عَلَى الِاتِّفَاقِ مِنْهُمْ فِي أَكْثَرِهِ، فَيَرْوِي عَنْهُمَا، أَوْ عَنْ أَحَدِهِمَا الْعَدَدَ مِنَ الْحَدِيثِ مِمَّا لَا يَعْرِفُهُ أَحَدٌ مِنْ أَصْحَابِهِمَا، وَلَيْسَ مِمَّنْ قَدْ شَارَكَهُمْ فِي الصَّحِيحِ مِمَّا عِنْدَهُمْ، فَغَيْرُ جَائِزٍ قَبُولُ حَدِيثِ هَذَا الضَّرْبِ مِنَ النَّاسِ وَاللهُ أَعْلَمُ‘«قَدْ شَرَحْنَا مِنْ مَذْهَبِ الْحَدِيثِ وَأَهْلِهِ بَعْضَ مَا يَتَوَجَّهُ بِهِ مَنْ أَرَادَ سَبِيلَ الْقَوْمِ، وَوُفِّقَ لَهَا، وَسَنَزِيدُ، إِنْ شَاءَ اللهُ تَعَالَى شَرْحًا وَإِيضَاحًا فِي مَوَاضِعَ مِنَ الْكِتَابِ عِنْدَ ذِكْرِ الْأَخْبَارِ الْمُعَلَّلَةِ، إِذَا أَتَيْنَا عَلَيْهَا فِي الْأَمَاكِنِ الَّتِي يَلِيقُ بِهَا الشَّرْحُ وَالْإِيضَاحُ، إِنْ شَاءَ اللهُ تَعَالَى، وَبَعْدُ، يَرْحَمُكَ اللهُ، فَلَوْلَا الَّذِي رَأَيْنَا مِنْ سُوءِ صَنِيعِ كَثِيرٍ مِمَّنْ نَصَبَ نَفْسَهُ مُحَدِّثًا، فِيمَا يَلْزَمُهُمْ مِنْ طَرْحِ الْأَحَادِيثِ الضَّعِيفَةِ، وَالرِّوَايَاتِ الْمُنْكَرَةِ، وَتَرْكِهِمُ الِاقْتِصَارَ عَلَى الْأَحَادِيثِ الصَّحِيحَةِ الْمَشْهُورَةِ مِمَّا نَقَلَهُ الثِّقَاتُ الْمَعْرُوفُونَ بِالصِّدْقِ وَالْأَمَانَةِ، بَعْدَ مَعْرِفَتِهِمْ وَإِقْرَارِهِمْ بِأَلْسِنَتِهِمْ أَنَّ كَثِيرًا مِمَّا يَقْذِفُونَ بِهِ إِلَى الْأَغْبِيَاءِ مِنَ النَّاسِ هُوَ مُسْتَنْكَرٌ، وَمَنْقُولٌ عَنْ قَوْمٍ غَيْرِ مَرْضِيِّينَ مِمَّنْ ذَمَّ الرِّوَايَةِ عَنْهُمْ أَئِمَّةُ أَهْلِ الْحَدِيثِ مِثْلُ مَالِكِ بْنِ أَنَسٍ، وَشُعْبَةَ بْنِ الْحَجَّاجِ، وَسُفْيَانَ بْنِ عُيَيْنَةَ، وَيَحْيَى بْنِ سَعِيدٍ الْقَطَّانِ، وَعَبْدِ الرَّحْمَنِ بْنِ مَهْدِيٍّ، وَغَيْرِهِمْ مِنَ الْأَئِمَّةِ، لِمَا سَهُلَ عَلَيْنَا الِانْتِصَابُ لِمَا سَأَلْتَ مِنَ التَّمْيِيزِ، وَالتَّحْصِيلِ، وَلَكِنْ مِنْ أَجْلِ مَا أَعْلَمْنَاكَ مِنْ نَشْرِ الْقَوْمِ الْأَخْبَارِ الْمُنْكَرَةِ بِالْأَسَانِيدِ الضِّعَافِ الْمَجْهُولَةِ، وَقَذْفِهِمْ بِهَا إِلَى الْعَوَامِّ الَّذِينَ لَا يَعْرِفُونَ عُيُوبَهَا، خَفَّ عَلَى قُلُوبِنَا إِجَابَتُكَ إِلَى مَا سَأَلْتَ",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "0",
			"bookSlug": "sahih-muslim",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 100,
				"chapterNumber": "0",
				"chapterEnglish": "Introduction",
				"chapterUrdu": "مقدمہ",
				"chapterArabic": "كتاب مُقَدِّمَةٌ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 7657,
			"hadithNumber": "93",
			"englishNarrator": "It is narrated on the authority of Yahya bin Ya'mur:",
			"hadithEnglish": "The first man who discussed qadr (Divine Decree) in Basra was Ma'bad al-Juhani. I along with Humaid bin 'Abdur-Rahman Himyari set out for pilgrimage or for 'Umrah and said: Should it so happen that we come into contact with one of the Companions of the Messenger of Allah (peace be upon him) we shall ask him about what is talked about taqdir (Divine Decree). Accidentally we came across Abdullah ibn Umar ibn al-Khattab رضی ‌اللہ ‌عنہ ‌, while he was entering the mosque. My companion and I surrounded him. One of us (stood) on his right and the other stood on his left. I expected that my companion would authorize me to speak. I therefore said: Abu Abdur Rahman! There have appeared some people in our land who recite the Qur'an and pursue knowledge. And then after talking about their affairs, added: They (such people) claim that there is no such thing as Divine Decree and events are not predestined. He (Abdullah Ibn Umar) said: When you happen to meet such people tell them that I have nothing to do with them and they have nothing to do with me. And verily they are in no way responsible for my (belief). Abdullah Ibn Umar رضی ‌اللہ ‌عنہ ‌swore by Him (the Lord) (and said): If any one of them (who does not believe in the Divine Decree) had with him gold equal to the bulk of (the mountain) Uhud and spent it (in the way of Allah), Allah would not accept it unless he affirmed his faith in Divine Decree. He further said: My father, Umar Ibn al-Khattab, told me: One day we were sitting in the company of Allah's Apostle (peace be upon him) when there appeared before us a man dressed in pure white clothes, his hair extraordinarily black. There were no signs of travel on him. None amongst us recognized him. At last he sat with the Apostle (peace be upon him) He knelt before him placed his palms on his thighs and said: Muhammad, inform me about al-Islam. The Messenger of Allah (peace be upon him) said: Al-Islam implies that you testify that there is no god but Allah and that Muhammad is the messenger of Allah, and you establish prayer, pay Zakat, observe the fast of Ramadan, and perform pilgrimage to the (House) if you are solvent enough (to bear the expense of) the journey. He (the inquirer) said: You have told the truth. He (Umar ibn al-Khattab) said: It amazed us that he would put the question and then he would himself verify the truth. He (the inquirer) said: Inform me about Iman (faith). He (the Holy Prophet ﷺ) replied: That you affirm your faith in Allah, in His angels, in His Books, in His Apostles, in the Day of Judgment, and you affirm your faith in the Divine Decree about good and evil. He (the inquirer) said: You have told the truth. He (the inquirer) again said: Inform me about al-Ihsan (performance of good deeds). He (the Holy Prophet ﷺ) said: That you worship Allah as if you are seeing Him, for though you don't see Him, He, verily, sees you. He (the enquirer) again said: Inform me about the hour (of the Doom). He (the Holy Prophet ﷺ) remarked: One who is asked knows no more than the one who is inquiring (about it). He (the inquirer) said: Tell me some of its indications. He (the Holy Prophet  ﷺ) said: That the slave-girl will give birth to her mistress and master, that you will find barefooted, destitute goat-herds vying with one another in the construction of magnificent buildings. He (the narrator, Umar Ibn al-Khattab رضی ‌اللہ ‌عنہ ‌) said: Then he (the inquirer) went on his way but I stayed with him (the Holy Prophet ﷺ) for a long while. He then, said to me: Umar رضی ‌اللہ ‌عنہ ‌, do you know who this inquirer was? I replied: Allah and His Apostle knows best. He (the Holy Prophet ﷺ) remarked: He was Gabriel (the angel). He came to you in order to instruct you in matters of religion.",
			"hadithUrdu": "سب سے پہلا شخص جس نے بصرہ میں تقدیر ( سے انکار ) کی بات کی ، معبد جہنی تھا میں ( یحیی ) اور حمید بن عبد الرحمن خمیری حج یا عمرے کے ارادے سے نکلے ، ہم نے ( آپس میں ) کہا : کاش! رسول اللہ ﷺ کے صحابہ میں سے کسی کے ساتھ ہماری ملاقات ہو جائے تو ہم ان سے تقدیر کے بارے میں ان ( آج کل کے ) لوگوں کی کہی ہوئی باتوں کے متعلق دریافت کر لیں ۔ توفیق الہٰی سے ہمیں حضرت عبد اللہ بن عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ مسجد میں داخل ہوتے ہوئے مل گئے ۔ میں اور میرے ساتھ نے ان کے درمیان میں لے لیا ، ایک ان کی دائیں طرف تھا اور دوسرا ان کی بائیں طرف ۔ مجھے اندازہ تھا کہ میرا ساتھی گفتگو ( کامعاملہ ) میرے سپرد کرے گا ، چنانچہ میں نے عرض کی : اے ابو عبدالرحمن ! ( یہ عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ کی کنیت ہے ) واقعہ یہ ہے کہ ہماری طرف کچھ ایسے لوگ ظاہر ہوئے جو قرآن مجید پڑھتے ہیں اور علم حاصل کرتے ہیں ( اور ان کے حالات بیان کیے ) ان لوگوں کا خیال ہے کہ تقدیر کچھ نہیں ، ( ہر ) کام نئے سرے سے ہو رہا ہے ( پہلے اس بارے میں نہ کچھ طے ہے ، نہ اللہ کا اس کاعلم ہے ۔ ) ابن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے فرمایا : جب تمہاری ان لوگوں سے ملاقات ہو تو انہیں بتا دینا کہ میں ان سے بری ہوں اور وہ مجھ سے بری ہیں ۔ اس ( ذات ) کی قسم جس ( کے نام ) کے ساتھ عبد اللہ بن عمر حلف اٹھاتا ہے ! اگر ان میں سے کسی کو پاس احد پہاڑ کے برابر سونا ہو اور وہ اسے خرچ ( بھی ) کر دے تو اللہ تعالیٰ اس کی طرف سے اس کوقبول نہیں فرمائے گا یہاں تک کہ وہ تقدیر پر ایمان لے آئے ، پھر کہا : مجھے میرے والد عمر بن خطاب ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے بتایا : ایک دن ہم رسول ا للہ ﷺ کی خدمت میں حاضر تھے کہ اچانک ایک شخص ہمارے سامنے نمودار ہوا ۔ اس کے کپڑے انتہائی سفید اوربا ل انتہائی سیاہ تھے ۔ اس پر سفر کا کوئی اثر دکھائی دیتا تھا نہ ہم میں سے کوئی اسے پہچانتا تھا حتیٰ کہ وہ آ کر نبی اکرمﷺ کے پاس بیٹھ گیا اور اپنے گھٹنے آپ کے گھٹنوں سے ملا دیے ، اور اپنے ہاتھ آپﷺ کی را نوں پر رکھ دیے ، اور کہا : اے محمد ( ﷺ ) ! مجھے اسلام کے بارے میں بتائیے ۔ رسول اللہ ﷺ نے فرمایا : ’’اسلام یہ ہے کہ تم اس بات کی گواہی دو کہ اللہ تعالیٰ کے سوا کوئی عبادت کےلائق نہیں اور محمدﷺ اس کے رسول ہیں ، نماز کا اہتمام کرو ، زکاۃ ادا کرو ، رمضان کے روزے رکھو اور اگر اللہ کے گھر تک راستہ ( طے کرنے ) کی استطاعت ہو تو اس کا حج کرو ۔ ‘ ‘ اس نے کہا : آپ نے سچ فرمایا ۔ ( حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے ) کہا : ہمیں اس پر تعجب ہوا کہ آپ سے پوچھتا ہے اور ( خود ہی ) آپ کی تصدیق کرتا ہے ۔ اس نے کہا : مجھے ایمان کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’یہ کہ تم اللہ تعالیٰ ، اس کے فرشتوں ، اس کی کتابوں ، اس کے رسولوں اور آخری دن ( یوم قیامت ) پر ایمان رکھو اور اچھی اور بری تقدیر پر بھی ایمان لاؤ ۔ ‘ ‘ اس نے کہا : آپ نے درست فرمایا ۔ ( پھر ) اس نے کہا : مجھے احسان کے بارے میں بتائیے ۔ آپ نے فرمایا : یہ کہ تم اللہ تعالیٰ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اور اگر تم اسے نہیں دیکھ رہے تو وہ تمہیں دیکھ رہا ہے ۔ ‘ ‘ اس نے کہا : تومجھے قیات کے بارے میں بتائیے ۔ آپ نے فرمایا : ’’جس سے اس ( قیامت ) کے بارے میں سوال کیا جا رہا ہے ، وہ پوچھنے والے سے زیادہ نہیں جانتا ۔ ‘ ‘ اس نے کہا : تو مجھے اس کی علامات بتا دیجیے ۔ آپ نے فرمایا : ’’ ( علامات یہ ہیں کہ ) لونڈی اپنی مالکہ کو جنم دے اور یہ کہ تم ننگے پاؤں ، ننگے بدن ، محتاج ، بکریاں چرانے والوں کو دیکھو کہ وہ اونچی سے اونچی عمارتیں بنانے میں ایک دوسرے کے ساتھ مقابلہ کر رہے ہیں ۔ ‘ ‘ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نےکہا : پھر وہ سائل چلا گیا ، میں کچھ دیر اسی عالم میں رہا ، پھر آپ ﷺ نے مجھ سے کہا : ’’اے عمر !تمہیں معلوم ہے کہ پوچھنے والا کون تھا؟ ‘ ‘ میں نے عرض کی : اللہ اور اس کا رسول زیادہ آگاہ ہیں ۔ آپﷺ نے فرمایا : ’’وہ جبرئیل تھے ، تمہارے پاس آئے تھے ، تمہیں تمہارا دین سکھا رہے تھے ۔ ‘ ‘",
			"urduNarrator": "مجھ سے ابو خیثمہ نے بیان کیا، ان سے زہیر بن حرب نے، ہم سے وکیع نے سرگوشی کی سند سے بیان کیا,کہمس سے ا بن بریدہ سے ، انہوں نے یحیی بن یعمر سےروایت کی ، انہوں نے کہا کہ",
			"hadithArabic": "حَدَّثَنِي أَبُو خَيْثَمَةَ زُهَيْرُ بْنُ حَرْبٍ، حَدَّثَنَا وَكِيعٌ، عَنْ كَهْمَسٍ، عَنْ عَبْدِ اللهِ بْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، ح وحَدَّثَنَا عُبَيْدُ اللهِ بْنُ مُعَاذٍ الْعَنْبَرِيُّ - وَهَذَا حَدِيثُهُ - حَدَّثَنَا أَبِي، حَدَّثَنَا كَهْمَسٌ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ يَحْيَى بْنِ يَعْمَرَ، قَالَ: كَانَ أَوَّلَ مَنْ قَالَ فِي الْقَدَرِ بِالْبَصْرَةِ مَعْبَدٌ الْجُهَنِيُّ، فَانْطَلَقْتُ أَنَا وَحُمَيْدُ بْنُ عَبْدِ الرَّحْمَنِ الْحِمْيَرِيُّ حَاجَّيْنِ - أَوْ مُعْتَمِرَيْنِ - فَقُلْنَا: لَوْ لَقِينَا أَحَدًا مَنْ أَصْحَابِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَسَأَلْنَاهُ عَمَّا يَقُولُ هَؤُلَاءِ فِي الْقَدَرِ، فَوُفِّقَ لَنَا عَبْدُ اللهِ بْنُ عُمَرَ بْنِ الْخَطَّابِ دَاخِلًا الْمَسْجِدَ، فَاكْتَنَفْتُهُ أَنَا وَصَاحِبِي أَحَدُنَا عَنْ يَمِينِهِ، وَالْآخَرُ عَنْ شِمَالِهِ، فَظَنَنْتُ أَنَّ صَاحِبِي سَيَكِلُ الْكَلَامَ إِلَيَّ، فَقُلْتُ [ص:37]: أَبَا عَبْدِ الرَّحْمَنِ إِنَّهُ قَدْ ظَهَرَ قِبَلَنَا نَاسٌ يَقْرَءُونَ الْقُرْآنَ، وَيَتَقَفَّرُونَ الْعِلْمَ، وَذَكَرَ مِنْ شَأْنِهِمْ، وَأَنَّهُمْ يَزْعُمُونَ أَنْ لَا قَدَرَ، وَأَنَّ الْأَمْرَ أُنُفٌ، قَالَ: «فَإِذَا لَقِيتَ أُولَئِكَ فَأَخْبِرْهُمْ أَنِّي بَرِيءٌ مِنْهُمْ، وَأَنَّهُمْ بُرَآءُ مِنِّي»، وَالَّذِي يَحْلِفُ بِهِ عَبْدُ اللهِ بْنُ عُمَرَ «لَوْ أَنَّ لِأَحَدِهِمْ مِثْلَ أُحُدٍ ذَهَبًا، فَأَنْفَقَهُ مَا قَبِلَ اللهُ مِنْهُ حَتَّى يُؤْمِنَ بِالْقَدَرِ» ثُمَّ قَالَ: حَدَّثَنِي أَبِي عُمَرُ بْنُ الْخَطَّابِ قَالَ: بَيْنَمَا نَحْنُ عِنْدَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ، إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ، شَدِيدُ سَوَادِ الشَّعَرِ، لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ، وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ، حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، فَأَسْنَدَ رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ، وَوَضَعَ كَفَّيْهِ عَلَى فَخِذَيْهِ، وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ، فَقَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الْإِسْلَامُ أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَتُقِيمَ الصَّلَاةَ، وَتُؤْتِيَ الزَّكَاةَ، وَتَصُومَ رَمَضَانَ، وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا»، قَالَ: صَدَقْتَ، قَالَ: فَعَجِبْنَا لَهُ يَسْأَلُهُ، وَيُصَدِّقُهُ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ، قَالَ: «أَنْ تُؤْمِنَ بِاللهِ، وَمَلَائِكَتِهِ، وَكُتُبِهِ، وَرُسُلِهِ، وَالْيَوْمِ الْآخِرِ، وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ»، قَالَ: صَدَقْتَ، قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ، قَالَ: «أَنْ تَعْبُدَ اللهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ»، قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ، قَالَ: «مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ» قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَتِهَا، قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا، وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ»، قَالَ: ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا، ثُمَّ قَالَ لِي: «يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ؟» قُلْتُ: اللهُ وَرَسُولُهُ أَعْلَمُ، قَالَ: «فَإِنَّهُ جِبْرِيلُ أَتَاكُمْ يُعَلِّمُكُمْ دِينَكُمْ»",
			"headingArabic": "بيان الإيمان والإسلام والإحسان ووجوب الإيمان بإثبات قدر الله سبحانه وتعالى وبيان الدليل على التبري ممن لا يؤمن بالقدر وإغلاظ القول في حقه",
			"headingUrdu": "الایمان، الاسلام اور الاحسان اور ایمان کے فرائض کو اللہ کی قدر کے اثبات کے ساتھ بیان کرنا، وہ بزرگ و برتر ہے۔ اور القدر کو نہ ماننے والے کے بے گناہ ہونے کے ثبوت کی وضاحت اور اس کے معاملے میں سخت نظر رکھنا",
			"headingEnglish": "Explaining Al-Iman (Faith), Al-Islam, and Al-Ihsan, and The Obligations of Al-Iman With Affirmation of The Qadar of Allah, Glorious And Most High is He. And Explaining The Evidence For Declaring One's Innocence Of One Who Does Not Believe In Al-Qadar, And Having A Harsh View Of His Case",
			"chapterId": "1",
			"bookSlug": "sahih-muslim",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 101,
				"chapterNumber": "1",
				"chapterEnglish": "The Book of Faith",
				"chapterUrdu": "ایمان کا بیان",
				"chapterArabic": "كتاب الْإِيمَانِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 8098,
			"hadithNumber": "534",
			"englishNarrator": "Abu Malik at-Ash'ari رضی ‌اللہ ‌عنہ reported:",
			"hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: Cleanliness is half of faith and al-Hamdu Liliah (Praise be to Allah) fills the scale, and Subhan Allah (Glory be to Allah) and al-Hamdu Liliah (Praise be to Allah) fill upwhat is between the heavens and the earth, and prayer is a light, and charity is proof (of one's faith) and endurance is a brightness and the Holy Qur'an is a proof on your behalf or against you. All men go out early in the morning and sell themselves, thereby setting themselves free or destroying themselves.",
			"hadithUrdu": "رسول اللہ ﷺ نے فرمایا : ’’پاکیزگی نصف ایمان ہے ۔ الحمد لله ترازو کو بھر دیتا ہے ۔ سبحان الله اور الحمد لله آسمانوں سے زمین تک کی وسعت کو بھر دیتے ہیں ۔ نماز نور ہے ۔ صدقہ دلیل ہے ۔ صبر روشنی ہے ۔ قرآن تمہارے حق میں یا تمہارے خلاف حجت ہے ہر انسان دن کا آغاز کرتا ہے تو ( کچھ اعمال کے عوض ) اپنا سودا کرتا ہے ، پھر یا تو خود آزاد کرنےوالا ہوتا ہے خود کو تباہ کرنے والا ۔ ‘ ‘",
			"urduNarrator": "ہم سے اسحاق بن منصور نے بیان کیا، ہم سے حبان بن ہلال نے بیان کیا، ہم سے ابان نے بیان کیا، ہم سے یحییٰ نے بیان کیا، کہا کہ ہم سے زید نے بیان کیا، کہا کہ ہم سے ابو سلام نے بیان کیا،حضرت ابو مالک اشعری ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ مَنْصُورٍ، حَدَّثَنَا حَبَّانُ بْنُ هِلَالٍ، حَدَّثَنَا أَبَانُ، حَدَّثَنَا يَحْيَى، أَنَّ زَيْدًا، حَدَّثَهُ أَنَّ أَبَا سَلَّامٍ، حَدَّثَهُ عَنْ أَبِي مَالِكٍ الْأَشْعَرِيِّ قَالَ: قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «الطُّهُورُ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ، وَسُبْحَانَ اللهِ وَالْحَمْدُ لِلَّهِ تَمْلَآَنِ - أَوْ تَمْلَأُ - مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ، وَالصَّلَاةُ نُورٌ، وَالصَّدَقَةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ، وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ، كُلُّ النَّاسِ يَغْدُو فَبَايِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا».",
			"headingArabic": "فَضْلِ الْوُضُوءِ ‏‏",
			"headingUrdu": "وضو کی فضیلت",
			"headingEnglish": "The virtue of wudu’",
			"chapterId": "2",
			"bookSlug": "sahih-muslim",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 102,
				"chapterNumber": "2",
				"chapterEnglish": "The Book of Purification",
				"chapterUrdu": "پاکی کا بیان",
				"chapterArabic": "كتاب الطَّهَارَةِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 8243,
			"hadithNumber": "679",
			"englishNarrator": "A'isha reported:",
			"hadithEnglish": "When anyone amongst us (amongst the wives of the Holy Prophet) menstruated, the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) asked her to tie a waist-wrapper over her (body) and then embraced her.",
			"hadithUrdu": "ہم ( ازواد نبی ﷺ ) میں سے کسی ایک کے خصوصی ایام ہوتے ہیں تو رسول اللہ ﷺ چادر باندھنے کا حکم دیتے ، وہ چادر باندھ لیتی تو پھر آپ اس کےساتھ لیٹ جاتے ۔",
			"urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور زہیر بن حرب نے بیان کیا,ابراہیم نے اسو د سے انہوں نے حضرت عائشہ ؓ سے روایت کی ، کہا",
			"hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَزُهَيْرُ بْنُ حَرْبٍ، وَإِسْحَاقُ بْنُ إِبْرَاهِيمَ، - قَالَ إِسْحَاقُ: أَخْبَرَنَا، وَقَالَ الْآخَرَانِ - حَدَّثَنَا جَرِيرٌ، عَنْ مَنْصُورٍ، عَنْ إِبْرَاهِيمَ، عَنِ الْأَسْوَدِ، عَنْ عَائِشَةَ قَالَتْ: «كَانَ إِحْدَانَا إِذَا كَانَتْ حَائِضًا أَمَرَهَا رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ فَتَأْتَزِرُ بِإِزَارٍ ثُمَّ يُبَاشِرُهَا».",
			"headingArabic": "مُبَاشَرَةِ الْحَائِضِ فَوْقَ الإِزَارِ ‏‏",
			"headingUrdu": "حیض والی عورت کو ازار کے اوپر چھونا (کمر کی چادر)",
			"headingEnglish": "Touching a menstruating woman above the izar (waist wrapper)",
			"chapterId": "3",
			"bookSlug": "sahih-muslim",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 103,
				"chapterNumber": "3",
				"chapterEnglish": "The Book of Menstruation",
				"chapterUrdu": "حیض کا معنی و مفہوم",
				"chapterArabic": "كتاب الْحَيْضِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 8401,
			"hadithNumber": "837",
			"englishNarrator": "Ibn Umar رضی ‌اللہ ‌عنہ reported:",
			"hadithEnglish": "When the Muslims came to Medina, they gathered and sought to know the time of prayer but no one summoned them. One day they discussed the matter, and some of them said: Use something like the bell of the Christians and some of them said: Use horn like that of the Jews. Umar ‌رضی ‌اللہ ‌عنہ ‌said: Why may not a be appointed who should call (people) to prayer? The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) said: O Bilal, get up and summon (the people) to prayer.",
			"hadithUrdu": "جب مسلمان مدینہ آئے تو وہ اکٹھے ہو جاتے اور نمازوں کے اوقات کا انتظار کرتے ، کوئی اس کا اعلان نہیں کرتا تھا ۔ ایک دن انہوں نے اس کے بارے میں گفتگو کی تو بعض نے کہا : عیسائیوں کے گھنٹے کے مانند ایک گھنٹا لے لو اور بعض نے کہا : یہود کے قرنا جیسا قرنا ، البتہ حضرت عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ نے کہا : تم ایک آدمی ہی کیوں نہیں بھیج دیتے جو نماز کا اعلان کرے؟ رسول اللہﷺ نے فرمایا : احضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ انہوں نے کہا : اے بلال! اٹھو اور نماز کا اعلان کرو ۔ ‘ ‘",
			"urduNarrator": "ہم سے اسحاق بن ابراہیم  الْحَنظلي، نے بیان کیا، کہا ہم سے محمد بن بکر،  اور ہم سے محمد بن رافع نے بیان کیا، کہا کہ ہم سے عبدالرزاق نے بیان کیا، انہوں نے کہا: مجھ سے ابن جریج، ہارون بن عبداللہ نے بیان کیا اور تلفظ ان کا ہے۔ انہوں نے کہا: ہم سے حجاج بن محمد نے بیان کیا، انہوں نے کہا: ابن جریج نے کہا: انہوں نے مجھے نافع ابن عمر رضی اللہ عنہما کے موکل نے خبر دی,حضرت عبد اللہ بن عمر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت ہے کہ انہوں نے کہا",
			"hadithArabic": "حَدَّثَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ الْحَنْظَلِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ بَكْرٍ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رَافِعٍ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ قَالَا: أَخْبَرَنَا ابْنُ جُرَيْجٍ، ح وَحَدَّثَنِي هَارُونُ بْنُ عَبْدِ اللهِ - وَاللَّفْظُ لَهُ - قَالَ: حَدَّثَنَا حَجَّاجُ بْنُ مُحَمَّدٍ، قَالَ: قَالَ ابْنُ جُرَيْجٍ: أَخْبَرَنِي نَافِعٌ، مَوْلَى ابْنِ عُمَرَ، عَنْ عَبْدِ اللهِ بْنِ عُمَرَ أَنَّهُ قَالَ: كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَوَاتِ، وَلَيْسَ يُنَادِي بِهَا أَحَدٌ، فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ فَقَالَ بَعْضُهُمْ: اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى، وَقَالَ بَعْضُهُمْ: قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ، فَقَالَ عُمَرُ أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ؟ قَالَ رَسُولُ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ: «يَا بِلَالُ قُمْ فَنَادِ بِالصَّلَاةِ».",
			"headingArabic": "بَدْءِ الأَذَانِ",
			"headingUrdu": "اذان کا آغاز",
			"headingEnglish": "The Beginning Of The Adhan",
			"chapterId": "4",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 104,
				"chapterNumber": "4",
				"chapterEnglish": "The Book of Prayers",
				"chapterUrdu": "نماز کے احکام و مسائل",
				"chapterArabic": "كتاب الصَّلَاةِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 8725,
			"hadithNumber": "1161",
			"englishNarrator": "Abu Dharr رضی ‌اللہ ‌عنہ ‌reported:",
			"hadithEnglish": "I said: Messenger of Allah, which mosque was set up first on the earth? He said: Al-Masjid al-Haram (the sacred). I (again) said: Then which next? He said: It was the Masjid Aqsa. I (again) said: How long the space of time (between their setting up)? He (the Holy Prophet) said: It was forty years. And whenever the time comes for prayer, pray there, for that is a mosque; and in the hadith transmitted by Abu Kamil (the words are): Whenever time comes for prayer, pray, for that is a mosque (for you).",
			"hadithUrdu": "میں نے عرض کی : اے اللہ کے رسول! کون سی مسجد جو زمین میں بنائی گئی پہلی ہے؟ آپ نے فرمایا : ’’ مسجد حرام ۔ ‘ ‘ میں نے پوچھا : پھر کون سی؟ فرمایا : ’’مسجد اقصیٰ ۔ ‘ ‘ میں نے ( پھر ) پوچھا : دونوں ( کی تعمیر ) کے مابین کتنا زمانہ تھا؟ آپ نے فرمایا : ’’چالیس برس ۔ اور جہاں بھی تمہارے لیے نماز کا وقت ہو جائے ، نماز پڑھ لو ، وہی ( جگہ ) مسجد ہے ۔ ‘ ‘ ابو کامل کی حدیث میں ہے : ’’ پھر جہاں بھی تمہاری نماز کا وقت ہو جائے ، اسے پڑھ لو ، بلاشبہ وہی جگہ مسجد ہے",
			"urduNarrator": "ابو کامل جحدری نے کہا : ہمیں عبد الواحد نے اعمش سے حدیث بیان کی ، نیز ابو بکر بن ابی شیبہ اور ابو کریب نے کہا : ہمیں ابو معاویہ نے اعمش سے حدیث سنائی ، انہوں نے حضرت ابراہیم تیمی سے ، انہوں نے اپنے والد سے اور انہوں نے حضرت ابو ذر ‌رضی ‌اللہ ‌عنہ ‌ ‌ سے روایت کی ، کہا",
			"hadithArabic": "حَدَّثَنِي أَبُو كَامِلٍ الْجَحْدَرِيُّ، حَدَّثَنَا عَبْدُ الْوَاحِدِ، حَدَّثَنَا الْأَعْمَشُ، ح قَالَ: وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَأَبُو كُرَيْبٍ، قَالَا: حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الْأَعْمَشِ، عَنْ إِبْرَاهِيمَ التَّيْمِيِّ، عَنْ أَبِيهِ، عَنْ أَبِي ذَرٍّ، قَالَ: قُلْتُ يَا رَسُولَ اللهِ: أَيُّ مَسْجِدٍ وُضِعَ فِي الْأَرْضِ أَوَّلُ؟ قَالَ: «الْمَسْجِدُ الْحَرَامُ» قُلْتُ: ثُمَّ أَيٌّ؟ قَالَ: «الْمَسْجِدُ الْأَقْصَى» قُلْتُ: كَمْ بَيْنَهُمَا؟ قَالَ: «أَرْبَعُونَ سَنَةً، وَأَيْنَمَا أَدْرَكَتْكَ الصَّلَاةُ فَصَلِّ فَهُوَ مَسْجِدٌ» وَفِي حَدِيثِ أَبِي كَامِلٍ «ثُمَّ حَيْثُمَا أَدْرَكَتْكَ الصَّلَاةُ فَصَلِّهِ، فَإِنَّهُ مَسْجِدٌ».",
			"headingArabic": "الْمَسَاجِدِ وَمَوَاضِعِ الصَّلاَةِ",
			"headingUrdu": "مساجد اور نماز کے مقامات کی کتاب",
			"headingEnglish": "The Book of Mosques and Places of Prayer",
			"chapterId": "5",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 105,
				"chapterNumber": "5",
				"chapterEnglish": "The Book of Mosques and Places of Prayer",
				"chapterUrdu": "مسجدیں اور نماز کی جگہیں",
				"chapterArabic": "كتاب الْمَسَاجِدِ وَمَوَاضِعِ الصَّلَاة",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 9134,
			"hadithNumber": "1570",
			"englishNarrator": "A'isha رضی اللہ عنہا , the wife of the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌), reported:",
			"hadithEnglish": "The prayer was prescribed as two rak'ahs, two rak'ahs both in journey and at the place of residence. The prayer while travelling remained as it was (originally prescribed), but an addition was made in the prayer (observed) at the place of residence.",
			"hadithUrdu": "سفر اور حضر ( مقیم ہونے کی حالت ) میں نماز دو دور رکعت فرض کی گئی تھی ، پھر سفر کی نماز ( پہلی حالت پر ) قائم رکھی گئی اور حضر کی نماز میں اضافہ کردیا گیا ۔",
			"urduNarrator": "ہم سے یحییٰ بن یحییٰ نے بیان کیا، انہوں نے کہا: میں نے مالک سے پڑھا,صالح بن کیسان نے عروہ بن زبیر سے اور انھوں نے نبی کریم صلی اللہ علیہ وسلم کی اہلیہ حضرت عائشہ رضی اللہ عنہا سے روایت کی انھوں نے کہا",
			"hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى قَالَ قَرَأْتُ عَلَى مَالِكٍ عَنْ صَالِحِ بْنِ كَيْسَانَ عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ عَنْ عَائِشَةَ زَوْجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَنَّهَا قَالَتْ فُرِضَتْ الصَّلَاةُ رَكْعَتَيْنِ رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ فَأُقِرَّتْ صَلَاةُ السَّفَرِ وَزِيدَ فِي صَلَاةِ الْحَضَرِ.",
			"headingArabic": "صَلاَةِ الْمُسَافِرِينَ وَقَصْرِهَا ‏‏",
			"headingUrdu": "مسافروں کی نماز اور قصر",
			"headingEnglish": "The travelers’ prayer and shortening it",
			"chapterId": "6",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 106,
				"chapterNumber": "6",
				"chapterEnglish": "The Book of Prayer - Travellers",
				"chapterUrdu": "مسافرو ں کی نماز قصر کا بیان",
				"chapterArabic": "كتاب صَلَاةِ الْمُسَافِرِينَ وَقَصْرِهَا",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 9401,
			"hadithNumber": "1837",
			"englishNarrator": "A'isha رضی اللہ تعالیٰ عنہا reported:",
			"hadithEnglish": "The Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌) heard a person reciting the Qur'an at night. Upon this he said: May Allah show mercy to him; he has reminded me of such and such a verse which I had missed in such and such a surah.",
			"hadithUrdu": "نبی صلی اللہ علیہ وسلم نے ایک آدمی کی قراءت سنی جو وہ رات کو کر رہا تھا تو فر ما یا : \" اللہ اس پر رحم فر ما ئے !اس نے مجھے فلاں آیت یاد دلا دی جس کی تلاوت فلاں سورت میں چھوڑ چکا تھا.",
			"urduNarrator": "ہم سے ابوبکر بن ابی شیبہ اور ابو کریب نے بیان کیا، کہا ہم سے انہوں نے بیان کیا, ابواسامہ نے ہشام سے انھوں نے اپنے والد ( عروہ ) سے اور انھوں نے حضرت عائشہ رضی اللہ تعالیٰ عنہا سے روایت کی کہ",
			"hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ وَأَبُو كُرَيْبٍ قَالَا حَدَّثَنَا أَبُو أُسَامَةَ عَنْ هِشَامٍ عَنْ أَبِيهِ عَنْ عَائِشَةَ أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ سَمِعَ رَجُلًا يَقْرَأُ مِنْ اللَّيْلِ فَقَالَ يَرْحَمُهُ اللَّهُ لَقَدْ أَذْكَرَنِي كَذَا وَكَذَا آيَةً كُنْتُ أَسْقَطْتُهَا مِنْ سُورَةِ كَذَا وَكَذَا.",
			"headingArabic": "فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
			"headingUrdu": "فضائل القرآن کی کتاب وغیرہ",
			"headingEnglish": "The book of the virtues of the Qur’an etc",
			"chapterId": "7",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 107,
				"chapterNumber": "7",
				"chapterEnglish": "The Book Of the Merit Of The Holy Quran",
				"chapterUrdu": "قرآن کے فضائل اور متعلقہ امور",
				"chapterArabic": "کتاب فَضَائِلِ الْقُرْآنِ وَمَا يَتَعَلَّقُ بِهِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 9515,
			"hadithNumber": "1951",
			"englishNarrator": "Abdullah is reported to have heard Allah's Messenger ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) as saying:",
			"hadithEnglish": "When any one of you intends to come for Jumu'a prayer, he should take a bath.",
			"hadithUrdu": "\" جب تم میں سے کوئی شخص جمعے کےلئے آنے کاارادہ کرے تو وہ غسل کرے ۔ \"",
			"urduNarrator": "ہم سے یحییٰ بن یحییٰ التمیمی اور محمد بن روم بن المہاجر نے بیان کیا، کہا: ہمیں لیث نے خبر دی، ہم سے قتیبہ نے بیان کیا، ہم سے لیث نے بیان کیا, نافع نے حضرت عبداللہ ( بن عمر رضی اللہ تعالیٰ عنہ ) سے روایت کی ، انھوں نےکہا: میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے ہوئےسنا",
			"hadithArabic": "حَدَّثَنَا يَحْيَى بْنُ يَحْيَى التَّمِيمِيُّ وَمُحَمَّدُ بْنُ رُمْحِ بْنِ الْمُهَاجِرِ قَالَا أَخْبَرَنَا اللَّيْثُ ح و حَدَّثَنَا قُتَيْبَةُ حَدَّثَنَا لَيْثٌ عَنْ نَافِعٍ عَنْ عَبْدِ اللَّهِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَقُولُ إِذَا أَرَادَ أَحَدُكُمْ أَنْ يَأْتِيَ الْجُمُعَةَ فَلْيَغْتَسِلْ.",
			"headingArabic": "الجمعة",
			"headingUrdu": "نماز کی کتاب - جمعہ",
			"headingEnglish": "The Book of Prayer - Friday",
			"chapterId": "8",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 108,
				"chapterNumber": "8",
				"chapterEnglish": "The Book of Prayer - Friday",
				"chapterUrdu": "جمعہ کے احکام و مسائل",
				"chapterArabic": "كتاب الْجُمُعَةِ",
				"bookSlug": "sahih-muslim"
			}
		},
		{
			"id": 9608,
			"hadithNumber": "2044",
			"englishNarrator": "Ibn 'Abbas رضی اللہ تعالیٰ عنہ reported:",
			"hadithEnglish": "I participated in the Fitr prayer with the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) and Abu Bakr, 'Umar and 'Uthman رضی اللہ تعالیٰ عنہ , and all of them observed this prayer before the Khutba, and then he (the Holy Prophet) delivered the sermon. Then the Messenger of Allah ( ‌صلی ‌اللہ ‌علیہ ‌وسلم ‌ ) descended (from the pulpit) and I (perceive) as if I am seeing him as he is commanding people with his hand to sit down. He then made his way through their (assembly) till he came to the women. Bilal رضی اللہ تعالیٰ عنہ was with him. He then recited (this verse): O Prophet, when believing women come to thee giving thee a pledge that they will not associate aught with Allah (lx. 12) till he finished (his address to) them and then said: Do you conform to it (what has been described in the verse)? Only one woman among them replied: Yes, Apostle of Allah, but none else replied. He (the narrator) said: It could not be ascertained who actually she was. He (the Holy Prophet) exhorted them to give alms. Bilal رضی اللہ تعالیٰ عنہ  stretched his cloth and then said: Come forward with alms. Let my father and mother be taken as ransom for you. And they began to throw rings and ringlets in the cloth of Bilal رضی اللہ تعالیٰ عنہ .",
			"hadithUrdu": "میں عید الفطر کی نماز میں رسول اللہ صلی اللہ علیہ وسلم ابو بکر رضی اللہ تعالیٰ عنہ عمر اور عثمان رضی اللہ تعالیٰ عنہ کے ساتھ حاضر ہوا ہوں یہ سب خطبے سے پہلے نماز پڑھتے تھے پھر خطبہ دیتے تھے ایک دفعہ اللہ کے نبی صلی اللہ علیہ وسلم ( بلند جگہ سے ) نیچے آئے ایسا محسوس ہو تا ہے کہ میں ( اب بھی ) آپ کو دیکھ رہا ہوں جب آپ اپنے ہاتھ سے مردوں کو بٹھا رہے تھے پھر ان کے در میان میں سے راستہ بنا تے ہو ئے آگے بڑھے حتیٰ کہ عورتوں کے قریب تشریف لے آئے اور بلال رضی اللہ تعالیٰ عنہ آپ کے ساتھ تھے آپ نے ( قرآن کا یہ حصہ تلاوت ) فر ما یا ۔ \" اے نبی صلی اللہ علیہ وسلم !جب آپ کے پاس مومن عورتیں اس بات پر بیعت کرنے کے لیے آئیں کہ وہ اللہ تعا لیٰ کے ساتھ کسی چیز کو شریک نہیں بنا ئیں گی ۔ آپ نے یہ آیت تلاوت فر ما ئی حتیٰ کہ اس سے فارغ ہو ئے پھر فر ما یا ۔ \" تم اس پر قائم ہو؟ \" تو ایک عورت نے ( جبکہ ) آپ کو اس کے علاوہ ان میں سے اور کسی نے جواب نہیں دیا کہا : ہاں اے اللہ کے نبی صلی اللہ علیہ وسلم ! ۔ ۔ اس وقت پتہ نہیں چل رہا تھا کہ وہ کو ن ہے ۔ ۔ ۔ آپ نے فر ما یا ۔ \" تم صدقہ کرو ۔ ۔ ۔ اس پر بلال رضی اللہ تعالیٰ عنہ نے اپنا کپڑا پھیلا دیا پھر کہنے لگے لاؤ تم سب پر میرے ماں باپ قربان ہوں !تو وہ اپنے بڑے بڑے چھلے اور انگوٹھیا ں بلال رضی اللہ تعالیٰ عنہ کے کپڑے میں ڈالنے لگیں ۔",
			"urduNarrator": "اور مجھ سے محمد بن رافع اور عبد بن حمید نے عبد الرزاق کی سند سے بیان کیا کہ ہم کو عبد الرزاق نے خبر دی , حسن بن مسلم نے طاوس سے خبر دی انھوں نے حضرت ابن عباس رضی اللہ تعالیٰ عنہ سے روا یت کی انھوں نے کہا",
			"hadithArabic": "و حَدَّثَنِي مُحَمَّدُ بْنُ رَافِعٍ وَعَبْدُ بْنُ حُمَيْدٍ جَمِيعًا عَنْ عَبْدِ الرَّزَّاقِ قَالَ ابْنُ رَافِعٍ حَدَّثَنَا عَبْدُ الرَّزَّاقِ أَخْبَرَنَا ابْنُ جُرَيْجٍ أَخْبَرَنِي الْحَسَنُ بْنُ مُسْلِمٍ عَنْ طَاوُسٍ عَنْ ابْنِ عَبَّاسٍ قَالَ شَهِدْتُ صَلَاةَ الْفِطْرِ مَعَ نَبِيِّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ وَعُمَرَ وَعُثْمَانَ فَكُلُّهُمْ يُصَلِّيهَا قَبْلَ الْخُطْبَةِ ثُمَّ يَخْطُبُ قَالَ فَنَزَلَ نَبِيُّ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَأَنِّي أَنْظُرُ إِلَيْهِ حِينَ يُجَلِّسُ الرِّجَالَ بِيَدِهِ ثُمَّ أَقْبَلَ يَشُقُّهُمْ حَتَّى جَاءَ النِّسَاءَ وَمَعَهُ بِلَالٌ فَقَالَ يَا أَيُّهَا النَّبِيُّ إِذَا جَاءَكَ الْمُؤْمِنَاتُ يُبَايِعْنَكَ عَلَى أَنْ لَا يُشْرِكْنَ بِاللَّهِ شَيْئًا فَتَلَا هَذِهِ الْآيَةَ حَتَّى فَرَغَ مِنْهَا ثُمَّ قَالَ حِينَ فَرَغَ مِنْهَا أَنْتُنَّ عَلَى ذَلِكِ فَقَالَتْ امْرَأَةٌ وَاحِدَةٌ لَمْ يُجِبْهُ غَيْرُهَا مِنْهُنَّ نَعَمْ يَا نَبِيَّ اللَّهِ لَا يُدْرَى حِينَئِذٍ مَنْ هِيَ قَالَ فَتَصَدَّقْنَ فَبَسَطَ بِلَالٌ ثَوْبَهُ ثُمَّ قَالَ هَلُمَّ فِدًى لَكُنَّ أَبِي وَأُمِّي فَجَعَلْنَ يُلْقِينَ الْفَتَخَ وَالْخَوَاتِمَ فِي ثَوْبِ بِلَالٍ.",
			"headingArabic": "صلاة العيدين",
			"headingUrdu": "نماز کی کتاب - دو عیدیں",
			"headingEnglish": "The Book of Prayer - Two Eids",
			"chapterId": "9",
			"bookSlug": "sahih-muslim",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 2,
				"bookName": "Sahih Muslim",
				"writerName": "Imam Muslim",
				"aboutWriter": null,
				"writerDeath": "261 ھ",
				"bookSlug": "sahih-muslim"
			},
			"chapter": {
				"id": 109,
				"chapterNumber": "9",
				"chapterEnglish": "The Book of Prayer - Two Eids",
				"chapterUrdu": "نماز عیدین کے احکام و مسائل",
				"chapterArabic": "كتاب صَلَاةِ الْعِيدَيْنِ",
				"bookSlug": "sahih-muslim"
			}
		}
	],
	"al-tirmidhi": [
		{
			"id": 15125,
			"hadithNumber": "1",
			"englishNarrator": "Ibn `Umar رضی اللہ عنہما narrated:",
			"hadithEnglish": "The Prophet said: Salat will not be accepted without purification, nor Charity from Ghulul. Hannad said in his narration, except with purification [Abu `Eisa said: This Hadith is the most correct thing on this topic, and the best. There are also narrations on this topic from Abu Al-Malih, from his father; and Abu Hurairah and Anas رضی اللہ عنہم. \r\nAnd Abu Al-Malih bin Usamah's name is `Amir, and they also say it was Zaid bin Usamah bin `Umair Al-Hudhali.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”نماز بغیر وضو کے قبول نہیں کی جاتی ۲؎ اور نہ صدقہ حرام مال سے قبول کیا جاتا ہے“۔ امام ترمذی کہتے ہیں: ۱- اس باب میں یہ حدیث سب سے صحیح اور حسن ہے ۳؎۔ ۲- اس باب میں ابوالملیح کے والد اسامہ، ابوہریرہ اور انس رضی اللہ عنہم سے بھی احادیث آئی ہیں۔\r\nاور ابو الملیح بن اسامہ کا نام عامر ہے اور وہ یہ بھی کہتے ہیں کہ یہ زید بن اسامہ بن عمیر الحذلی تھے۔",
			"urduNarrator": "ہم سے قتیبہ بن سعید نے بیان کیا، ہم سے ابو عوانہ نے سماک بن حرب سے بیان کیا۔ ہم سے ہناد نے بیان کیا، ہم سے وکیع نے، اسرائیل سے، سماک سے، مصعب بن سعد کی سند سے,عبداللہ بن عمر رضی اللہ عنہما سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ سِمَاكِ بْنِ حَرْبٍ. ح وحَدَّثَنَا هَنَّادٌ، حَدَّثَنَا وَكِيعٌ، عَنْ إِسْرَائِيلَ، عَنْ سِمَاكٍ، عَنْ مُصْعَبِ بْنِ سَعْدٍ، عَنْ ابْنِ عُمَرَ، عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَا تُقْبَلُ صَلَاةٌ بِغَيْرِ طُهُورٍ وَلَا صَدَقَةٌ مِنْ غُلُولٍ . قَالَ هَنَّادٌ فِي حَدِيثِهِ:‏‏‏‏ إِلَّا بِطُهُورٍ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا الْحَدِيثُ أَصَحُّ شَيْءٍ فِي هَذَا الْبَابِ وَأَحْسَنُ،‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي الْمَلِيحِ، ‏‏‏‏‏‏عَنْ أَبِيهِ،‏‏‏‏ وَأَبِي هُرَيْرَةَ،‏‏‏‏ وَأَنَسٍ،‏‏‏‏ وَأَبُو الْمَلِيحِ بْنُ أُسَامَةَ اسْمُهُ عَامِرٌ، ‏‏‏‏‏‏وَيُقَالُ:‏‏‏‏ زَيْدُ بْنُ أُسَامَةَ بْنِ عُمَيْرٍ الْهُذَلِيُّ.",
			"headingArabic": "مَا جَاءَ لاَ تُقْبَلُ صَلاَةٌ بِغَيْرِ طُهُورٍ ‏",
			"headingUrdu": "اس کا کیا تعلق ہے کہ بغیر طہارت کے نماز قبول نہیں ہوتی",
			"headingEnglish": "What Has Been Related That Salat Is Not Accepted Without Purification",
			"chapterId": "1",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 156,
				"chapterNumber": "1",
				"chapterEnglish": "The Book on Purification",
				"chapterUrdu": "طہارت کے احکام و مسائل",
				"chapterArabic": "كتاب الطهارة عن رسول الله صلى الله عليه وسلم",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15273,
			"hadithNumber": "149",
			"englishNarrator": "Ibn Abbas narrated that:",
			"hadithEnglish": "The Prophet said: Jibra`il (peace be upon him) led me (in Salat) twice at the House. So he prayed Zuhr the first time when the shadow was similar to (the length of) the strap a sandal. Then he prayed Asr when everything was similar (to the length of) its shadow. Then he prayed Maghrib when the sun had set and the fasting person breaks fast. Then he prayed Isha when the twilight had vanished. Then he prayed Fajr when Fajr (dawn) began, and when eating is prohibited for the fasting person. The second time he prayed Zuhr when the shadow of everything was similar to (the length of) it, at the time of Asr the day before. Then he prayed Asr when the shadow of everything was about twice as long as it. Then he prayed Maghrib at the same time as he did the first time. Then he prayed Isha, the later one, when a third of the night had gone. Then he prayed Subh when the land glowed. Then Jibril turned towards me and said: O Muhammad! These are the times of the Prophets before you, and the (best) time is what is between these two times.",
			"hadithUrdu": "نبی اکرم صلی الله علیہ وسلم نے فرمایا: ”جبرائیل علیہ السلام نے خانہ کعبہ کے پاس میری دو بار امامت کی، پہلی بار انہوں نے ظہر اس وقت پڑھی ( جب سورج ڈھل گیا اور ) سایہ جوتے کے تسمہ کے برابر ہو گیا، پھر عصر اس وقت پڑھی جب ہر چیز کا سایہ اس کے ایک مثل ہو گیا ۱؎، پھر مغرب اس وقت پڑھی جب سورج ڈوب گیا اور روزے دار نے افطار کر لیا، پھر عشاء اس وقت پڑھی جب شفق ۲؎ غائب ہو گئی، پھر نماز فجر اس وقت پڑھی جب فجر روشن ہو گئی اور روزہ دار پر کھانا پینا حرام ہو گیا، دوسری بار ظہر کل کی عصر کے وقت پڑھی جب ہر چیز کا سایہ اس کے مثل ہو گیا، پھر عصر اس وقت پڑھی جب ہر چیز کا سایہ اس کے دو مثل ہو گیا، پھر مغرب اس کے اول وقت ہی میں پڑھی ( جیسے پہلی بار میں پڑھی تھی ) پھر عشاء اس وقت پڑھی جب ایک تہائی رات گزر گئی، پھر فجر اس وقت پڑھی جب اجالا ہو گیا، پھر جبرائیل نے میری طرف متوجہ ہو کر کہا: اے محمد! یہی آپ سے پہلے کے انبیاء کے اوقات نماز تھے، آپ کی نمازوں کے اوقات بھی انہی دونوں وقتوں کے درمیان ہیں ۳؎۔ امام ترمذی کہتے ہیں: اس باب میں ابوہریرہ، بریدہ، ابوموسیٰ، ابومسعود انصاری، ابوسعید، جابر، عمرو بن حرم، براء اور انس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"urduNarrator": "عبداللہ بن عباس رضی الله عنہما سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ أَبِي الزِّنَادِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ بْنِ عَيَّاشِ بْنِ أَبِي رَبِيعَةَ، عَنْ حَكِيمِ بْنِ حَكِيمٍ وَهُوَ ابْنُ عَبَّادِ بْنِ حُنَيْفٍ،‏‏‏‏ أَخْبَرَنِي نَافِعُ بْنُ جُبَيْرِ بْنِ مُطْعِمٍ، قَالَ:‏‏‏‏ أَخْبَرَنِي ابْنُ عَبَّاسٍ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ أَمَّنِي جِبْرِيلُ عَلَيْهِ السَّلَام عِنْدَ الْبَيْتِ مَرَّتَيْنِ، ‏‏‏‏‏‏فَصَلَّى الظُّهْرَ فِي الْأُولَى مِنْهُمَا حِينَ كَانَ الْفَيْءُ مِثْلَ الشِّرَاكِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْعَصْرَ حِينَ كَانَ كُلُّ شَيْءٍ مِثْلَ ظِلِّهِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْمَغْرِبَ حِينَ وَجَبَتِ الشَّمْسُ وَأَفْطَرَ الصَّائِمُ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْعِشَاءَ حِينَ غَابَ الشَّفَقُ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْفَجْرَ حِينَ بَرَقَ الْفَجْرُ، ‏‏‏‏‏‏وَحَرُمَ الطَّعَامُ عَلَى الصَّائِمِ، ‏‏‏‏‏‏وَصَلَّى الْمَرَّةَ الثَّانِيَةَ الظُّهْرَ حِينَ كَانَ ظِلُّ كُلِّ شَيْءٍ مِثْلَهُ لِوَقْتِ الْعَصْرِ بِالْأَمْسِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْعَصْرَ حِينَ كَانَ ظِلُّ كُلِّ شَيْءٍ مِثْلَيْهِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْمَغْرِبَ لِوَقْتِهِ الْأَوَّلِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الْعِشَاءَ الْآخِرَةَ حِينَ ذَهَبَ ثُلُثُ اللَّيْلِ، ‏‏‏‏‏‏ثُمَّ صَلَّى الصُّبْحَ حِينَ أَسْفَرَتِ الْأَرْضُ، ‏‏‏‏‏‏ثُمَّ الْتَفَتَ إِلَيَّ جِبْرِيلُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ يَا مُحَمَّدُ هَذَا وَقْتُ الْأَنْبِيَاءِ مِنْ قَبْلِكَ وَالْوَقْتُ فِيمَا بَيْنَ هَذَيْنِ الْوَقْتَيْنِ . قَالَ أَبُو عِيسَى:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَبُرَيْدَةَ،‏‏‏‏ وَأَبِي مُوسَى،‏‏‏‏ وَأَبِي مَسْعُودٍ الْأَنْصَارِيِّ،‏‏‏‏ وَأَبِي سَعِيدٍ،‏‏‏‏ وَجَابِرٍ،‏‏‏‏ وَعَمْرِو بْنِ حَزْمٍ،‏‏‏‏ وَالْبَرَاءِ،‏‏‏‏ وَأَنَسٍ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "2",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 157,
				"chapterNumber": "2",
				"chapterEnglish": "The Book on Salat (Prayer)",
				"chapterUrdu": "نماز کے احکام و مسائل",
				"chapterArabic": "كتاب الصلاة",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15515,
			"hadithNumber": "391",
			"englishNarrator": "",
			"hadithEnglish": "Abdullah bin Buhainah Al-Asdi the ally of Banu Abdul-Muttalib narrated: The Prophet (S) stood for the Zuhr prayer, and he had a sitting to perform, so when he completed his Salat, he performed two prostrations, saying the Takbir for each prostration. So he was sitting before saying the Salam, and the people prostrated with him in place of the sitting he forgot.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نماز ظہر میں کھڑے ہو گئے جب کہ آپ کو بیٹھنا تھا، چنانچہ جب نماز پوری کر چکے تو سلام پھیرنے سے پہلے آپ نے اسی جگہ بیٹھے بیٹھے دو سجدے کئے، آپ نے ہر سجدے میں اللہ اکبر کہا، اور آپ کے ساتھ لوگوں نے بھی سجدہ سہو کیے۔ امام ترمذی کہتے ہیں: ۱- ابن بحینہ کی حدیث حسن صحیح ہے، ۲- اس باب میں عبدالرحمٰن بن عوف رضی الله عنہ سے بھی حدیث آئی ہے، ۳- محمد بن ابراہیم سے روایت کی ہے کہ ابوہریرہ اور عبداللہ بن سائب قاری رضی الله عنہما دونوں سہو کے دونوں سجدے سلام سے پہلے کرتے تھے، ۴- اور اسی پر بعض اہل علم کا عمل ہے اور شافعی کا بھی یہی قول ہے، ان کی رائے ہے کہ سجدہ سہو ہر صورت میں سلام سے پہلے ہے، اور یہ حدیث دوسری حدیثوں کی ناسخ ہے کیونکہ نبی اکرم صلی اللہ علیہ وسلم کا عمل آخر میں اسی پر رہا ہے، ۵- اور احمد اور اسحاق بن راہویہ کہتے ہیں کہ جب آدمی دو رکعت کے بعد کھڑا ہو جائے تو وہ ابن بحینہ رضی الله عنہ کی حدیث پر عمل کرتے ہوئے سجدہ سہو سلام سے پہلے کرے، ۶- علی بن مدینی کہتے ہیں کہ عبداللہ ابن بحینہ ہی عبداللہ بن مالک ہیں، ابن بحینہ کے باپ مالک ہیں اور بحینہ ان کی ماں ہیں، ۷- سجدہ سہو کے بارے میں اہل علم کے مابین اختلاف ہے کہ اسے آدمی سلام سے پہلے کرے یا سلام کے بعد۔ بعض لوگوں کی رائے ہے کہ اسے سلام کے بعد کرے، یہ قول سفیان ثوری اور اہل کوفہ کا ہے، ۸- اور بعض لوگوں نے کہا ہے کہ اسے سلام سے پہلے کرے یہی قول اکثر فقہاء مدینہ کا ہے، مثلاً یحییٰ بن سعید، ربیعہ وغیرہ کا اور یہی قول شافعی کا بھی ہے، ۹- اور بعض لوگ کہتے ہیں کہ جب نماز میں زیادتی ہوئی ہو تو سلام کے بعد کرے اور جب کمی رہ گئی ہو تو سلام سے پہلے کرے، یہی قول مالک بن انس کا ہے، ۱۰- اور احمد کہتے ہیں کہ جس صورت میں جس طرح پر سجدہ سہو نبی اکرم صلی اللہ علیہ وسلم سے مروی ہے اس صورت میں اسی طرح سجدہ سہو کرنا چاہیئے، وہ کہتے ہیں کہ جب دو رکعت کے بعد کھڑا ہو جائے تو ابن بحینہ رضی الله عنہ کی حدیث کے مطابق سلام سے پہلے سجدہ کرے اور جب ظہر پانچ رکعت پڑھ لے تو وہ سجدہ سہو سلام کے بعد کرے، اور اگر ظہر اور عصر میں دو ہی رکعت میں سلام پھیر دے تو ایسی صورت میں سلام کے بعد سجدہ سہو کرے، اسی طرح جس جس صورت میں جیسے جیسے رسول اللہ صلی اللہ علیہ وسلم کا فعل موجود ہے، اس پر اسی طرح عمل کرے، اور سہو کی جس صورت میں رسول اللہ صلی اللہ علیہ وسلم سے کوئی فعل مروی نہ ہو تو اس میں سجدہ سہو سلام سے پہلے کرے۔ ۱۱- اسحاق بن راہویہ بھی احمد کے موافق کہتے ہیں۔ مگر فرق اتنا ہے کہ وہ کہتے ہیں کہ سہو کی جس صورت میں رسول اللہ صلی اللہ علیہ وسلم سے کوئی فعل موجود نہ ہو تو اس میں اگر نماز میں زیادتی ہوئی ہو تو سلام کے بعد سجدہ سہو کرے اور اگر کمی ہوئی ہو تو سلام سے پہلے کرے۔",
			"urduNarrator": "عبداللہ ابن بحینہ اسدی رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ، عَنْ ابْنِ شِهَابٍ، عَنْ الْأَعْرَجِ، عَنْ عَبْدِ اللَّهِ ابْنِ بُحَيْنَةَ الْأَسَدِيِّ حَلِيفِ بَنِي عَبْدِ الْمُطَّلِبِ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَامَ فِي صَلَاةِ الظُّهْرِ وَعَلَيْهِ جُلُوسٌ، ‏‏‏‏‏‏فَلَمَّا أَتَمَّ صَلَاتَهُ سَجَدَ سَجْدَتَيْنِ يُكَبِّرُ فِي كُلِّ سَجْدَةٍ وَهُوَ جَالِسٌ قَبْلَ أَنْ يُسَلِّمَ، ‏‏‏‏‏‏وَسَجَدَهُمَا النَّاسُ مَعَهُ مَكَانَ مَا نَسِيَ مِنَ الْجُلُوسِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "3",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 158,
				"chapterNumber": "3",
				"chapterEnglish": "The Book on Rulings and issues related to forgetfulness in prayer",
				"chapterUrdu": "نماز میں سہو و نسیان سے متعلق احکام و مسائل",
				"chapterArabic": "كتاب أحكام ومسائل النسيان في الصلاة",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15576,
			"hadithNumber": "452",
			"englishNarrator": "",
			"hadithEnglish": "Kharijab bin Hudhafah narrated: Allah's Messenger came out to us and he said: 'Indeed Allah has assisted you with a Salat that is better for you than red camels: Al-Witr which Allah made for you between the Isha prayer till Al-Fajr has begun.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ( حجرے سے نکل کر ) ہمارے پاس آئے اور فرمایا: ”اللہ تعالیٰ نے تمہارے لیے ایک ایسی نماز کا اضافہ کیا ہے ۱؎، جو تمہارے لیے سرخ اونٹوں سے بہتر ہے، وہ وتر ہے، اللہ نے اس کا وقت تمہارے لیے نماز عشاء سے لے کر فجر کے طلوع ہونے تک رکھا ہے“۔ امام ترمذی کہتے ہیں: ۱- خارجہ بن حذافہ کی حدیث غریب ہے، اسے ہم صرف یزید بن ابی حبیب ہی کی روایت سے جانتے ہیں، ۲- بعض محدثین کو اس حدیث میں وہم ہوا ہے، انہوں نے عبداللہ بن راشد زرقی کہا ہے، یہ وہم ہے ( صحیح «زوفی» ہے ) ۳- اس باب میں ابوہریرہ، عبداللہ بن عمرو، بریدہ، اور ابو بصرہ غفاری رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- ابو بصرہ غفاری کا نام حمیل بن بصرہ ہے، اور بعض لوگوں نے جمیل بن بصرہ کہا ہے، لیکن یہ صحیح نہیں، اور ابو بصرہ غفاری ایک دوسرے شخص ہیں جو ابوذر رضی الله عنہ سے روایت کرتے ہیں اور وہ ابوذر کے بھتیجے ہیں۔",
			"urduNarrator": "خارجہ بن حذافہ رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزَّوْفِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي مُرَّةَ الزَّوْفِيِّ، عَنْ خَارِجَةَ بْنِ حُذَافَةَ، أَنَّهُ قَالَ:‏‏‏‏ خَرَجَ عَلَيْنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ اللَّهَ أَمَدَّكُمْ بِصَلَاةٍ هِيَ خَيْرٌ لَكُمْ مِنْ حُمْرِ النَّعَمِ الْوِتْرُ، ‏‏‏‏‏‏جَعَلَهُ اللَّهُ لَكُمْ فِيمَا بَيْنَ صَلَاةِ الْعِشَاءِ إِلَى أَنْ يَطْلُعَ الْفَجْرُ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ،‏‏‏‏ وَعَبْدِ اللَّهِ بْنِ عَمْرٍ، ‏‏‏‏‏‏وَبُرَيْدَةَ وَأَبِي بَصْرَةَ الْغِفَارِيِّ صَاحِبِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ خَارِجَةَ بْنِ حُذَافَةَ حَدِيثٌ غَرِيبٌ، ‏‏‏‏‏‏لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَزِيدَ بْنِ أَبِي حَبِيبٍ، ‏‏‏‏‏‏وَقَدْ وَهِمَ بَعْضُ الْمُحَدِّثِينَ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَنْ عَبْدِ اللَّهِ بْنِ رَاشِدٍ الزُّرَقِيِّ وَهُوَ وَهَمٌ فِي هَذَا، ‏‏‏‏‏‏وَأَبُو بَصْرَةَ الْغِفَارِيُّ اسْمُهُ حُمَيْلُ بْنُ بَصْرَةَ، ‏‏‏‏‏‏وقَالَ بَعْضُهُمْ:‏‏‏‏ جَمِيلُ بْنُ بَصْرَةَ وَلَا يَصِحُّ، ‏‏‏‏‏‏وَأَبُو بَصْرَةَ الْغِفَارِيُّ رَجُلٌ آخَرُ يَرْوِي عَنْ أَبِي ذَرٍّ وَهُوَ:‏‏‏‏ ابْنُ أَخِي أَبِي ذَرٍّ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "4",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 159,
				"chapterNumber": "4",
				"chapterEnglish": "The Book on Al-Witr",
				"chapterUrdu": "صلاۃ وترکے ابواب",
				"chapterArabic": "أَبْوَابُ الْوِتْرِ",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15612,
			"hadithNumber": "488",
			"englishNarrator": "",
			"hadithEnglish": "Abu Hurairah narrated that: the Prophet said: The best day that the sun has risen upon is Friday. On it Adam was created, on it he entered Paradise, and on it, he was expelled from it. And the Hour will not be established except on Friday.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: ”سب سے بہتر دن جس میں سورج نکلا، جمعہ کا دن ہے، اسی دن آدم کو پیدا کیا گیا، اسی دن انہیں جنت میں داخل کیا گیا، اسی دن انہیں جنت سے نکالا گیا، اور قیامت بھی اسی دن قائم ہو گی“ ۱؎۔ امام ترمذی کہتے ہیں: ۱- ابوہریرہ رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابولبابہ، سلمان، ابوذر، سعد بن عبادہ اور اوس بن اوس رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"urduNarrator": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الزِّنَادِ، عَنْ الْأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ خَيْرُ يَوْمٍ طَلَعَتْ فِيهِ الشَّمْسُ يَوْمُ الْجُمُعَةِ، ‏‏‏‏‏‏فِيهِ خُلِقَ آدَمُ، ‏‏‏‏‏‏وَفِيهِ أُدْخِلَ الْجَنَّةَ، ‏‏‏‏‏‏وَفِيهِ أُخْرِجَ مِنْهَا، ‏‏‏‏‏‏وَلَا تَقُومُ السَّاعَةُ إِلَّا فِي يَوْمِ الْجُمُعَةِ قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي لُبَابَةَ،‏‏‏‏ وَسَلْمَانَ،‏‏‏‏ وَأَبِي ذَرٍّ،‏‏‏‏ وَسَعْدِ بْنِ عُبَادَةَ،‏‏‏‏ وَأَوْسِ بْنِ أَوْسٍ، ‏‏‏‏‏‏قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي هُرَيْرَةَ حَدِيثٌ حَسَنٌ صَحِيحٌ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "5",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 160,
				"chapterNumber": "5",
				"chapterEnglish": "The Book on the Day of Friday",
				"chapterUrdu": "جمعہ کے احکام و مسائل",
				"chapterArabic": "كِتَاب الْجُمُعَةِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15654,
			"hadithNumber": "530",
			"englishNarrator": "",
			"hadithEnglish": "Ali bin Abi Talib narrated: It is from the SUnnah to leave for the Eid walking, and to eat something before leaving.",
			"hadithUrdu": "عید کے لیے پیدل جانا اور نکلنے سے پہلے کچھ کھا لینا سنت ہے۔ امام ترمذی کہتے ہیں: ۱- یہ حدیث حسن ہے، ۲- اکثر اہل علم کا اسی حدیث پر عمل ہے وہ مستحب سمجھتے ہیں کہ آدمی عید کے لیے پیدل جائے اور عید الفطر کی نماز کے لیے نکلنے سے پہلے کچھ کھا لے، ۳- مستحب یہ ہے کہ آدمی بلا عذر سوار ہو کر نہ جائے۔",
			"urduNarrator": "علی بن ابی طالب رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا إِسْمَاعِيل بْنُ مُوسَى الْفَزَارِيُّ، حَدَّثَنَا شَرِيكٌ، عَنْ أَبِي إِسْحَاق، عَنْ الْحَارِثِ، عَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ، قَالَ:‏‏‏‏ مِنَ السُّنَّةِ أَنْ تَخْرُجَ إِلَى الْعِيدِ مَاشِيًا وَأَنْ تَأْكُلَ شَيْئًا قَبْلَ أَنْ تَخْرُجَ . قَالَ أَبُو عِيسَى:‏‏‏‏ هَذَا حَدِيثٌ حَسَنٌ. وَالْعَمَلُ عَلَى هَذَا الْحَدِيثِ عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ يَسْتَحِبُّونَ أَنْ يَخْرُجَ الرَّجُلُ إِلَى الْعِيدِ مَاشِيًا وَأَنْ يَأْكُلَ شَيْئًا قَبْلَ أَنْ يَخْرُجَ لِصَلَاةِ الْفِطْرِ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَيُسْتَحَبُّ أَنْ لَا يَرْكَبَ إِلَّا مِنْ عُذْرٍ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "6",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 161,
				"chapterNumber": "6",
				"chapterEnglish": "The Book on the Two Eids",
				"chapterUrdu": "عیدین کے احکام و مسائل",
				"chapterArabic": "أَبْوَابُ الْعِيدَيْنِ عَنْ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15668,
			"hadithNumber": "544",
			"englishNarrator": "",
			"hadithEnglish": "Ibn Umar narrated: I traveled with the Prophet, Abu Bakr, Umar, and Uthman; they would pray Zuhr and Asr as two Rak'ah and two Rak'ah, not praying before them nor after them. And Ibn Umar said: If I was going to pray before it or after it then I would pray it complete.",
			"hadithUrdu": "میں نے نبی اکرم صلی اللہ علیہ وسلم ، ابوبکر، عمر اور عثمان رضی الله عنہم کے ساتھ سفر کیا، یہ لوگ ظہر اور عصر دو دو رکعت پڑھتے تھے۔ نہ اس سے پہلے کوئی نماز پڑھتے اور نہ اس کے بعد۔ عبداللہ بن عمر رضی الله عنہما کہتے ہیں: اگر میں اس سے پہلے یا اس کے بعد ( سنت ) نماز پڑھتا تو میں انہی ( فرائض ) کو پوری پڑھتا۔ امام ترمذی کہتے ہیں: ۱- ابن عمر رضی الله عنہما کی حدیث حسن غریب ہے، ہم اسے اس طرح یحییٰ بن سلیم ہی کی روایت سے جانتے ہیں، ۲- محمد بن اسماعیل بخاری کہتے ہیں: یہ حدیث بطریق: «عن عبيد الله بن عمر عن رجل من آل سراقة عن عبد الله بن عمر» بھی مروی ہے، ۳- اور عطیہ عوفی ابن عمر سے روایت کرتے ہیں کہ نبی اکرم صلی اللہ علیہ وسلم سفر میں نماز سے پہلے اور اس کے بعد نفل پڑھتے تھے ۱؎، ۴- اس باب میں عمر، علی، ابن عباس، انس، عمران بن حصین اور عائشہ رضی الله عنہم سے بھی احادیث آئی ہیں، ۵- نبی اکرم صلی اللہ علیہ وسلم سے یہ بھی ثابت ہے کہ آپ اور ابوبکر و عمر رضی الله عنہم سفر میں قصر کرتے تھے اور عثمان رضی الله عنہ بھی اپنی خلافت کے شروع میں قصر کرتے تھے، ۶- صحابہ کرام وغیرہم میں سے اکثر اہل علم کا عمل اسی پر ہے، ۷- اور عائشہ سے مروی ہے کہ وہ سفر میں نماز پوری پڑھتی تھیں ۲؎، ۸- اور عمل اسی پر ہے جو نبی اکرم صلی اللہ علیہ وسلم اور صحابہ کرام سے مروی ہے، یہی شافعی، احمد اور اسحاق بن راہویہ کا قول ہے، البتہ شافعی کہتے ہیں کہ سفر میں قصر کرنا رخصت ہے، اگر کوئی پوری نماز پڑھ لے تو جائز ہے۔",
			"urduNarrator": "عبداللہ بن عمر رضی الله عنہما کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ الْوَهَّابِ بْنُ عَبْدِ الْحَكَمِ الْوَرَّاقُ الْبَغْدَادِيُّ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنْ ابْنِ عُمَرَ، قَالَ:‏‏‏‏ سَافَرْتُ مَعَ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَبِي بَكْرٍ، ‏‏‏‏‏‏وَعُمَرَ، ‏‏‏‏‏‏وَعُثْمَانَ فَكَانُوا يُصَلُّونَ الظُّهْرَ وَالْعَصْرَ رَكْعَتَيْنِ رَكْعَتَيْنِ لَا يُصَلُّونَ قَبْلَهَا وَلَا بَعْدَهَا . وقَالَ عَبْدُ اللَّهِ:‏‏‏‏ لَوْ كُنْتُ مُصَلِّيًا قَبْلَهَا أَوْ بَعْدَهَا لَأَتْمَمْتُهَا، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عُمَرَ، ‏‏‏‏‏‏وَعَلِيٍّ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ، ‏‏‏‏‏‏وَأَنَسٍ، ‏‏‏‏‏‏وَعِمْرَانَ بْنِ حُصَيْنٍ، ‏‏‏‏‏‏وَعَائِشَةَ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ ابْنِ عُمَرَ حَدِيثٌ حَسَنٌ غَرِيبٌ. لَا نَعْرِفُهُ إِلَّا مِنْ حَدِيثِ يَحْيَى بْنِ سُلَيْمٍ مِثْلَ هَذَا. قَالَ مُحَمَّدُ بْنُ إِسْمَاعِيل:‏‏‏‏ وَقَدْ رُوِيَ هَذَا الْحَدِيثُ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏عَنْ رَجُلٍ مِنْ آلِ سُرَاقَةَ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَقَدْ رُوِيَ عَنْ عَطِيَّةَ الْعَوْفِيِّ، ‏‏‏‏‏‏عَنْ ابْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ يَتَطَوَّعُ فِي السَّفَرِ قَبْلَ الصَّلَاةِ وَبَعْدَهَا وَقَدْ صَحَّ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏أَنَّهُ كَانَ يَقْصُرُ فِي السَّفَرِ وَأَبُو بَكْرٍ، ‏‏‏‏‏‏وَعُمَرُ، ‏‏‏‏‏‏وَعُثْمَانُ صَدْرًا مِنْ خِلَافَتِهِ، ‏‏‏‏‏‏وَالْعَمَلُ عَلَى هَذَا عِنْدَ أَكْثَرِ أَهْلِ الْعِلْمِ مِنْ أَصْحَابِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَغَيْرِهِمْ، ‏‏‏‏‏‏وَقَدْ رُوِيَ عَنْ عَائِشَةَ أَنَّهَا كَانَتْ تُتِمُّ الصَّلَاةَ فِي السَّفَرِ وَالْعَمَلُ عَلَى مَا رُوِيَ عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَصْحَابِهِ. وَهُوَ قَوْلُ الشَّافِعِيِّ، ‏‏‏‏‏‏وَأَحْمَدَ، ‏‏‏‏‏‏وَإِسْحَاق. إِلَّا أَنَّ الشَّافِعِيَّ يَقُولُ:‏‏‏‏ التَّقْصِيرُ رُخْصَةٌ لَهُ فِي السَّفَرِ فَإِنْ أَتَمَّ الصَّلَاةَ أَجْزَأَ عَنْهُ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "7",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 162,
				"chapterNumber": "7",
				"chapterEnglish": "The Book on Traveling",
				"chapterUrdu": "سفر کے احکام و مسائل",
				"chapterArabic": "أَبْوَابُ السَّفَرِ",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15741,
			"hadithNumber": "617",
			"englishNarrator": "",
			"hadithEnglish": "Abu Dharr narrated: I came to the Messenger of Allah while he was sitting in the shade of the Ka'bah. He said: He saw me approaching and he said: 'They are lost on the Day of Judgment! By the Lord of the Ka'bah!' He said: I said t myself: Woe is me! Perhaps something has been revealed about me!' He said: So I said: 'Who are they, and may my father and mother be ransomed for you.' So the Messenger of Allah said: 'They are those who have much, except for who says like this, and this, and this and motioned with his hand to his front, and t his right, and to his left.' Then he said: 'By the One in Whose Hand is my soul! No man will die, leaving a camel or a cow that he did not pay Zakat on, except that it will come on the Day of Judgment larger and fatter than it was, they will tread him under their hooves and butt him with their horns, all of them; such that when the last of them has had a turn, the first returns to him, until he is judged before the people.'",
			"hadithUrdu": "میں رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، آپ کعبہ کے سائے میں بیٹھے تھے آپ نے مجھے آتا دیکھا تو فرمایا: ”رب کعبہ کی قسم! قیامت کے دن یہی لوگ خسارے میں ہوں گے“ ۲؎ میں نے اپنے جی میں کہا: شاید کوئی چیز میرے بارے میں نازل کی گئی ہو۔ میں نے عرض کیا: کون لوگ؟ میرے ماں باپ آپ پر قربان ہوں؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”یہی لوگ جو بہت مال والے ہیں سوائے ان لوگوں کے جو ایسا ایسا کرے، آپ نے اپنے دونوں ہاتھ سے لپ بھر کر اپنے سامنے اور اپنے دائیں اور اپنے بائیں طرف اشارہ کیا، پھر فرمایا: ”قسم ہے اس ذات کی جس کے ہاتھ میں میری جان ہے، جو بھی آدمی اونٹ اور گائے چھوڑ کر مرا اور اس نے اس کی زکاۃ ادا نہیں کی تو قیامت کے دن وہ اس سے زیادہ بھاری اور موٹے ہو کر آئیں گے جتنا وہ تھے ۳؎ اور اسے اپنی کھروں سے روندیں گے، اور اپنی سینگوں سے ماریں گے، جب ان کا آخری جانور بھی گزر چکے گا تو پھر پہلا لوٹا دیا جائے گا ۴؎ یہاں تک کہ لوگوں کے درمیان فیصلہ کر دیا جائے۔ امام ترمذی کہتے ہیں: ۱- ابوذر رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- اس باب میں ابوہریرہ رضی الله عنہ سے بھی اسی کے مثل روایت ہے، ۳- علی رضی الله عنہ سے مروی ہے کہ زکاۃ روک لینے والے پر لعنت کی گئی ہے ۵؎، ۴- ( یہ حدیث ) قبیصہ بن ہلب نے اپنے والد ہلب سے روایت کی ہے، نیز جابر بن عبداللہ اور عبداللہ بن مسعود رضی الله عنہم سے بھی احادیث آئی ہیں۔ ۵- ضحاک بن مزاحم کہتے ہیں کہ «الأكثرون» سے مراد وہ لوگ ہیں جن کے پاس دس ہزار ( درہم یا دینار ) ہوں۔",
			"urduNarrator": "ابوذر رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ التَّمِيمِيُّ الْكُوفِيُّ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ الْأَعْمَشِ، عَنْ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ:‏‏‏‏ جِئْتُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَهُوَ جَالِسٌ فِي ظِلِّ الْكَعْبَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَرَآنِي مُقْبِلًا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هُمُ الْأَخْسَرُونَ وَرَبِّ الْكَعْبَةِ يَوْمَ الْقِيَامَةِ قَالَ:‏‏‏‏ فَقُلْتُ:‏‏‏‏ مَا لِي لَعَلَّهُ أُنْزِلَ فِيَّ شَيْءٌ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قُلْتُ:‏‏‏‏ مَنْ هُمْ فِدَاكَ أَبِي وَأُمِّي، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ هُمُ الْأَكْثَرُونَ إِلَّا مَنْ قَالَ:‏‏‏‏ هَكَذَا وَهَكَذَا وَهَكَذَا ، ‏‏‏‏‏‏فَحَثَا بَيْنَ يَدَيْهِ وَعَنْ يَمِينِهِ وَعَنْ شِمَالِهِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ وَالَّذِي نَفْسِي بِيَدِهِ، ‏‏‏‏‏‏لَا يَمُوتُ رَجُلٌ فَيَدَعُ إِبِلًا أَوْ بَقَرًا لَمْ يُؤَدِّ زَكَاتَهَا، ‏‏‏‏‏‏إِلَّا جَاءَتْهُ يَوْمَ الْقِيَامَةِ أَعْظَمَ مَا كَانَتْ وَأَسْمَنَهُ، ‏‏‏‏‏‏تَطَؤُهُ بِأَخْفَافِهَا وَتَنْطَحُهُ بِقُرُونِهَا، ‏‏‏‏‏‏كُلَّمَا نَفِدَتْ أُخْرَاهَا عَادَتْ عَلَيْهِ أُولَاهَا حَتَّى يُقْضَى بَيْنَ النَّاسِ . وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ مِثْلُهُ، ‏‏‏‏‏‏وَعَنْ عَلِيِّ بْنِ أَبِي طَالِبٍ رَضِيَ اللَّهُ عَنْهُ:‏‏‏‏ لُعِنَ مَانِعُ الصَّدَقَةِ وَعَنْ قَبِيصَةَ بْنِ هُلْبٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ وَجَابِرِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏وَعَبْدِ اللَّهِ بْنِ مَسْعُودٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي ذَرٍّ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَاسْمُ أَبِي ذَرٍّ جُنْدَبُ بْنُ السَّكَنِ وَيُقَالُ ابْنُ جُنَادَةَ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مُنِيرٍ عَنْ عُبَيْدِ اللَّهِ بْنِ مُوسَى عَنْ سُفْيَانَ الثَّوْرِيِّ عَنْ حَكِيمِ بْنِ الدَّيْلَمِ عَنْ الضَّحَّاكِ بْنِ مُزَاحِمٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ الْأَكْثَرُونَ أَصْحَابُ عَشَرَةِ آلَافٍ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَعَبْدُ اللَّهِ بْنُ مُنِيرٍ مَرْوَزِيٌّ رَجُلٌ صَالِحٌ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "8",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 163,
				"chapterNumber": "8",
				"chapterEnglish": "The Book on Zakat",
				"chapterUrdu": "زکاۃ و صدقات کے احکام و مسائل",
				"chapterArabic": "كتاب الزكاة عن رسول الله صلى الله عليه وسلم",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15806,
			"hadithNumber": "682",
			"englishNarrator": "",
			"hadithEnglish": "Abu Hurairah narrated that : the Messenger of Allah said: On the first night of the month of Ramadan, the Shayatin are shackled, the jinns are restrained, the gates of the Fires are shut such that no gate among them would be opened. The gates of Paradise are opened such that no gate among them would be closed, and a caller calls: 'O seeker of the good; come near!' and 'O seeker of evil; stop! For there are those whom Allah frees from the Fire.' And that is every night.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”جب ماہ رمضان کی پہلی رات آتی ہے، تو شیطان اور سرکش جن ۱؎ جکڑ دیئے جاتے ہیں، جہنم کے دروازے بند کر دیئے جاتے ہیں، ان میں سے کوئی بھی دروازہ کھولا نہیں جاتا۔ اور جنت کے دروازے کھول دئیے جاتے ہیں، ان میں سے کوئی بھی دروازہ بند نہیں کیا جاتا، پکارنے والا پکارتا ہے: خیر کے طلب گار! آگے بڑھ، اور شر کے طلب گار! رک جا ۲؎ اور آگ سے اللہ کے بہت سے آزاد کئے ہوئے بندے ہیں ( تو ہو سکتا ہے کہ تو بھی انہیں میں سے ہو ) اور ایسا ( رمضان کی ) ہر رات کو ہوتا ہے“۔ امام ترمذی کہتے ہیں: اس باب میں عبدالرحمٰن بن عوف، ابن مسعود اور سلمان رضی الله عنہم سے بھی احادیث آئی ہیں۔",
			"urduNarrator": "ابوہریرہ رضی الله عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا أَبُو كُرَيْبٍ مُحَمَّدُ بْنُ الْعَلَاءِ بْنِ كُرَيْبٍ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ الْأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ إِذَا كَانَ أَوَّلُ لَيْلَةٍ مِنْ شَهْرِ رَمَضَانَ، ‏‏‏‏‏‏صُفِّدَتِ الشَّيَاطِينُ وَمَرَدَةُ الْجِنِّ، ‏‏‏‏‏‏وَغُلِّقَتْ أَبْوَابُ النَّارِ فَلَمْ يُفْتَحْ مِنْهَا بَاب، ‏‏‏‏‏‏وَفُتِّحَتْ أَبْوَابُ الْجَنَّةِ فَلَمْ يُغْلَقْ مِنْهَا بَاب، ‏‏‏‏‏‏وَيُنَادِي مُنَادٍ يَا بَاغِيَ الْخَيْرِ أَقْبِلْ، ‏‏‏‏‏‏وَيَا بَاغِيَ الشَّرِّ أَقْصِرْ، ‏‏‏‏‏‏وَلِلَّهِ عُتَقَاءُ مِنَ النَّارِ وَذَلكَ كُلُّ لَيْلَةٍ . قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، ‏‏‏‏‏‏وَابْنِ مَسْعُودٍ، ‏‏‏‏‏‏وَسَلْمَانَ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "9",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 164,
				"chapterNumber": "9",
				"chapterEnglish": "The Book on Fasting",
				"chapterUrdu": "روزوں کے احکام و مسائل",
				"chapterArabic": "كتاب الصوم عن رسول الله صلى الله عليه وسلم",
				"bookSlug": "al-tirmidhi"
			}
		},
		{
			"id": 15933,
			"hadithNumber": "809",
			"englishNarrator": "",
			"hadithEnglish": "Sa'eed bin Abi Sa'eed Al Maqbury narrated: Abu Shuraih Al-Adawi said tat when Amr bin Sa'eed was sending troops to Makkah he said to him: 'O Amr! Allow me to tell you what the Messenger of Allah said on the day following the Conquest of Makkah. My ears heard it, my heard understood it thoroughly, and with my own eyes, I saw the Prophet when he - after glorifying and praising Allah - said: Indeed Allah, the Most High, made Makkah a sanctuary, it was not made a sanctuary by the people. So it is not lawful for a man who believes in Allah and the Last Day to shed blood it, nor to cut down its trees. If anybody tries to use the Messenger of Allah to make an excuse for fighting in it, then say to him: 'Indeed Allah permitted His Messenger and He did not permit you.' Allah only allowed it for me for a few hours of one day, and today its sanctity has returned as it was before. So let the one who is present convey to the one who is absent. Abu Shuraih was asked: What was Amr bin Sa'eeds reply to you? He said: I am more knowledgeable about that than you Abu Shuraih! The Haram does not give protection to a disobedient person, nor a person fleeing for murder, nor fleeing for (Kharbah) lawlessness.",
			"hadithUrdu": "انہوں نے عمرو بن سعید ۲؎ سے - جب وہ مکہ کی طرف ( عبداللہ بن زبیر سے قتال کے لیے ) لشکر روانہ کر رہے تھے کہا: اے امیر! مجھے اجازت دیجئیے کہ میں آپ سے ایک ایسی بات بیان کروں جسے رسول اللہ صلی اللہ علیہ وسلم نے فتح مکہ کے دوسرے دن فرمایا، میرے کانوں نے اسے سنا، میرے دل نے اسے یاد رکھا اور میری آنکھوں نے آپ کو دیکھا، جب آپ نے یہ حدیث بیان فرمائی تو اللہ کی حمد و ثنا بیان کی پھر فرمایا: ”مکہ ( میں جنگ و جدال کرنا ) اللہ نے حرام کیا ہے۔ لوگوں نے حرام نہیں کیا ہے، لہٰذا کسی شخص کے لیے جو اللہ اور یوم آخرت پر ایمان رکھتا ہو، یہ جائز نہیں کہ وہ اس میں خون بہائے، یا اس کا کوئی درخت کاٹے۔ اگر کوئی اس میں رسول اللہ صلی اللہ علیہ وسلم کے قتال کو دلیل بنا کر ( قتال کا ) جواز نکالے تو اس سے کہو: اللہ نے اپنے رسول صلی اللہ علیہ وسلم کو اس کی اجازت دی تھی، تمہیں نہیں دی ہے۔ تو مجھے بھی دن کے کچھ وقت کے لیے آج اجازت تھی، آج اس کی حرمت ویسے ہی لوٹ آئی ہے جیسے کل تھی۔ جو لوگ موجود ہیں وہ یہ بات ان لوگوں کو پہنچا دیں جو موجود نہیں ہیں“، ابوشریح سے پوچھا گیا: اس پر عمرو بن سعید نے آپ سے کیا کہا؟ کہا: اس نے مجھ سے کہا: ابوشریح! میں یہ بات آپ سے زیادہ اچھی طرح جانتا ہوں، حرم مکہ کسی نافرمان ( یعنی باغی ) کو پناہ نہیں دیتا اور نہ کسی کا خون کر کے بھاگنے والے کو اور نہ چوری کر کے بھاگنے والے کو۔ امام ترمذی کہتے ہیں: ۱- ابوشریح رضی الله عنہ کی حدیث حسن صحیح ہے، ۲- ابوشریح خزاعی کا نام خویلد بن عمرو ہے۔ اور یہی عدوی اور کعبی یہی ہیں، ۳- اس باب میں ابوہریرہ اور ابن عباس رضی الله عنہم سے بھی احادیث آئی ہیں، ۴- «ولا فارا بخربة» کی بجائے «ولا فارا بخزية» زائے منقوطہٰ اور یاء کے ساتھ بھی مروی ہے، ۵- اور «ولا فارا بخربة» میں «خربہ» کے معنی گناہ اور جرم کے ہیں یعنی جس نے کوئی جرم کیا یا خون کیا پھر حرم میں پناہ لی تو اس پر حد جاری کی جائے گی۔",
			"urduNarrator": "ابوشریح عدوی رضی الله عنہ سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ، حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ الْمَقْبُرِيِّ، عَنْ أَبِي شُرَيْحٍ الْعَدَوِيِّ، أَنَّهُ قَالَ لِعَمْرِو بْنِ سَعِيدٍ وَهُوَ يَبْعَثُ الْبُعُوثَ إِلَى مَكَّةَ:‏‏‏‏ ائْذَنْ لِي أَيُّهَا الْأَمِيرُ أُحَدِّثْكَ قَوْلًا قَامَ بِهِ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الْغَدَ مِنْ يَوْمِ الْفَتْحِ سَمِعَتْهُ أُذُنَايَ وَوَعَاهُ قَلْبِي وَأَبْصَرَتْهُ عَيْنَايَ حِينَ تَكَلَّمَ بِهِ أَنَّهُ حَمِدَ اللَّهَ وَأَثْنَى عَلَيْهِ، ‏‏‏‏‏‏ثُمَّ قَالَ:‏‏‏‏ إِنَّ مَكَّةَ حَرَّمَهَا اللَّهُ وَلَمْ يُحَرِّمْهَا النَّاسُ، ‏‏‏‏‏‏وَلَا يَحِلُّ لِامْرِئٍ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الْآخِرِ أَنْ يَسْفِكَ فِيهَا دَمًا أَوْ يَعْضِدَ بِهَا شَجَرَةً، ‏‏‏‏‏‏فَإِنْ أَحَدٌ تَرَخَّصَ بِقِتَالِ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِيهَا، ‏‏‏‏‏‏فَقُولُوا لَهُ:‏‏‏‏ إِنَّ اللَّهَ أَذِنَ لِرَسُولِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ يَأْذَنْ لَكَ، ‏‏‏‏‏‏وَإِنَّمَا أَذِنَ لِي فِيهِ سَاعَةً مِنَ النَّهَارِ، ‏‏‏‏‏‏وَقَدْ عَادَتْ حُرْمَتُهَا الْيَوْمَ كَحُرْمَتِهَا بِالْأَمْسِ وَلْيُبَلِّغْ الشَّاهِدُ الْغَائِبَ . فَقِيلَ لِأَبِي شُرَيْحٍ:‏‏‏‏ مَا قَالَ لَكَ عَمْرٌو ؟ قَالَ:‏‏‏‏ أَنَا أَعْلَمُ مِنْكَ بِذَلِكَ يَا أَبَا شُرَيْحٍ إِنَّ الْحَرَمَ لَا يُعِيذُ عَاصِيًا وَلَا فَارًّا بِدَمٍ وَلَا فَارًّا بِخَرْبَةٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ وَيُرْوَى وَلَا فَارًّا بِخِزْيَةٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَفِي الْبَاب عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏وَابْنِ عَبَّاسٍ. قَالَ أَبُو عِيسَى:‏‏‏‏ حَدِيثُ أَبِي شُرَيْحٍ حَدِيثٌ حَسَنٌ صَحِيحٌ، ‏‏‏‏‏‏وَأَبُو شُرَيْحٍ الْخُزَاعِيُّ اسْمُهُ خُوَيْلِدُ بْنُ عَمْرٍو وَهُوَ الْعَدَوِيُّ وَهُوَ الْكَعْبِيُّ، ‏‏‏‏‏‏وَمَعْنَى قَوْلِهِ:‏‏‏‏ وَلَا فَارًّا بِخَرْبَةٍ يَعْنِي الْجِنَايَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ مَنْ جَنَى جِنَايَةً أَوْ أَصَابَ دَمًا ثُمَّ لَجَأَ إِلَى الْحَرَمِ، ‏‏‏‏‏‏فَإِنَّهُ يُقَامُ عَلَيْهِ الْحَدُّ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "10",
			"bookSlug": "al-tirmidhi",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 4,
				"bookName": "Jami' Al-Tirmidhi",
				"writerName": "Abu `Isa Muhammad at-Tirmidhi",
				"aboutWriter": null,
				"writerDeath": "279",
				"bookSlug": "al-tirmidhi"
			},
			"chapter": {
				"id": 165,
				"chapterNumber": "10",
				"chapterEnglish": "The Book on Hajj",
				"chapterUrdu": "حج کے احکام و مناسک",
				"chapterArabic": "كتاب الحج عن رسول الله صلى الله عليه وسلم",
				"bookSlug": "al-tirmidhi"
			}
		}
	],
	"abu-dawood": [
		{
			"id": 19081,
			"hadithNumber": "1",
			"englishNarrator": "Narrated Mughirah ibn Shubah:",
			"hadithEnglish": "When the Prophet صلی ‌اللہ ‌علیہ ‌وسلم went (outside) to relieve himself, he went to a far-off place.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم جب قضائے حاجت ( یعنی پیشاب اور پاخانہ ) کے لیے جاتے تو دور تشریف لے جاتے تھے۔",
			"urduNarrator": "ہم سے عبداللہ بن مسلمہ بن قعنب القنبی نے بیان کیا، ان سے عبد العزیز نے، یعنی ابن محمد نے، ہم سے محمد کی سند سے، ابن عمرو نے ابو سلمہ کی سند سے بیان کیا, مغیرہ بن شعبہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ بْنِ قَعْنَبٍ الْقَعْنَبِيُّ، حَدَّثَنَا عَبْدُ الْعَزِيزِ يَعْنِي ابْنَ مُحَمَّدٍ، عَنْ مُحَمَّدٍ يَعْنِي ابْنَ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنِ الْمُغِيرَةِ بْنِ شُعْبَةَ، أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ كَانَ إِذَا ذَهَبَ الْمَذْهَبَ أَبْعَدَ .",
			"headingArabic": "التَّخَلِّي عِنْدَ قَضَاءِ الْحَاجَةِ",
			"headingUrdu": "اپنے آپ کو راحت دیتے وقت تنہائی",
			"headingEnglish": "Seclusion While Relieving Oneself",
			"chapterId": "1",
			"bookSlug": "abu-dawood",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 206,
				"chapterNumber": "1",
				"chapterEnglish": "Purification (Kitab Al-Taharah)",
				"chapterUrdu": "طہارت کے مسائل",
				"chapterArabic": "كتاب الطهارة",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 19471,
			"hadithNumber": "391",
			"englishNarrator": "Talhah bin Ubaid Allah رضی اللہ عنہ said:",
			"hadithEnglish": "A man from among the people of Najd with disheveled hair came to the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم . The humming sound of his voice could be heard but what he was suing could not be understood he came near and it was then known that he was asking about Islam. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: Five times of prayer each day and night: He asked: Must I observe any more than them ? He replied: No, unless you do it voluntarily. He (Talhah) said that the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم mentioned fasting during the month of Ramadan. He asked: Must I observe anything else ? He replied: No, unless you do it voluntarily. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم mentioned Zakat to him. He asked: Must I pay anything else ? He replied: No, unless you do it voluntarily. The man then turned away saying: I swear any Allah, I shall not add anything to this or fall short of it. The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم said: The man will be successful if he speaks truth.",
			"hadithUrdu": "اہل نجد کا ایک شخص رسول اللہ صلی اللہ علیہ وسلم کے پاس آیا، جس کے بال پراگندہ تھے، اس کی آواز کی گنگناہٹ تو سنی جاتی تھی لیکن بات سمجھ میں نہیں آتی تھی کہ وہ کیا کہہ رہا ہے، یہاں تک کہ وہ قریب آیا، تب معلوم ہوا کہ وہ اسلام کے متعلق پوچھ رہا ہے، تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ( اسلام ) دن رات میں پانچ وقت کی نماز پڑھنی ہے ، اس نے پوچھا: ان کے علاوہ اور کوئی نماز مجھ پر واجب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں ۱؎ إلا یہ کہ تم نفل پڑھو ۔ رسول اللہ صلی اللہ علیہ وسلم نے اس سے ماہ رمضان کے روزے کا ذکر کیا، اس نے پوچھا: اس کے سوا کوئی اور بھی روزے مجھ پر فرض ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، إلا یہ کہ تم نفلی روزے رکھو ۔ آپ صلی اللہ علیہ وسلم نے اس سے زکاۃ کا ذکر کیا، اس نے پوچھا: اس کے علاوہ کوئی اور بھی صدقہ مجھ پر واجب ہے؟ آپ صلی اللہ علیہ وسلم نے فرمایا: نہیں، إلایہ کہ تم نفلی صدقہ کرو ۔ پھر وہ شخص پیٹھ پھیر کر یہ کہتے ہوئے چلا: قسم اللہ کی! میں نہ اس سے زیادہ کروں گا اور نہ کم، آپ صلی اللہ علیہ وسلم نے فرمایا: بامراد رہا اگر اس نے سچ کہا ۔",
			"urduNarrator": "ہم سے عبداللہ بن مسلمہ نے مالک کی سند سے، اپنے چچا ابو سہیل بن مالک سے، اپنے والد سے, طلحہ بن عبیداللہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ مَسْلَمَةَ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ عَمِّهِ أَبِي سُهَيْلِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ طَلْحَةَ بْنَ عُبَيْدِ اللَّهِ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ جَاءَ رَجُلٌ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ مِنْ أَهْلِ نَجْدٍ ثَائِرَ الرَّأْسِ يُسْمَعُ دَوِيُّ صَوْتِهِ وَلَا يُفْقَهُ مَا يَقُولُ حَتَّى دَنَا، ‏‏‏‏‏‏فَإِذَا هُوَ يَسْأَلُ عَنِ الْإِسْلَامِ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ خَمْسُ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَلْ عَلَيَّ غَيْرُهُنَّ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏إِلَّا أَنْ تَطَّوَّعَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صِيَامَ شَهْرِ رَمَضَانَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَلْ عَلَيَّ غَيْرُهُ ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏إِلَّا أَنْ تَطَّوَّعَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ وَذَكَرَ لَهُ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ الصَّدَقَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَهَلْ عَلَيَّ غَيْرُهَا ؟ قَالَ:‏‏‏‏ لَا، ‏‏‏‏‏‏إِلَّا أَنْ تَطَّوَّعَ، ‏‏‏‏‏‏فَأَدْبَرَ الرَّجُلُ وَهُوَ يَقُولُ:‏‏‏‏ وَاللَّهِ لَا أَزِيدُ عَلَى هَذَا وَلَا أَنْقُصُ، ‏‏‏‏‏‏فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أَفْلَحَ إِنْ صَدَقَ .",
			"headingArabic": "الصَّلاَةِ مِنَ الإِسْلاَمِ",
			"headingUrdu": "نماز کی ادائیگی کا فرض",
			"headingEnglish": "The Obligation To Perform The Salat (Prayers)",
			"chapterId": "2",
			"bookSlug": "abu-dawood",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 207,
				"chapterNumber": "2",
				"chapterEnglish": "Prayer (Kitab Al-Salat)",
				"chapterUrdu": "نماز کے احکام و مسائل",
				"chapterArabic": "كتاب الصلاة",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20241,
			"hadithNumber": "1161",
			"englishNarrator": "Abbad bin Tamim (al-Muzini) رضی اللہ عنہ reported on the authority of his uncle:",
			"hadithEnglish": "The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم took the people out (to the place of prayer) and prayed for rain. He led them in two rak'ahs of prayer in the course of which he recited from the Quran in a loud voice. He turned around his cloak and raised his hands, prayed for rain and faced the qiblah",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم لوگوں کے ساتھ نماز استسقا کے لیے نکلے، تو آپ نے انہیں دو رکعت پڑھائی، جن میں بلند آواز سے قرأت کی اور اپنی چادر  اپنے سر پر پھیری اور قبلہ رخ ہو کر بارش کے لیے دونوں ہاتھ اٹھا کر دعا کی ۔",
			"urduNarrator": "ہم سے احمد بن محمد بن ثابت المروازی نے بیان کیا، ہم سے عبد الرزاق نے بیان کیا، انہیں زہری نے عباد بن تمیم سے اپنے چچا کی سند سے بیان کیا",
			"hadithArabic": "حَدَّثَنَا أَحْمَدُ بْنُ مُحَمَّدِ بْنِ ثَابِتٍ الْمَرْوَزِيُّ، ‏‏‏‏‏‏حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ عَبَّادِ بْنِ تَمِيمٍ، ‏‏‏‏‏‏عَنْ عَمِّهِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ خَرَجَ بِالنَّاسِ لِيَسْتَسْقِيَ، ‏‏‏‏‏‏فَصَلَّى بِهِمْ رَكْعَتَيْنِ جَهَرَ بِالْقِرَاءَةِ فِيهِمَا، ‏‏‏‏‏‏وَحَوَّلَ رِدَاءَهُ وَرَفَعَ يَدَيْهِ فَدَعَا وَاسْتَسْقَى وَاسْتَقْبَلَ الْقِبْلَةَ .",
			"headingArabic": "جُمَّاعِ أَبْوَابِ صَلاةِ الِاسْتِسْقَاءِ وَتَفْرِيعِهَا",
			"headingUrdu": "صلاۃ الاستسقاء سے متعلق ابواب کا مجموعہ",
			"headingEnglish": "Collection Of Chapters Regarding Salat Al-Istisqa'",
			"chapterId": "3",
			"bookSlug": "abu-dawood",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 208,
				"chapterNumber": "3",
				"chapterEnglish": "The Book Of The Prayer For Rain (Kitab al-Istisqa')",
				"chapterUrdu": "نماز استسقاء کے احکام ومسائل",
				"chapterArabic": "كتاب الاستسقاء",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20278,
			"hadithNumber": "1198",
			"englishNarrator": "Narrated Aishah, Ummul Muminin رضی اللہ عنہا :",
			"hadithEnglish": "The prayer was prescribed as consisting of two rak'ahs both when one was resident and when travelling. The prayer while travelling was left according to the original prescription and the prayer of one who was resident was enhanced.",
			"hadithUrdu": "سفر اور حضر دونوں میں دو دو رکعت نماز فرض کی گئی تھی، پھر سفر کی نماز ( حسب معمول ) برقرار رکھی گئی اور حضر کی نماز میں اضافہ کر دیا گیا ۔",
			"urduNarrator": "ہم سے القعْنبی نے مالک کی سند سے، صالح بن کیسان کی سند سے، عروہ بن زبیر کی سند سے بیان کیا, ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
			"hadithArabic": "حَدَّثَنَا الْقَعْنَبِيُّ، ‏‏‏‏‏‏عَنْ مَالِكٍ، ‏‏‏‏‏‏عَنْ صَالِحِ بْنِ كَيْسَانَ، ‏‏‏‏‏‏عَنْ عُرْوَةَ بْنِ الزُّبَيْرِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ فُرِضَتِ الصَّلَاةُ رَكْعَتَيْنِ، ‏‏‏‏‏‏رَكْعَتَيْنِ فِي الْحَضَرِ وَالسَّفَرِ، ‏‏‏‏‏‏فَأُقِرَّتْ صَلَاةُ السَّفَرِ، ‏‏‏‏‏‏وَزِيدَ فِي صَلَاةِ الْحَضَرِ .",
			"headingArabic": "صَلاَةِ الْمُسَافِرِ",
			"headingUrdu": "مسافر کی دعا",
			"headingEnglish": "The Prayer Of The Traveler",
			"chapterId": "4",
			"bookSlug": "abu-dawood",
			"volume": "1",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 209,
				"chapterNumber": "4",
				"chapterEnglish": "Prayer (Kitab Al-Salat): Detailed Rules of Law about the Prayer during Journey",
				"chapterUrdu": "نماز سفر کے احکام و مسائل",
				"chapterArabic": "كتاب صلاة السفر",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20330,
			"hadithNumber": "1250",
			"englishNarrator": "Narrated Umm Habibah رضی اللہ عنہا :",
			"hadithEnglish": "The Prophet صلی ‌اللہ ‌علیہ ‌وسلم as saying: If anyone prays in a day and a night twelve rak'ahs voluntarily (supererogatory prayer), a house will be built from him in Paradise on account of these (rak'ahs).",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا: جو شخص ایک دن میں بارہ رکعتیں نفل پڑھے گا تو اس کے بدلے اس کے لیے جنت میں گھر بنایا جائے گا ۔",
			"urduNarrator": "ہم سے محمد بن عیسیٰ نے بیان کیا، ہم سے ابن علیہ نے بیان کیا، ہم سے داؤد بن ابی ہند نے بیان کیا، مجھ سے نعمان بن سلیم نے بیان کیا، ان سے عمرو بن اوس نے، عنبسہ بن ابی سفیان سے, ام المؤمنین ام حبیبہ رضی اللہ عنہا کہتی ہیں کہ",
			"hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عِيسَى، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ عُلَيَّةَ، ‏‏‏‏‏‏حَدَّثَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، ‏‏‏‏‏‏حَدَّثَنِي النُّعْمَانُ بْنُ سَالِمٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ أَوْسٍ، ‏‏‏‏‏‏عَنْ عَنْبَسَةَ بْنِ أَبِي سُفْيَانَ، ‏‏‏‏‏‏عَنْ أُمِّ حَبِيبَةَ، ‏‏‏‏‏‏قَالَتْ:‏‏‏‏ قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَنْ صَلَّى فِي يَوْمٍ ثِنْتَيْ عَشْرَةَ رَكْعَةً تَطَوُّعًا بُنِيَ لَهُ بِهِنَّ بَيْتٌ فِي الْجَنَّةِ .",
			"headingArabic": "التَّطَوُّعِ وَرَكَعَاتِ السُّنَّةِ",
			"headingUrdu": "نفلی اور سنت نمازوں کے بارے میں",
			"headingEnglish": "Regarding The Voluntary And Sunnah Prayers",
			"chapterId": "5",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 210,
				"chapterNumber": "5",
				"chapterEnglish": "Prayer (Kitab Al-Salat): Voluntary Prayers",
				"chapterUrdu": "نوافل اور سنتوں کے احکام و مسائل",
				"chapterArabic": "كتاب التطوع",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20451,
			"hadithNumber": "1371",
			"englishNarrator": "Narrated Abu Hurairah رضی اللہ عنہ :",
			"hadithEnglish": "The Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم used to commend prayer at night during Ramadan, but did not command it as duty. He would say: If anyone prays during the night in Ramadan because of faith and seeking his reward from Allah, his previous sins will be forgiven for him. When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم died, this was the practice, and it continued thus during Abu Bakr's caliphate and early part of Umar's. Abu Dawud said: This tradition has been transmitted by 'Uqail, Yunus, and Abu Uwais in like manner. The version of 'Uqail goes: He who fasts during Ramadan and prays during the night.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم بغیر تاکیدی حکم دئیے رمضان کے قیام کی ترغیب دلاتے، پھر فرماتے: جس نے رمضان میں ایمان کی حالت میں اور ثواب کی نیت سے قیام کیا تو اس کے تمام سابقہ گناہ معاف کر دئیے جائیں گے ، رسول اللہ صلی اللہ علیہ وسلم کی وفات تک معاملہ اسی طرح رہا، پھر ابوبکر رضی اللہ عنہ کی خلافت اور عمر رضی اللہ عنہ کی خلافت کے شروع تک یہی معاملہ رہا ۱؎۔ ابوداؤد کہتے ہیں: اور اسی طرح عقیل، یونس اور ابواویس نے «من قام رمضان» کے الفاظ کے ساتھ روایت کیا ہے اور عقیل کی روایت میں «من صام رمضان وقامه» ہے۔",
			"urduNarrator": "ہم سے حسن بن علی اور محمد بن متوکل نے بیان کیا، کہا ہم سے عبدالرزاق نے بیان کیا، کہا کہ ہمیں معمر نے خبر دی, حسن نے اپنی حدیث میں، اور مالک بن انس نے زہری سے، وہ ابو سلمہ سے, ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ، ‏‏‏‏‏‏وَمُحَمَّدُ بْنُ الْمُتَوَكِّلِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏أَخْبَرَنَا مَعْمَرٌ، ‏‏‏‏‏‏قَالَ الْحَسَنُ فِي حَدِيثِهِ، ‏‏‏‏‏‏وَمَالِكُ بْنُ أَنَسٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُرَغِّبُ فِي قِيَامِ رَمَضَانَ مِنْ غَيْرِ أَنْ يَأْمُرَهُمْ بِعَزِيمَةٍ، ‏‏‏‏‏‏ثُمَّ يَقُولُ:‏‏‏‏ مَنْ قَامَ رَمَضَانَ إِيمَانًا وَاحْتِسَابًا غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ ، ‏‏‏‏‏‏فَتُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَالْأَمْرُ عَلَى ذَلِكَ، ‏‏‏‏‏‏ثُمَّ كَانَ الْأَمْرُ عَلَى ذَلِكَ فِي خِلَافَةِ أَبِي بَكْرٍ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏وَصَدْرًا مِنْ خِلَافَةِ عُمَرَ رَضِيَ اللَّهُ عَنْهُ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَكَذَا رَوَاهُ عُقَيْلٌ، ‏‏‏‏‏‏وَيُونُسُ، ‏‏‏‏‏‏وَأَبُو أُوَيْسٍ مَنْ قَامَ رَمَضَانَ ، ‏‏‏‏‏‏وَرَوَى عُقَيْلٌ مَنْ صَامَ رَمَضَانَ وَقَامَهُ .",
			"headingArabic": "رمضان کے مہینے میں قیام (رات کی نماز میں) کے بارے میں",
			"headingUrdu": "رمضان کے مہینے میں قیام (رات کی نماز میں) کے بارے میں",
			"headingEnglish": "Regarding Standing (In Voluntary Night Prayer) During The Month Of Ramadan",
			"chapterId": "6",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 211,
				"chapterNumber": "6",
				"chapterEnglish": "Prayer (Kitab Al-Salat): Detailed Injunctions about Ramadan",
				"chapterUrdu": "ماہ رمضان المبارک کے احکام و مسائل",
				"chapterArabic": "كتاب شهر رمضان",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20481,
			"hadithNumber": "1401",
			"englishNarrator": "Narrated Amr Ibn al-As رضی اللہ عنہ :",
			"hadithEnglish": "The Prophet صلی ‌اللہ ‌علیہ ‌وسلم taught me fifteen prostrations while reciting the Quran, including three in al-Mufassal and two in Surah al-Hajj. Abu Dawud said: Abu al-Darda  رضی اللہ عنہ has reported eleven prostrations from the Prophet صلی ‌اللہ ‌علیہ ‌وسلم, but chain of this tradition is weak.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے ان کو قرآن مجید میں ( ۱۵ ) سجدے ۱؎ پڑھائے: ان میں سے تین مفصل میں ۲؎ اور دو سورۃ الحج میں ۳؎۔ ابوداؤد کہتے ہیں: ابوالدرداء رضی اللہ عنہ نے نبی اکرم صلی اللہ علیہ وسلم سے گیارہ سجدے نقل کئے ہیں، لیکن اس کی سند کمزور ہے۔",
			"urduNarrator": "ہم سے محمد بن عبد الرحیم بن برقی نے بیان کیا، ہم سے ابن ابی مریم نے بیان کیا، انہیں نافع بن یزید نے خبر دی، انہیں حارث بن سعید عتقی نے، بنو عبد کلال کے عبداللہ بن منین کی سند سے, عمرو بن العاص رضی اللہ عنہ سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحِيمِ بْنِ الْبَرْقِيِّ، ‏‏‏‏‏‏حَدَّثَنَا ابْنُ أَبِي مَرْيَمَ، ‏‏‏‏‏‏أَخْبَرَنَا نَافِعُ بْنُ يَزِيدَ، ‏‏‏‏‏‏عَنْ الْحَارِثِ بْنِ سَعِيدٍ الْعُتَقِيِّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ مُنَيْنٍ مِنْ بَنِي عَبْدِ كُلَالٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْعَاصِ، ‏‏‏‏‏‏أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ أَقْرَأَهُ خَمْسَ عَشْرَةَ سَجْدَةً فِي الْقُرْآنِ، ‏‏‏‏‏‏مِنْهَا ثَلَاثٌ فِي الْمُفَصَّلِ، ‏‏‏‏‏‏وَفِي سُورَةِ الْحَجِّ سَجْدَتَانِ . قَالَ أَبُو دَاوُد:‏‏‏‏ رُوِيَ عَنْ أَبِي الدَّرْدَاءِ، ‏‏‏‏‏‏عَنِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏ إِحْدَى عَشْرَةَ سَجْدَةً وَإِسْنَادُهُ وَاهٍ.",
			"headingArabic": "تَفْرِيعِ أَبْوَابِ السُّجُودِ وَكَمْ سَجْدَةٍ فِي الْقُرْآنِ",
			"headingUrdu": "قرآن میں کتنے مقامات ہیں جہاں سجدہ ضروری ہے؟",
			"headingEnglish": "How Many Places Are There In The Qur'an Where Prostration Is Required",
			"chapterId": "7",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Da`eef",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 212,
				"chapterNumber": "7",
				"chapterEnglish": "Prayer (Kitab Al-Salat): Prostration while reciting the Qur'an",
				"chapterUrdu": "سجدہ تلاوت کے احکام و مسائل",
				"chapterArabic": "كتاب سجود القرآن",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20496,
			"hadithNumber": "1416",
			"englishNarrator": "Narrated Ali Ibn Abu Talib رضی اللہ عنہ :",
			"hadithEnglish": "The Prophet صلی ‌اللہ ‌علیہ ‌وسلم said: Allah is single (witr) and loves what is single, so observe the witr, you who follow the Quran.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: ”اے قرآن والو! وتر پڑھا کرو اس لیے کہ اللہ وتر (طاق) ہے اور وتر کو پسند کرتا ہے“۔",
			"urduNarrator": "ہم سے ابراہیم بن موسیٰ نے بیان کیا، کہا ہم سے عیسیٰ نے بیان کیا، انہوں نے زکریا سے، ابواسحاق سے، عاصم کی سند سے, علی رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا إِبْرَاهِيمُ بْنُ مُوسَى، ‏‏‏‏‏‏أَخْبَرَنَا عِيسَى، ‏‏‏‏‏‏عَنْ زَكَرِيَّا، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاقَ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ عَلِيٍّ رَضِيَ اللَّهُ عَنْهُ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا أَهْلَ الْقُرْآنِ، ‏‏‏‏‏‏أَوْتِرُوا فَإِنَّ اللَّهَ وِتْرٌ يُحِبُّ الْوِتْرَ .",
			"headingArabic": "اسْتِحْبَابِ الْوِتْرِ",
			"headingUrdu": "وتر پڑھنے کی سفارش",
			"headingEnglish": "The Recommendation To Pray Witr",
			"chapterId": "8",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Da`eef",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 213,
				"chapterNumber": "8",
				"chapterEnglish": "Prayer (Kitab Al-Salat): Detailed Injunctions about Witr",
				"chapterUrdu": "وتر کے فروعی احکام و مسائل",
				"chapterArabic": "كتاب الوتر",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20636,
			"hadithNumber": "1556",
			"englishNarrator": "Abu Hurairah رضی اللہ عنہ said:",
			"hadithEnglish": "When the Messenger of Allah صلی ‌اللہ ‌علیہ ‌وسلم died and Abu Bakr رضی اللہ عنہ was made his successor after him and certain Arab clans apostatized. Umar bin Al Khattab رضی اللہ عنہ said to Abu Bakr رضی اللہ عنہ How can you fight with the people until they say “There is no God but Allah” so whoever says “There is no God but Allah”, he has protected his property and his person from me except for what is due from him, and his reckoning is left to Allah. Abu Bak رضی اللہ عنہ replied I swear by Allah that I will certainly fight with those who make a distinction between prayer and zakat, for zakat is what is due from property. I swear by Allah that if they were to refuse me a rope of camel (or a female kid, according to another version)which they used to pay the Messenger of Allah, I will fight with them over the refusal of it. Umar bin Al Khattab رضی اللہ عنہ said I swear by Allah, I clearly saw Allah had made Abu Bakr رضی اللہ عنہ feel justified in tighting and I recognized that it was right. Abu Dawud said This tradition has been transmitted by Rabah bin Zaid from Mamar and Al Zaubaidi from Al Zuhri has “If they were to refuse me a female kid. ” The version transmitted by ‘Anbasah from Yunus on the authority of Al Zuhri has “a female kid”.",
			"hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہو گئی، آپ کے بعد ابوبکر رضی اللہ عنہ خلیفہ بنائے گئے اور عربوں میں سے جن کو کافر ۱؎ ہونا تھا کافر ہو گئے تو عمر بن خطاب رضی اللہ عنہ نے ابوبکر رضی اللہ عنہ سے کہا: آپ لوگوں سے کیوں کر لڑیں گے جب کہ رسول اللہ صلی اللہ علیہ وسلم نے فرمایا ہے: مجھے حکم دیا گیا ہے کہ میں لوگوں سے جنگ کروں یہاں تک کہ وہ«لا إله إلا الله» کہیں، لہٰذا جس نے «لا إله إلا الله» کہا اس نے مجھ سے اپنا مال اور اپنی جان محفوظ کر لی سوائے حق اسلام کے ۲؎ اور اس کا حساب اللہ تعالیٰ پر ہے؟ ، ابوبکر رضی اللہ عنہ نے کہا: اللہ کی قسم! میں ہر اس شخص سے جنگ کروں گا جو نماز اور زکاۃ کے درمیان تفریق ۳؎ کرے گا، اس لیے کہ زکاۃ مال کا حق ہے، قسم اللہ کی، یہ لوگ جس قدر رسول اللہ صلی اللہ علیہ وسلم کو دیتے تھے اگر اس میں سے اونٹ کے پاؤں باندھنے کی ایک رسی بھی نہیں دی تو میں ان سے جنگ کروں گا، عمر بن خطاب رضی اللہ عنہ کہتے ہیں: اللہ کی قسم! اس کے سوا کچھ نہ تھا کہ میں نے سمجھا کہ اللہ تعالیٰ نے ابوبکر رضی اللہ عنہ کا سینہ جنگ کے لیے کھول دیا ہے اور اس وقت میں نے جانا کہ یہی حق ہے۔ ابوداؤد کہتے ہیں: یہ حدیث رباح بن زید نے روایت کی ہے اور عبدالرزاق نے معمر سے معمر نے زہری سے اسے اسی سند سے روایت کیا ہے، اس میں بعض نے «عناقا» کی جگہ «عقالا» کہا ہے اور ابن وہب نے اسے یونس سے روایت کیا ہے اس میں «عناقا» کا لفظ ہے۔ ابوداؤد کہتے ہیں: شعیب بن ابی حمزہ، معمر اور زبیدی نے اس حدیث میں زہری سے «لو منعوني عناقا» نقل کیا ہے اور عنبسہ نے یونس سے انہوں نے زہری سے یہی حدیث روایت کی ہے۔ اس میں بھی «عناقا» کا لفظ ہے۔",
			"urduNarrator": "ہم سے قتیبہ بن سعید ثقفی نے بیان کیا، ہم سے لیث نے بیان کیا، ان سے عقیل نے بیان کیا، انہوں نے زہری کی سند سے، مجھے عبید اللہ بن عبداللہ بن عتبہ نے خبر دی، ابوہریرہ رضی اللہ عنہ کہتے ہیں",
			"hadithArabic": "حَدَّثَنَا قُتَيْبَةُ بْنُ سَعِيدٍ الثَّقَفِيُّ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ، ‏‏‏‏‏‏عَنْ عُقَيْلٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ لَمَّا تُوُفِّيَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَاسْتُخْلِفَ أَبُو بَكْرٍ بَعْدَهُ، ‏‏‏‏‏‏وَكَفَرَ مَنْ كَفَرَ مِنَ الْعَرَبِ، ‏‏‏‏‏‏قَالَ عُمَرُ بْنُ الْخَطَّابِ لِأَبِي بَكْرٍ:‏‏‏‏ كَيْفَ تُقَاتِلُ النَّاسَ، ‏‏‏‏‏‏وَقَدْ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ أُمِرْتُ أَنْ أُقَاتِلَ النَّاسَ حَتَّى يَقُولُوا لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏فَمَنْ قَالَ لَا إِلَهَ إِلَّا اللَّهُ عَصَمَ مِنِّي مَالَهُ وَنَفْسَهُ إِلَّا بِحَقِّهِ وَحِسَابُهُ عَلَى اللَّهِ عَزَّ وَجَلَّ ، ‏‏‏‏‏‏فَقَالَ أَبُو بَكْرٍ:‏‏‏‏ وَاللَّهِ لَأُقَاتِلَنَّ مَنْ فَرَّقَ بَيْنَ الصَّلَاةِ وَالزَّكَاةِ، ‏‏‏‏‏‏فَإِنَّ الزَّكَاةَ حَقُّ الْمَالِ، ‏‏‏‏‏‏وَاللَّهِ لَوْ مَنَعُونِي عِقَالًا كَانُوا يُؤَدُّونَهُ إِلَى رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَقَاتَلْتُهُمْ عَلَى مَنْعِهِ، ‏‏‏‏‏‏فَقَالَ عُمَرُ بْنُ الْخَطَّابِ:‏‏‏‏ فَوَاللَّهِ مَا هُوَ إِلَّا أَنْ رَأَيْتُ اللَّهَ عَزَّ وَجَلَّ قَدْ شَرَحَ صَدْرَ أَبِي بَكْرٍ لِلْقِتَالِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَعَرَفْتُ أَنَّهُ الْحَقُّ. قَالَ أبُو دَاوُدَ:‏‏‏‏ قَالَ أَبُو عُبَيْدَةَ مَعْمَرُ بْنُ الْمُثَنَّى:‏‏‏‏ الْعِقَالُ صَدَقَةُ سَنَةٍ، ‏‏‏‏‏‏وَالْعِقَالانِ صَدَقَةُ سَنَتَيْنِ. قَالَ أَبُو دَاوُد:‏‏‏‏ وَرَوَاهُ رَبَاحُ بْنُ زَيْدٍ، ‏‏‏‏‏‏وَرَوَاهُ عَبْدُ الرَّزَّاقِ، ‏‏‏‏‏‏عَنْ مَعْمَرٍ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ بِإِسْنَادِهِ، ‏‏‏‏‏‏وَقَالَ بَعْضُهُمْ:‏‏‏‏ عِقَالًا. وَرَوَاهُ ابْنُ وَهْبٍ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَنَاقًا. قَالَ أَبُو دَاوُد:‏‏‏‏ قَالَ شُعَيْبُ بْنُ أَبِي حَمْزَةَ، ‏‏‏‏‏‏وَمَعْمَرٌ، ‏‏‏‏‏‏وَالزُّبَيْدِيُّ:‏‏‏‏ عَنْ الزُّهْرِيِّ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏لَوْ مَنَعُونِي عَنَاقًا. وَرَوَى عَنْبَسَةُ، ‏‏‏‏‏‏عَنْ يُونُسَ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ فِي هَذَا الْحَدِيثِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ عَنَاقًا.",
			"headingArabic": "Zakat",
			"headingUrdu": "زکوٰۃ کی فرضیت",
			"headingEnglish": "وُجُوبِ الزَّكَاةِ",
			"chapterId": "9",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 214,
				"chapterNumber": "9",
				"chapterEnglish": "Zakat (Kitab Al-Zakat)",
				"chapterUrdu": "زکوۃ کے احکام و مسائل",
				"chapterArabic": "كتاب الزكاة",
				"bookSlug": "abu-dawood"
			}
		},
		{
			"id": 20781,
			"hadithNumber": "1701",
			"englishNarrator": "Suwayd Ibn Ghaflah رضی اللہ عنہ said:",
			"hadithEnglish": "I fought along with Zayd Ibn Suhan and Sulayman ibn Rabiah. I found a whip. They said to me: Throw it away. I said: No; if I find its owner (I shall give it to him); if not, I shall use it. Then I performed hajj; and when I reached Madina, I asked Ubayy Ibn Kab رضی اللہ عنہ . He said: I found a purse which contained one hundred dinars; so I came to the Prophet صلی ‌اللہ ‌علیہ ‌وسلم. He said to me: Make the matter known for a year. I made it known for a year and then came to him. He then said to me: Make the matter known for a year. So I made it known for a year. I then (again) came to him. He said to me: Make the matter known for a year. Then I came to him and said: I did not find anyone who realises it. He said: Remember, its number, its container and its tie. If its owner comes, (give it to him), otherwise use it yourself. He (the narrator Shubah) said: I do not know whether he said the word make the matter known three times or once.",
			"hadithUrdu": "میں نے زید بن صوحان اور سلیمان بن ربیعہ کے ساتھ جہاد کیا، مجھے ایک کوڑا پڑا ملا، ان دونوں نے کہا: اسے پھینک دو، میں نے کہا: نہیں، بلکہ اگر اس کا مالک مل گیا تو میں اسے دے دوں گا اور اگر نہ ملا تو خود میں اپنے کام میں لاؤں گا، پھر میں نے حج کیا، میرا گزر مدینے سے ہوا، میں نے ابی بن کعب رضی اللہ عنہ سے پوچھا، تو انہوں نے بتایا کہ مجھے ایک تھیلی ملی تھی، اس میں سو ( ۱۰۰ ) دینار تھے، میں نبی اکرم صلی اللہ علیہ وسلم کے پاس آیا آپ نے فرمایا: ایک سال تک اس کی پہچان کراؤ ، چنانچہ میں ایک سال تک اس کی پہچان کراتا رہا، پھر آپ کے پاس آیا، آپ صلی اللہ علیہ وسلم نے فرمایا: ایک سال اور پہچان کراؤ ، میں نے ایک سال اور پہچان کرائی، اس کے بعد پھر آپ کے پاس آیا، آپ صلی اللہ علیہ وسلم نے فرمایا: ایک سال پھر پہچان کراؤ ، چنانچہ میں ایک سال پھر پہچان کراتا رہا، پھر آپ کے پاس آیا اور آپ صلی اللہ علیہ وسلم سے عرض کیا: مجھے کوئی نہ ملا جو اسے جانتا ہو، آپ صلی اللہ علیہ وسلم نے فرمایا: اس کی تعداد یاد رکھو اور اس کا بندھن اور اس کی تھیلی بھی، اگر اس کا مالک آ جائے ( تو بہتر ) ورنہ تم اسے اپنے کام میں لے لینا ۔ شعبہ کہتے ہیں: مجھے نہیں معلوم کہ سلمہ نے «عرفها» تین بار کہا تھا یا ایک بار۔",
			"urduNarrator": "ہم سے محمد بن کثیر نے بیان کیا، کہا ہم سے شعبہ نے بیان کیا، سلمہ بن کلہیل کی سند سے, سوید بن غفلہ رضی اللہ عنہ کہتے ہیں",
			"hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ كَثِيرٍ، ‏‏‏‏‏‏أَخْبَرَنَا شُعْبَةُ، ‏‏‏‏‏‏عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، ‏‏‏‏‏‏عَنْ سُوَيْدِ بْنِ غَفَلَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ غَزَوْتُ مَعَ زَيْدِ بْنِ صُوحَانَ وَ سَلْمَانَ بْنِ رَبِيعَةَ فَوَجَدْتُ سَوْطًا، ‏‏‏‏‏‏فَقَالَا لِيَ:‏‏‏‏ اطْرَحْهُ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ لَا، ‏‏‏‏‏‏وَلَكِنْ إِنْ وَجَدْتُ صَاحِبَهُ وَإِلَّا اسْتَمْتَعْتُ بِهِ فَحَجَجْتُ فَمَرَرْتُ عَلَى الْمَدِينَةِ، ‏‏‏‏‏‏فَسَأَلْتُ أُبَيَّ بْنَ كَعْبٍ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ وَجَدْتُ صُرَّةً فِيهَا مِائَةُ دِينَارٍ، ‏‏‏‏‏‏فَأَتَيْتُ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَرِّفْهَا حَوْلًا ، ‏‏‏‏‏‏فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَرِّفْهَا حَوْلًا ، ‏‏‏‏‏‏فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ عَرِّفْهَا حَوْلًا ، ‏‏‏‏‏‏فَعَرَّفْتُهَا حَوْلًا ثُمَّ أَتَيْتُهُ، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ لَمْ أَجِدْ مَنْ يَعْرِفُهَا، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ احْفَظْ عَدَدَهَا وَوِكَاءَهَا وَوِعَاءَهَا فَإِنْ جَاءَ صَاحِبُهَا وَإِلَّا فَاسْتَمْتِعْ بِهَا ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ وَلَا أَدْرِي أَثَلَاثًا قَالَ عَرِّفْهَا أَوْ مَرَّةً وَاحِدَةً.",
			"headingArabic": "التَّعْرِيفِ بِا للُّقَطَةِ",
			"headingUrdu": "کھوئی ہوئی اشیاء کے بارے میں جو مل جاتی ہیں۔",
			"headingEnglish": "Regarding lost items that are found",
			"chapterId": "10",
			"bookSlug": "abu-dawood",
			"volume": "2",
			"status": "Sahih",
			"book": {
				"id": 5,
				"bookName": "Sunan Abu Dawood",
				"writerName": "Imam Abu Dawud Sulayman ibn al-Ash'ath as-Sijistani",
				"aboutWriter": null,
				"writerDeath": "275",
				"bookSlug": "abu-dawood"
			},
			"chapter": {
				"id": 215,
				"chapterNumber": "10",
				"chapterEnglish": "The Book of Lost and Found Items",
				"chapterUrdu": "گری پڑی گمشدہ چیزوں سے متعلق مسائل",
				"chapterArabic": "كتاب اللقطة",
				"bookSlug": "abu-dawood"
			}
		}
	],
	"ibn-e-majah": [
		{
			"id": 24355,
			"hadithNumber": "1",
			"englishNarrator": "",
			"hadithEnglish": "Abu Hurairah narrated that: The Prophet said: Whatever I have commanded you do it, and whatever I have forbidden you, refrain from it.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: میں تمہیں جس چیز کا حکم دوں اسے مانو، اور جس چیز سے روک دوں اس سے رک جاؤ ۔",
			"urduNarrator": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا شَرِيكٌ، ‏‏‏‏‏‏عَنْ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَال:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ مَا أَمَرْتُكُمْ بِهِ فَخُذُوهُ، ‏‏‏‏‏‏وَمَا نَهَيْتُكُمْ عَنْهُ فَانْتَهُوا .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "1",
			"bookSlug": "ibn-e-majah",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 249,
				"chapterNumber": "1",
				"chapterEnglish": "The Book of the Sunnah",
				"chapterUrdu": "سنت کی اہمیت وفضیلت",
				"chapterArabic": "كتاب السنة",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 24621,
			"hadithNumber": "267",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated that Safinah said: The Messenger of Allah used to perform ablution with a Mudd (of water) and bath with a Sa'.",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم ایک مد پانی سے وضو فرماتے تھے، اور ایک صاع پانی سے غسل ۱؎۔",
			"urduNarrator": "سفینہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا إِسْمَاعِيل بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏عَنْ أَبِي رَيْحَانَةَ، ‏‏‏‏‏‏عَنْ سَفِينَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَتَوَضَّأُ بِالْمُدِّ، ‏‏‏‏‏‏وَيَغْتَسِلُ بِالصَّاعِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "2",
			"bookSlug": "ibn-e-majah",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 250,
				"chapterNumber": "2",
				"chapterEnglish": "The Book of Purification and its Sunnah",
				"chapterUrdu": "طہارت اور اس کے احکام و مسائل",
				"chapterArabic": "كتاب الطهارة وسننها",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 24919,
			"hadithNumber": "565",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated that 'Ammar bin Yasir said: Aishah dropped a necklace and stayed behind to look for it. Abu Bakr went to 'Aishah and got angry with her for keeping the people waiting. Then Allah revealed the concession allowing dry ablution, so we wiped our arms up to the shoulders. Abu Bakr went to 'Aishah and said: 'I did not know that you are blessed.'",
			"hadithUrdu": "ام المؤمنین عائشہ رضی اللہ عنہا کا ہار ٹوٹ کر گر گیا، وہ اس کی تلاش میں پیچھے رہ گئیں، ابوبکر رضی اللہ عنہ عائشہ رضی اللہ عنہا کے پاس گئے، اور ان پہ ناراض ہوئے، کیونکہ ان کی وجہ سے لوگوں کو رکنا پڑا، تو اللہ تبارک و تعالیٰ نے تیمم کی اجازت والی آیت نازل فرمائی، عمار بن یاسر رضی اللہ عنہما کہتے ہیں کہ ہم نے اس وقت مونڈھوں تک مسح کیا، اور ابوبکر رضی اللہ عنہ عائشہ رضی اللہ عنہا کے پاس آئے، اور کہنے لگے: مجھے معلوم نہ تھا کہ تم اتنی بابرکت ہو ۱؎۔",
			"urduNarrator": "عمار بن یاسر رضی اللہ عنہما کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، ‏‏‏‏‏‏حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنِ ابْنِ شِهَابٍ، ‏‏‏‏‏‏عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، ‏‏‏‏‏‏عَنْ عَمَّارِ بْنِ يَاسِرٍ، ‏‏‏‏‏‏أَنَّهُ قَالَ:‏‏‏‏ سَقَطَ عِقْدُ عَائِشَةَ فَتَخَلَّفَتْ لِالْتِمَاسِهِ، ‏‏‏‏‏‏فَانْطَلَقَ أَبُو بَكْرٍ إِلَى عَائِشَةَ، ‏‏‏‏‏‏فَتَغَيَّظَ عَلَيْهَا فِي حَبْسِهَا النَّاسَ، ‏‏‏‏‏‏فَأَنْزَلَ اللَّهُ عَزَّ وَجَلَّ الرُّخْصَةَ فِي التَّيَمُّمِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَمَسَحْنَا يَوْمَئِذٍ إِلَى الْمَنَاكِبِ ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ فَانْطَلَقَ أَبُو بَكْرٍ إِلَى عَائِشَةَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا عَلِمْتُ إِنَّكِ لَمُبَارَكَةٌ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "3",
			"bookSlug": "ibn-e-majah",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 251,
				"chapterNumber": "3",
				"chapterEnglish": "The Book of Tayammum (Rubbing Hands And Feet With Dust)",
				"chapterUrdu": "تیمم کے احکام و مسائل",
				"chapterArabic": "كتاب التيمم",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 25157,
			"hadithNumber": "803",
			"englishNarrator": "",
			"hadithEnglish": "Muhammad bin ‘Amr bin ‘Ata’ said: “I heard Abu Humaid As-Sa’idi say: ‘When the Messenger of Allah (ﷺ) stood up for prayer, he would face the prayer direction, raise his hands, and say: “Allahu Akbar (Allah is Most Great).”",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم جب نماز کے لیے کھڑے ہوتے تو قبلہ رخ ہوتے، اور اپنے دونوں ہاتھ اٹھا کر «الله أكبر»کہتے ۱؎۔",
			"urduNarrator": "ابو حمید ساعدی رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ الطَّنَافِسِيُّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو أُسَامَةَ، ‏‏‏‏‏‏حَدَّثَنِي عَبْدُ الْحَمِيدِ بْنُ جَعْفَرٍ، ‏‏‏‏‏‏حَدَّثَنَا مُحَمَّدُ بْنُ عَمْرِو بْنِ عَطَاءٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ سَمِعْتُ أَبَا حُمَيْدٍ السَّاعِدِيَّ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا قَامَ إِلَى الصَّلَاةِ، ‏‏‏‏‏‏اسْتَقْبَلَ الْقِبْلَةَ، ‏‏‏‏‏‏وَرَفَعَ يَدَيْهِ، ‏‏‏‏‏‏وَقَالَ:‏‏‏‏ اللَّهُ أَكْبَرُ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "7",
			"bookSlug": "ibn-e-majah",
			"volume": "2",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 255,
				"chapterNumber": "7",
				"chapterEnglish": "Establishing the Prayer and the Sunnah Regarding Them",
				"chapterUrdu": "اقامت صلاۃ اور اس کے سنن و آداب اور احکام و مسائل",
				"chapterArabic": "كتاب إقامة الصلاة والسنة فيها",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 25787,
			"hadithNumber": "1433",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated that ‘Ali said that the Messenger of Allah (ﷺ) said: “The Muslim has six courtesies due from the Muslim: He should greet him with Salam when he meets him; he should accept his invitation if he invites him; he should answer [by Yarhamuk-Allah (may Allah have mercy on you)] to him if he sneezes (and says Al- Hamdulillah); he should visit him if he falls sick; he should follow his funeral if he dies; and he should love for him what he loves for himself.”",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: مسلمان کی مسلمان پر حسن سلوک کے چھ حقوق ہیں: ۱۔ جب اس سے ملاقات ہو تو اسے سلام کرے، ۲۔ جب وہ دعوت دے تو اس کی دعوت قبول کرے، ۳۔ جب وہ چھینکے اور «الحمد لله» کہے تو جواب میں «يرحمك الله» کہے، ۴۔ جب وہ بیمار ہو تو اس کی عیادت ( بیمار پرسی ) کرے، ۵۔ جب اس کا انتقال ہو جائے تو اس کے جنازہ کے ساتھ جائے، ۶۔ اور اس کے لیے وہی پسند کرے جو اپنے لیے پسند کرتا ہے ۔",
			"urduNarrator": "علی رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا هَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو الْأَحْوَصِ، ‏‏‏‏‏‏عَنْ أَبِي إِسْحَاق، ‏‏‏‏‏‏عَنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْ عَلِيٍّ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لِلْمُسْلِمِ عَلَى الْمُسْلِمِ سِتَّةٌ بِالْمَعْرُوفِ:‏‏‏‏ يُسَلِّمُ عَلَيْهِ إِذَا لَقِيَهُ، ‏‏‏‏‏‏وَيُجِيبُهُ إِذَا دَعَاهُ، ‏‏‏‏‏‏وَيُشَمِّتُهُ إِذَا عَطَسَ، ‏‏‏‏‏‏وَيَعُودُهُ إِذَا مَرِضَ، ‏‏‏‏‏‏وَيَتْبَعُ جِنَازَتَهُ إِذَا مَاتَ، ‏‏‏‏‏‏وَيُحِبُّ لَهُ مَا يُحِبُّ لِنَفْسِهِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "8",
			"bookSlug": "ibn-e-majah",
			"volume": "2",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 256,
				"chapterNumber": "8",
				"chapterEnglish": "Chapter Regarding Funerals",
				"chapterUrdu": "صلاۃِ جنازہ کے احکام و مسائل",
				"chapterArabic": "كتاب الجنائز",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 25992,
			"hadithNumber": "1638",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Abu Hurairah that the Messenger of Allah (ﷺ) said: “Every good deed of the son of Adam will be multiplied manifold. A good deed will be multiplied ten times up to as many as seven hundred times, or as much as Allah wills. Allah says: ‘Except for fasting, which is for Me and I shall reward for it. He gives up his desire and his food for My sake.’ The fasting person has two joys, one when he breaks his fast and another when he meets his Lord. The smell that comes from the mouth of a fasting person is better before Allah than the fragrance of musk.”",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا: انسان کی ہر نیکی دس گنا سے سات سو گنا تک بڑھا دی جاتی ہے، اللہ تعالیٰ فرماتا ہے: سوائے روزے کے اس لیے کہ وہ میرے لیے خاص ہے، اور میں ہی اس کا بدلہ دوں گا، آدمی اپنی خواہش اور کھانا میرے لیے چھوڑ دیتا ہے، روزہ دار کے لیے دو خوشیاں ہیں: ایک افطار کے وقت اور دوسری اپنے رب سے ملنے کے وقت، اور روزے دار کے منہ کی بو اللہ تعالیٰ کے نزدیک مشک کی بو سے بہتر ہے ۱؎۔",
			"urduNarrator": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، ‏‏‏‏‏‏حَدَّثَنَا أَبُو مُعَاوِيَةَ، ‏‏‏‏‏‏ وَوَكِيعٌ، ‏‏‏‏‏‏عَنِ الْأَعْمَشِ، ‏‏‏‏‏‏عَنْ أَبِي صَالِحٍ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِ مِائَةِ ضِعْفٍ مَا شَاءَ اللَّهُ، ‏‏‏‏‏‏يَقُولُ اللَّهُ:‏‏‏‏ إِلَّا الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ، ‏‏‏‏‏‏يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِنْ أَجْلِي، ‏‏‏‏‏‏لِلصَّائِمِ فَرْحَتَانِ فَرْحَةٌ عِنْدَ فِطْرِهِ، ‏‏‏‏‏‏وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ، ‏‏‏‏‏‏وَلَخُلُوفُ فَمِ الصَّائِمِ أَطْيَبُ عِنْدَ اللَّهِ مِنْ رِيحِ الْمِسْكِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "9",
			"bookSlug": "ibn-e-majah",
			"volume": "2",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 257,
				"chapterNumber": "9",
				"chapterEnglish": "Fasting",
				"chapterUrdu": "صیام کے احکام و مسائل",
				"chapterArabic": "كتاب الصيام",
				"bookSlug": "ibn-e-majah"
			}
		},
		{
			"id": 26137,
			"hadithNumber": "1783",
			"englishNarrator": "",
			"hadithEnglish": "Ibn Abbas(RAH) narrated that: the Prophet send Muadh to Yemen, and said: “You are going to some people among the People of the Book. Call them to bear witness that none has the right to be worshipped but Allah, and that I am the messenger of Allah. If they obey that, then tell them that Allah has enjoined upon them five prayers every day and night. If they obey that, then tell them that Allah has enjoined upon them charity (Zakat) from their wealth, to be taken from the rich and given to their poor. If they obey that, then beware of (taking) the best of their wealth. And beware of the supplication of the oppressed, for there is no barrier between and Allah.”",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے معاذ رضی اللہ عنہ کو یمن کی جانب بھیجا، اور فرمایا: تم اہل کتاب ( یہود و نصاریٰ ) کے پاس پہنچو گے، تم انہیں اس بات کی دعوت دینا کہ وہ گواہی دیں کہ اللہ تعالیٰ کے سوا کوئی معبود برحق نہیں، اور میں اس کا رسول ہوں، اگر وہ اسے مان لیں تو انہیں بتانا کہ اللہ تعالیٰ نے ان پر رات و دن میں پانچ نمازیں فرض کی ہیں، اگر وہ اسے مان لیں تو بتانا کہ اللہ تعالیٰ نے ان کے مالوں میں ان پر زکاۃ فرض کی ہے، جو ان کے مالداروں سے لی جائے گی اور انہیں کے محتاجوں میں بانٹ دی جائیگی، اگر وہ اس کو مان لیں تو پھر ان کے عمدہ اور نفیس مال وصول کرنے سے بچے رہنا ۱؎ ( بلکہ زکاۃ میں اوسط مال لینا ) ، اور مظلوم کی بد دعا سے بھی بچنا، اس لیے کہ اس کے اور اللہ تعالیٰ کے درمیان کوئی رکاوٹ نہیں ہے ۲؎۔",
			"urduNarrator": "عبداللہ بن عباس رضی اللہ عنہما سے روایت ہے کہ",
			"hadithArabic": "حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، ‏‏‏‏‏‏حَدَّثَنَا وَكِيعُ بْنُ الْجَرَّاحِ، ‏‏‏‏‏‏حَدَّثَنَا زَكَرِيَّا بْنُ إِسْحَاق الْمَكِّيُّ، ‏‏‏‏‏‏عَنْ يَحْيَى بْنِ عَبْدِ اللَّهِ بْنِ صَيْفِيٍّ، ‏‏‏‏‏‏عَنْ أَبِي مَعْبَدٍ مَوْلَى ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏عَنِ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ،‏‏‏‏:‏‏‏‏ فَقَالَ:‏‏‏‏ إِنَّكَ تَأْتِي قَوْمًا أَهْلَ كِتَابٍ، ‏‏‏‏‏‏فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ، ‏‏‏‏‏‏وَأَنِّي رَسُولُ اللَّهِ، ‏‏‏‏‏‏فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ، ‏‏‏‏‏‏فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي كُلِّ يَوْمٍ وَلَيْلَةٍ، ‏‏‏‏‏‏فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ، ‏‏‏‏‏‏فَأَعْلِمْهُمْ أَنَّ اللَّهَ افْتَرَضَ عَلَيْهِمْ صَدَقَةً فِي أَمْوَالِهِمْ تُؤْخَذُ مِنْ أَغْنِيَائِهِمْ فَتُرَدُّ فِي فُقَرَائِهِمْ، ‏‏‏‏‏‏فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ، ‏‏‏‏‏‏فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ، ‏‏‏‏‏‏وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهَا لَيْسَ بَيْنَهَا وَبَيْنَ اللَّهِ حِجَابٌ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "10",
			"bookSlug": "ibn-e-majah",
			"volume": "3",
			"status": "sahih",
			"book": {
				"id": 6,
				"bookName": "Sunan Ibn-e-Majah",
				"writerName": "Imam Muhammad bin Yazid Ibn Majah al-Qazvini",
				"aboutWriter": null,
				"writerDeath": "273",
				"bookSlug": "ibn-e-majah"
			},
			"chapter": {
				"id": 258,
				"chapterNumber": "10",
				"chapterEnglish": "The Chapter Regarding Zakat",
				"chapterUrdu": "زکاۃ کے احکام و مسائل",
				"chapterArabic": "كتاب الزكاة",
				"bookSlug": "ibn-e-majah"
			}
		}
	],
	"sunan-nasai": [
		{
			"id": 34989,
			"hadithNumber": "1",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Abu Hurairah that the Prophet (ﷺ) said: When any one of you wakes from sleep, let him not dip his hand in (the water he uses for) his Wudu' until he has washed it three times, for none of you knows where his hand spent the night.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:  جب تم میں سے کوئی شخص نیند سے جاگ جائے تو اپنا ہاتھ اپنے وضو کے پانی میں نہ ڈالے، یہاں تک کہ اسے تین بار دھو لے، کیونکہ وہ نہیں جانتا کہ اس کا ہاتھ رات میں کہاں کہاں رہا ہے ۔",
			"urduNarrator": "ابوہریرہ رضی اللہ عنہ سے روایت ہے کہ",
			"hadithArabic": "أَخْبَرَنَا قُتَيْبَةُ بْنُ سَعِيدٍ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ حَدَّثَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ الزُّهْرِيِّ، ‏‏‏‏‏‏عَنْ أَبِي سَلَمَةَ، ‏‏‏‏‏‏عَنْ أَبِي هُرَيْرَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِذَا اسْتَيْقَظَ أَحَدُكُمْ مِنْ نَوْمِهِ، ‏‏‏‏‏‏فَلَا يَغْمِسْ يَدَهُ فِي وَضُوئِهِ حَتَّى يَغْسِلَهَا ثَلَاثًا، ‏‏‏‏‏‏فَإِنَّ أَحَدَكُمْ لَا يَدْرِي أَيْنَ بَاتَتْ يَدُهُ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "1",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 288,
				"chapterNumber": "1",
				"chapterEnglish": "The Book of Purification",
				"chapterUrdu": "طہارت کے احکام و مسائل",
				"chapterArabic": "كتاب الطهارة",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35314,
			"hadithNumber": "326",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Ibn 'Abbas that one of the wives of the Prophet (ﷺ) performed Ghusl from Janabah, and the Prophet (ﷺ) performed Wudu' with her leftover water. She mentioned that to him and he said: Water is not made impure by anything. [1] [1] See the following versions.",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم کی ایک بیوی نے غسل جنابت کیا، تو آپ صلی اللہ علیہ وسلم نے اس کے بچے ہوئے پانی سے وضو کیا، اس نے آپ صلی اللہ علیہ وسلم سے اس کا ذکر کیا، تو آپ صلی اللہ علیہ وسلم نے فرمایا:  پانی کو کوئی چیز ناپاک نہیں کرتی ہے  ۱؎۔",
			"urduNarrator": "عبداللہ بن عباس رضی اللہ عنہم سے روایت ہے کہ",
			"hadithArabic": "أَخْبَرَنَا سُوَيْدُ بْنُ نَصْرٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، ‏‏‏‏‏‏عَنْ سُفْيَانَ، ‏‏‏‏‏‏عَنْ سِمَاكٍ، ‏‏‏‏‏‏عَنْ عِكْرِمَةَ، ‏‏‏‏‏‏عَنْ ابْنِ عَبَّاسٍ، ‏‏‏‏‏‏أَنّ بَعْضَ أَزْوَاجِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ اغْتَسَلَتْ مِنَ الْجَنَابَةِ، ‏‏‏‏‏‏فَتَوَضَّأَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بِفَضْلِهَا، ‏‏‏‏‏‏فَذَكَرَتْ ذَلِكَ لَهُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ إِنَّ الْمَاءَ لَا يُنَجِّسُهُ شَيْءٌ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "2",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 289,
				"chapterNumber": "2",
				"chapterEnglish": "The Book of Water",
				"chapterUrdu": "پانی کے احکام و مسائل",
				"chapterArabic": "كتاب المياه",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35337,
			"hadithNumber": "349",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated that 'Aishah said: We went out with the Messenger of Allah (ﷺ) with no intention other than Hajj. When he was in Sarif I began menstruating. The Messenger of Allah (ﷺ) entered upon me and I was weeping. He said: 'What is the matter with you? Has you Nifas begun?' I said: 'Yes.' He said: 'This is something that Allah the Mighty and Sublime has decreed for the daughters of Adam. Do what the pilgrims do but do not perform Tawaf around the House.'",
			"hadithUrdu": "ہم لوگ رسول اللہ صلی اللہ علیہ وسلم کے ساتھ نکلے، ہمارا مقصد صرف حج کرنا تھا، جب ہم مقام سرف میں پہنچے تو میں حائضہ ہو گئی، تو رسول اللہ صلی اللہ علیہ وسلم میرے پاس آئے اور میں رو رہی تھی، تو آپ صلی اللہ علیہ وسلم نے پوچھا:  کیا بات ہے؟ کیا تم حائضہ ہو گئی ہو؟  میں نے عرض کیا: جی ہاں؟ آپ صلی اللہ علیہ وسلم نے فرمایا:  یہ ایک ایسا معاملہ ہے جسے اللہ تعالیٰ نے آدم زادیوں پر مقدر کر دیا ہے ۱؎، اب تم وہ سارے کام کرو، جو حاجی کرتا ہے، البتہ خانہ کعبہ کا طواف نہ کرنا ۔",
			"urduNarrator": "ام المؤمنین عائشہ رضی اللہ عنہا کہتی ہیں کہ",
			"hadithArabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ أَنْبَأَنَا سُفْيَانُ، ‏‏‏‏‏‏عَنْ عَبْدِ الرَّحْمَنِ بْنِ الْقَاسِمِ بْنِ مُحَمَّدِ بْنِ أَبِي بَكْرٍ الصِّدِّيقِ رَضِيَ اللَّهُ، ‏‏‏‏‏‏عَنْ أَبِيهِ، ‏‏‏‏‏‏عَنْ عَائِشَةَ، ‏‏‏‏‏‏قالت:‏‏‏‏ خَرَجْنَا مَعَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لَا نُرَى إِلَّا الْحَجَّ، ‏‏‏‏‏‏فَلَمَّا كُنَّا بِسَرِفَ حِضْتُ، ‏‏‏‏‏‏فَدَخَلَ عَلَيَّ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَأَنَا أَبْكِي، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا لَكِ ؟ أَنَفِسْتِ ؟ قُلْتُ:‏‏‏‏ نَعَمْ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ هَذَا أَمْرٌ كَتَبَهُ اللَّهُ عَزَّ وَجَلَّ عَلَى بَنَاتِ آدَمَ، ‏‏‏‏‏‏فَاقْضِي مَا يَقْضِي الْحَاجُّ غَيْرَ أَنْ لَا تَطُوفِي بِالْبَيْتِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "3",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 290,
				"chapterNumber": "3",
				"chapterEnglish": "The Book of Menstruation and Istihadah",
				"chapterUrdu": "حیض اور استحاضہ کے احکام و مسائل",
				"chapterArabic": "كتاب الحيض والاستحاضة",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35384,
			"hadithNumber": "396",
			"englishNarrator": "",
			"hadithEnglish": "Abu Hurairah said: The Messenger of Allah (ﷺ) said: 'None of you should perform ghusl in standing water while he is Junub.'",
			"hadithUrdu": "رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:  تم میں سے کوئی ٹھہرے ہوئے پانی میں غسل نہ کرے، اور وہ جنبی ہو ۔",
			"urduNarrator": "ابوہریرہ رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "أَخْبَرَنَا سُلَيْمَانُ بْنُ دَاوُدَ، ‏‏‏‏‏‏وَالْحَارِثُ بْنُ مِسْكِينٍ قِرَاءَةً عَلَيْهِ وَأَنَا أَسْمَعُ، ‏‏‏‏‏‏عَنْ ابْنِ وَهْبٍ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ الْحَارِثِ، ‏‏‏‏‏‏عَنْبُكَيْرِ بْنِ الْأَشَجِّ، ‏‏‏‏‏‏أَنَّ أَبَا السَّائِبِ حَدَّثَهُ، ‏‏‏‏‏‏أَنَّهُ سَمِعَ أَبَا هُرَيْرَةَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ لَا يَغْتَسِلْ أَحَدُكُمْ فِي الْمَاءِ الدَّائِمِ وَهُوَ جُنُبٌ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "4",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 291,
				"chapterNumber": "4",
				"chapterEnglish": "The Book of Ghusl and Tayammum",
				"chapterUrdu": "غسل اور تیمم کے احکام و مسائل",
				"chapterArabic": "كتاب الغسل والتيمم",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35437,
			"hadithNumber": "449",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Anas bin Malik, from Malik bin Sa'sa'ah, that the Prophet (ﷺ) said: While I was at the Ka'bah, in a state between sleep and wakefulness, three men came, and one of them who was in the middle came toward me. I was brought a basin of gold, filled with wisdom and faith, and he slit open from the throat to the lower abdomen, and washed the heart with Zamzam water, then - it was filled with wisdom and faith. Then I was brought a riding-beast, smaller than a mule and bigger than a donkey. I set off with Jibril, peace be upon him, and we came to the lowest heaven. It was said: 'Who is with you?' He said: 'Muhammad.' It was said: 'Has (revelation) been sent to him? Welcome to him, what an excellent visit his is.' I came to Adam, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent son and Prophet.' Then we came to the second heaven and it was said: 'Who is this?' He said: 'Jibra'il.' [1] It was said: 'Who is with you?' he said: 'Muhammad.' And the same exchange took place. I came to Yahya and 'Eisa, peace be upon them both, and greeted them, and they said: 'Welcome to you! What an excellent brother and Prophet.' Then we came to the third heaven and it was said: 'Who is this?' He said: 'Jibra'il.' It was said: 'Who is with you?' He said: 'Muhammad.' And the same exchange took place. I came to Yusuf, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent brother and Prophet.' Then we came to the fourth heaven and the same exchange took place. I came to Idris, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent brother and Prophet.' Then we came to the fifth heaven and the same exchange took place. I came to Harun, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent brother and Prophet.' Then we came to the sixth heaven and the same exchange took place. I came to Musa, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent brother and Prophet.' What I passed him, he wept, and it was said: 'Why are you weeping?' He said: 'O Lord, this young man whom You have sent after me, more of his Ummah will enter Paradise than from my nation, and they will be more virtuous than them.' Then we came to the seventh heaven and a similar exchange took place. I came to Ibrahim, peace be upon him, and greeted him, and he said: 'Welcome to you! What an excellent son and Prophet.' Then I was taken up to the Oft-Frequented House (Al-Bait al-Ma'mur) and I asked Jibra'il about it, and he said: 'This is Al-Bait al-Ma'mur in which seventy thousand angels pray everyday, and when they leave it they never come back.' Then I was taken up to Sidrah Al-Muntaha (the Lote-Tree of the Utmost Boundary). Its fruits were like Qilal [2] of Hajar and its leaves were like the ears of elephants. At its base were four rivers: Two hidden rivers and two manifest rivers. I asked Jibril (About them) and he said: 'The two hidden ones are in paradise, and the two manifest ones are the Euphrates and the Nile.' Then fifty prayers were enjoined upon me. I came to Musa and he said: 'What happened?' I said: 'Fifty prayers have been enjoined upon me.' He said: 'I know more about the people than you. I tried hard with the Children of Israel. Your Ummah will never be able to bear that. Go back to your Lord and ask Him to reduce it for you.' So I went back to my Lord and asked Him to reduce it, and He made it forty. Then I went back to Musa, peace be upon him, and he said: 'What happened?' I said: 'He made it forty.' He said to me something similar to what he said the first time, so I went back to my Lord and He made it thirty. I came to Musa, peace be upon him, and told him, and he said to me something similar to what he said the first time, so I went back to my Lord and he made it twenty, then ten, then five. I came to Musa, peace be upon him, and he said to me something like he had said the first time, but I said: 'I feel too shy before my Lord to go back to Him.' Then it was called out: 'I have decreed (the reward for) My obligation, and I have reduced the burden for My slaves and I will give a ten-fold reward for each good deed.' [1] It is like this here, while it is Jibra'il the first time it appears in this narration, and Jibra'il is often used in the Hadith literature. [2] Plural of Qullah",
			"hadithUrdu": "نبی اکرم صلی اللہ علیہ وسلم نے فرمایا:  میں کعبہ کے پاس نیم خواب اور نیم بیداری میں تھا کہ اسی دوران میرے پاس تین  ( فرشتے )  آئے، ان تینوں میں سے ایک جو دو کے بیچ میں تھا میری طرف آیا، اور میرے پاس حکمت و ایمان سے بھرا ہوا سونے کا ایک طشت لایا گیا، تو اس نے میرا سینہ حلقوم سے پیٹ کے نچلے حصہ تک چاک کیا، اور دل کو آب زمزم سے دھویا، پھر وہ حکمت و ایمان سے بھر دیا گیا، پھر میرے پاس خچر سے چھوٹا اور گدھے سے بڑا ایک جانور لایا گیا، میں جبرائیل علیہ السلام کے ساتھ چلا، تو ہم آسمان دنیا پر آئے، تو پوچھا گیا کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد  ( صلی اللہ علیہ وسلم )  ہیں، پوچھا گیا: کیا بلائے گئے ہیں؟ مرحبا مبارک ہو ان کی تشریف آوری، پھر میں آدم علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بیٹے اور نبی! پھر ہم دوسرے آسمان پر آئے، پوچھا گیا: کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا: آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد  ( صلی اللہ علیہ وسلم )  ہیں، یہاں بھی اسی طرح ہوا، یہاں میں عیسیٰ علیہ السلام اور یحییٰ علیہ السلام کے پاس آیا، اور میں نے ان دونوں کو سلام کیا، ان دونوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم تیسرے آسمان پر آئے، پوچھا گیا کون ہو؟ انہوں نے کہا: جبرائیل ہوں، پوچھا گیا: آپ کے ساتھ کون ہیں؟ انہوں نے کہا: محمد  ( صلی اللہ علیہ وسلم )  ہیں، یہاں بھی اسی طرح ہوا، یہاں میں یوسف علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم چوتھے آسمان پر آئے، وہاں بھی اسی طرح ہوا، یہاں میں ادریس علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! پھر ہم پانچویں آسمان پر آئے، یہاں بھی ویسا ہی ہوا، میں ہارون علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی، اور نبی! پھر ہم چھٹے آسمان پر آئے، یہاں بھی ویسا ہی ہوا، تو میں موسیٰ علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بھائی اور نبی! تو جب میں ان سے آگے بڑھا، تو وہ رونے لگے ۱؎، ان سے پوچھا گیا آپ کو کون سی چیز رلا رہی ہے؟ انہوں نے کہا: پروردگار! یہ لڑکا جسے تو نے میرے بعد بھیجا ہے اس کی امت سے جنت میں داخل ہونے والے لوگ میری امت کے داخل ہونے والے لوگوں سے زیادہ اور افضل ہوں گے، پھر ہم ساتویں آسمان پر آئے، یہاں بھی ویسا ہی ہوا، تو میں ابراہیم علیہ السلام کے پاس آیا، اور میں نے انہیں سلام کیا، انہوں نے کہا: خوش آمدید تمہیں اے بیٹے اور نبی! پھر بیت معمور ۲؎ میرے قریب کر دیا گیا، میں نے  ( اس کے متعلق )  جبرائیل سے پوچھا تو انہوں نے کہا: یہ بیت معمور ہے، اس میں روزانہ ستر ہزار فرشتے نماز ادا کرتے ہیں، جب وہ اس سے نکلتے ہیں تو پھر دوبارہ اس میں واپس نہیں ہوتے، یہی ان کا آخری داخلہ ہوتا ہے، پھر سدرۃ المنتھی میرے قریب کر دیا گیا، اس کے بیر ہجر کے مٹکوں جیسے، اور اس کے پتے ہاتھی کے کان جیسے تھے، اور اس کی جڑ سے چار نہریں نکلی ہوئی تھی، دو نہریں باطنی ہیں، اور دو ظاہری، میں نے جبرائیل سے پوچھا، تو انہوں نے کہا: باطنی نہریں تو جنت میں ہیں، اور ظاہری نہریں فرات اور نیل ہیں، پھر میرے اوپر پچاس وقت کی نمازیں فرض کی گئیں، میں لوٹ کر موسیٰ  ( علیہ السلام )  کے پاس آیا، تو انہوں نے پوچھا: آپ نے کیا کیا؟ میں نے کہا: میرے اوپر پچاس نمازیں فرض کی گئیں ہیں، انہوں نے کہا: میں لوگوں کو آپ سے زیادہ جانتا ہوں، میں بنی اسرائیل کو خوب جھیل چکا ہوں، آپ کی امت اس کی طاقت بالکل نہیں رکھتی، اپنے رب کے پاس واپس جایئے، اور اس سے گزارش کیجئیے کہ اس میں تخفیف کر دے، چنانچہ میں اپنے رب کے پاس واپس آیا، اور میں نے اس سے تخفیف کی گزارش کی، تو اللہ تعالیٰ نے چالیس نمازیں کر دیں، پھر میں موسیٰ علیہ السلام کے پاس واپس آیا، انہوں نے پوچھا: آپ نے کیا کیا؟ میں نے کہا: اللہ تعالیٰ نے انہیں چالیس کر دی ہیں، پھر انہوں نے مجھ سے وہی بات کہی جو پہلی بار کہی تھی، تو میں پھر اپنے رب عزوجل کے پاس واپس آیا، تو اللہ تعالیٰ نے انہیں تیس کر دیں، پھر میں موسیٰ علیہ السلام کے پاس آیا، اور انہیں اس کی خبر دی، تو انہوں نے پھر وہی بات کہی جو پہلے کہی تھی، تو میں اپنے رب کے پاس واپس گیا، تو اس نے انہیں بیس پھر دس اور پھر پانچ کر دیں، پھر میں موسیٰ علیہ السلام کے پاس آیا، تو انہوں نے پھر وہی بات کہی جو پہلے کہی تھی، تو میں نے کہا:  ( اب مجھے )  اپنے رب عزوجل کے پاس  ( باربار )  جانے سے شرم آ رہی ہے، تو آواز آئی: میں نے اپنا فریضہ نافذ کر دیا ہے، اور اپنے بندوں سے تخفیف کر دی ہے، اور میں نیکی کا بدلہ دس گنا دیتا ہوں ۔",
			"urduNarrator": "انس بن مالک، مالک بن صعصعہ رضی اللہ عنہما سے روایت کرتے ہیں کہ",
			"hadithArabic": "أَخْبَرَنَا يَعْقُوبُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا هِشَامٌ الدَّسْتَوَائِيُّ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا قَتَادَةُ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏عَنْ مَالِكِ بْنِ صَعْصَعَةَ، ‏‏‏‏‏‏أَنّ النَّبِيَّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ بَيْنَا أَنَا عِنْدَ الْبَيْتِ بَيْنَ النَّائِمِ وَالْيَقْظَانِ، ‏‏‏‏‏‏إِذْ أَقْبَلَ أَحَدُ الثَّلَاثَةِ بَيْنَ الرَّجُلَيْنِ، ‏‏‏‏‏‏فَأُتِيتُ بِطَسْتٍ مِنْ ذَهَبٍ مَلْآنَ حِكْمَةً وَإِيمَانًا فَشَقَّ مِنَ النَّحْرِ إِلَى مَرَاقِّ الْبَطْنِ فَغَسَلَ الْقَلْبَ بِمَاءِ زَمْزَمَ ثُمَّ مُلِئَ حِكْمَةً وَإِيمَانًا، ‏‏‏‏‏‏ثُمَّ أُتِيتُ بِدَابَّةٍ دُونَ الْبَغْلِ وَفَوْقَ الْحِمَارِ، ‏‏‏‏‏‏ثُمَّ انْطَلَقْتُ مَعَ جِبْرِيلَ عَلَيْهِ السَّلَام فَأَتَيْنَا السَّمَاءَ الدُّنْيَا، ‏‏‏‏‏‏فَقِيلَ:‏‏‏‏ مَنْ هَذَا ؟ قَالَ:‏‏‏‏ جِبْرِيلُ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ وَمَنْ مَعَكَ ؟ قَالَ:‏‏‏‏ مُحَمَّدٌ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ وَقَدْ أُرْسِلَ إِلَيْهِ، ‏‏‏‏‏‏مَرْحَبًا بِهِ وَنِعْمَ الْمَجِيءُ جَاءَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى آدَمَ عَلَيْهِ السَّلَام فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنَ ابْنٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ الثَّانِيَةَ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ مَنْ هَذَا ؟ قَالَ:‏‏‏‏ جِبْرِيلُ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ وَمَنْ مَعَكَ ؟ قَالَ:‏‏‏‏ مُحَمَّدٌ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى يَحْيَى، ‏‏‏‏‏‏وَعِيسَى فَسَلَّمْتُ عَلَيْهِمَا، ‏‏‏‏‏‏فَقَالَا:‏‏‏‏ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ الثَّالِثَةَ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ مَنْ هَذَا ؟ قَالَ:‏‏‏‏ جِبْرِيلُ، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ وَمَنْ مَعَكَ ؟ قَالَ:‏‏‏‏ مُحَمَّدٌ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى يُوسُفَ عَلَيْهِ السَّلَام فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ الرَّابِعَةَ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى إِدْرِيسَ عَلَيْهِ السَّلَام فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ الْخَامِسَةَ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى هَارُونَ عَلَيْهِ السَّلَام فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ السَّادِسَةَ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏ثُمَّ أَتَيْتُ عَلَى مُوسَى عَلَيْهِ السَّلَام فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنْ أَخٍ وَنَبِيٍّ، ‏‏‏‏‏‏فَلَمَّا جَاوَزْتُهُ بَكَى، ‏‏‏‏‏‏قِيلَ:‏‏‏‏ مَا يُبْكِيكَ ؟ قَالَ:‏‏‏‏ يَا رَبِّ، ‏‏‏‏‏‏هَذَا الْغُلَامُ الَّذِي بَعَثْتَهُ بَعْدِي يَدْخُلُ مِنْ أُمَّتِهِ الْجَنَّةَ أَكْثَرُ وَأَفْضَلُ مِمَّا يَدْخُلُ مِنْ أُمَّتِي، ‏‏‏‏‏‏ثُمَّ أَتَيْنَا السَّمَاءَ السَّابِعَةَ، ‏‏‏‏‏‏فَمِثْلُ ذَلِكَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى إِبْرَاهِيمَ عَلَيْهِ السَّلَام، ‏‏‏‏‏‏فَسَلَّمْتُ عَلَيْهِ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَرْحَبًا بِكَ مِنَ ابْنٍ وَنَبِيٍّ، ‏‏‏‏‏‏ثُمَّ رُفِعَ لِي الْبَيْتُ الْمَعْمُورُ، ‏‏‏‏‏‏فَسَأَلْتُ جِبْرِيلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ هَذَا الْبَيْتُ الْمَعْمُورُ يُصَلِّي فِيهِ كُلَّ يَوْمٍ سَبْعُونَ أَلْفَ مَلَكٍ فَإِذَا خَرَجُوا مِنْهُ لَمْ يَعُودُوا فِيهِ آخِرَ مَا عَلَيْهِمْ، ‏‏‏‏‏‏ثُمَّ رُفِعَتْ لِي سِدْرَةُ الْمُنْتَهَى فَإِذَا نَبْقُهَا مِثْلُ قِلَالِ هَجَرٍ وَإِذَا وَرَقُهَا مِثْلُ آذَانِ الْفِيَلَةِ وَإِذَا فِي أَصْلِهَا أَرْبَعَةُ أَنْهَارٍ نَهْرَانِ بَاطِنَانِ وَنَهْرَانِ ظَاهِرَانِ، ‏‏‏‏‏‏فَسَأَلْتُ جِبْرِيلَ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَمَّا الْبَاطِنَانِ فَفِي الْجَنَّةِ وَأَمَّا الظَّاهِرَانِ فَالْفُرَاتُ وَالنَّيْل، ‏‏‏‏‏‏ثُمَّ فُرِضَتْ عَلَيَّ خَمْسُونَ صَلَاةً فَأَتَيْتُ عَلَى مُوسَى، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا صَنَعْتَ ؟ قُلْتُ:‏‏‏‏ فُرِضَتْ عَلَيَّ خَمْسُونَ صَلَاةً، ‏‏‏‏‏‏قَالَ:‏‏‏‏ إِنِّي أَعْلَمُ بِالنَّاسِ مِنْكَ، ‏‏‏‏‏‏إِنِّي عَالَجْتُ بَنِي إِسْرَائِيلَ أَشَدَّ الْمُعَالَجَةِ وَإِنَّ أُمَّتَكَ لَنْ يُطِيقُوا ذَلِكَ فَارْجِعْ إِلَى رَبِّكَ فَاسْأَلْهُ أَنْ يُخَفِّفَ عَنْكَ، ‏‏‏‏‏‏فَرَجَعْتُ إِلَى رَبِّي فَسَأَلْتُهُ أَنْ يُخَفِّفَ عَنِّي فَجَعَلَهَا أَرْبَعِينَ، ‏‏‏‏‏‏ثُمَّ رَجَعْتُ إِلَى مُوسَى عَلَيْهِ السَّلَام، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ مَا صَنَعْتَ ؟ قُلْتُ:‏‏‏‏ جَعَلَهَا أَرْبَعِينَ، ‏‏‏‏‏‏فَقَالَ لِي مِثْلَ مَقَالَتِهِ الْأُولَى، ‏‏‏‏‏‏فَرَجَعْتُ إِلَى رَبِّي عَزَّ وَجَلَّ فَجَعَلَهَا ثَلَاثِينَ، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى مُوسَى عَلَيْهِ السَّلَام فَأَخْبَرْتُهُ، ‏‏‏‏‏‏فَقَالَ لِي مِثْلَ مَقَالَتِهِ الْأُولَى، ‏‏‏‏‏‏فَرَجَعْتُ إِلَى رَبِّي فَجَعَلَهَا عِشْرِينَ ثُمَّ عَشْرَةً ثُمَّ خَمْسَةً، ‏‏‏‏‏‏فَأَتَيْتُ عَلَى مُوسَى عَلَيْهِ السَّلَام، ‏‏‏‏‏‏فَقَالَ لِي مِثْلَ مَقَالَتِهِ الْأُولَى، ‏‏‏‏‏‏فَقُلْتُ:‏‏‏‏ إِنِّي أَسْتَحِي مِنْ رَبِّي عَزَّ وَجَلَّ أَنْ أَرْجِعَ إِلَيْهِ، ‏‏‏‏‏‏فَنُودِيَ أَنْ قَدْ أَمْضَيْتُ فَرِيضَتِي وَخَفَّفْتُ عَنْ عِبَادِي وَأَجْزِي بِالْحَسَنَةِ عَشْرَ أَمْثَالِهَا .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "5",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 292,
				"chapterNumber": "5",
				"chapterEnglish": "The Book of Salah",
				"chapterUrdu": "نماز کے احکام و مسائل",
				"chapterArabic": "كتاب الصلاة",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35483,
			"hadithNumber": "495",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Ibn Shihab that 'Umar bin 'Abdul-'Aziz delayed the 'Asr prayer a little. 'Urwah said to him: Jibril came down and led the Messenger of Allah (ﷺ) in prayer. 'Umar said: Watch what you are saying, O 'Urwah! He said: I heard Bashir bin Abi Mas'ud say: 'I heard Abu Mas'ud say: I heard the Messenger of Allah (ﷺ) say: 'Jibril came down and led me in prayer, and I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him, then I prayed with him - and he counted off five prayers on his fingers.'",
			"hadithUrdu": "عمر بن عبدالعزیز نے عصر میں کچھ تاخیر کر دی، تو عروہ نے ان سے کہا: کیا آپ کو معلوم نہیں؟ جبرائیل علیہ السلام نازل ہوئے، اور آپ نے رسول اللہ صلی اللہ علیہ وسلم کو نماز پڑھائی ۱؎ اس پر عمر بن عبدالعزیز نے کہا: عروہ! جو تم کہہ رہے ہو اسے خوب سوچ سمجھ کر کہو، تو عروہ نے کہا: میں نے بشیر بن ابی مسعود رضی اللہ عنہ سے سنا ہے وہ کہہ رہے تھے کہ میں نے ابومسعود سے سنا وہ کہہ رہے تھے کہ میں نے رسول اللہ صلی اللہ علیہ وسلم کو فرماتے سنا ہے کہ جبرائیل اترے، اور انہوں نے میری امامت کرائی، تو میں نے ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، پھر ان کے ساتھ نماز پڑھی، آپ اپنی انگلیوں پر پانچوں نمازوں کو گن رہے تھے۔",
			"urduNarrator": "ابن شہاب زہری سے روایت ہے کہ",
			"hadithArabic": "أَخْبَرَنَا قُتَيْبَةُ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا اللَّيْثُ بْنُ سَعْدٍ، ‏‏‏‏‏‏عَنْ ابْنِ شِهَابٍ، ‏‏‏‏‏‏أَنَّ عُمَرَ بْنَ عَبْدِ الْعَزِيزِ أَخَّرَ الْعَصْرَ شَيْئًا، ‏‏‏‏‏‏فَقَالَ لَهُعُرْوَةُ:‏‏‏‏ أَمَا إِنَّ جِبْرِيلَ عَلَيْهِ السَّلَام قَدْ نَزَلَ فَصَلَّى إِمَامَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏فَقَالَ عُمَرُ:‏‏‏‏ اعْلَمْ مَا تَقُولُ يَا عُرْوَةُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ سَمِعْتُ بَشِيرَ بْنَ أَبِي مَسْعُودٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ أَبَا مَسْعُودٍ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ سَمِعْتُ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏يَقُولُ:‏‏‏‏ نَزَلَ جِبْرِيلُ فَأَمَّنِي فَصَلَّيْتُ مَعَهُ ثُمَّ صَلَّيْتُ مَعَهُ ثُمَّ صَلَّيْتُ مَعَهُ ثُمَّ صَلَّيْتُ مَعَهُ ثُمَّ صَلَّيْتُ مَعَهُ، ‏‏‏‏‏‏يَحْسُبُ بِأَصَابِعِهِ خَمْسَ صَلَوَاتٍ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "6",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 293,
				"chapterNumber": "6",
				"chapterEnglish": "The Book of the Times (of Prayer)",
				"chapterUrdu": "اوقات نماز کے احکام و مسائل",
				"chapterArabic": "كتاب المواقيت",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35615,
			"hadithNumber": "627",
			"englishNarrator": "",
			"hadithEnglish": "Nafi' narrated that 'Abdullah bin 'Umar used to say: When the Muslims arrived in Al-Madinah they used to gather and try to figure out the time for prayer, and no one gave the call to prayer. One day they spoke about that; some of them said: 'Let us use a bell like the Christians do;' others said, 'No, a horn like the Jews have.' 'Umar, may ,Allah be pleased with him, said: 'Why don't you send a man to announce the time of prayer?' The Messenger of Allah (ﷺ) said: 'O Bilal, get up and give the call to prayer.'",
			"hadithUrdu": "جس وقت مسلمان مدینہ آئے تو وہ جمع ہو کر نماز کے وقت کا اندازہ کرتے تھے، اس وقت کوئی نماز کے لیے اذان نہیں دیتا تھا، تو ایک دن لوگوں نے اس سلسلے میں گفتگو کی، تو کچھ لوگ کہنے لگے: نصاریٰ کے مانند ایک ناقوس بنا لو، اور کچھ لوگ کہنے لگے: بلکہ یہود کے سنکھ کی طرح ایک سنکھ بنا لو، تو اس پر عمر رضی اللہ عنہ نے کہا: کیا تم کسی شخص کو بھیج نہیں سکتے کہ وہ نماز کے لیے پکار دیا کرے؟ تو رسول اللہ صلی اللہ علیہ وسلم نے فرمایا:  بلال! اٹھو اور نماز کے لیے پکارو ۔",
			"urduNarrator": "عبداللہ بن عمر رضی اللہ عنہم کہتے ہیں کہ",
			"hadithArabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ وَإِبْرَاهِيمُ بْنُ الْحَسَنِ، ‏‏‏‏‏‏قَالَا:‏‏‏‏ حَدَّثَنَا حَجَّاجٌ، ‏‏‏‏‏‏قال:‏‏‏‏ قال ابْنُ جُرَيْجٍ:‏‏‏‏ أَخْبَرَنِي نَافِعٌ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، ‏‏‏‏‏‏أَنَّهُ كَانَ يَقُولُ:‏‏‏‏ كَانَ الْمُسْلِمُونَ حِينَ قَدِمُوا الْمَدِينَةَ يَجْتَمِعُونَ فَيَتَحَيَّنُونَ الصَّلَاةَ وَلَيْسَ يُنَادِي بِهَا أَحَدٌ، ‏‏‏‏‏‏فَتَكَلَّمُوا يَوْمًا فِي ذَلِكَ، ‏‏‏‏‏‏فَقَالَ بَعْضُهُمْ:‏‏‏‏ اتَّخِذُوا نَاقُوسًا مِثْلَ نَاقُوسِ النَّصَارَى، ‏‏‏‏‏‏وَقَالَ بَعْضَهُمْ:‏‏‏‏ بَلْ قَرْنًا مِثْلَ قَرْنِ الْيَهُودِ، ‏‏‏‏‏‏فَقَالَ عُمَرُ رَضِيَ اللَّهُ عَنْهُ:‏‏‏‏ أَوَلَا تَبْعَثُونَ رَجُلًا يُنَادِي بِالصَّلَاةِ ؟ فَقَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ:‏‏‏‏ يَا بِلَالُ، ‏‏‏‏‏‏قُمْ فَنَادِ بِالصَّلَاةِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "7",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 294,
				"chapterNumber": "7",
				"chapterEnglish": "The Book of the Adhan (The Call to Prayer)",
				"chapterUrdu": "اذان کے احکام و مسائل",
				"chapterArabic": "كتاب الأذان",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35677,
			"hadithNumber": "689",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from 'Amr bin 'Abasah that the Messenger of Allah (ﷺ) said: Whoever builds a Masjid in which Allah is remembered, Allah, (the Mighty and Sublime) will build for him a house in Paradise.",
			"hadithUrdu": "رسول اکرم صلی اللہ علیہ وسلم نے فرمایا:  جس نے کوئی مسجد بنائی جس میں اللہ تعالیٰ کا ذکر کیا جاتا ہو، تو اللہ تعالیٰ اس کے لیے جنت میں ایک گھر بنائے گا ۔",
			"urduNarrator": "عمرو بن عبسہ رضی اللہ عنہ سے روایت ہے کہ",
			"hadithArabic": "أَخْبَرَنَا عَمْرُو بْنُ عُثْمَانَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا بَقِيَّةُ، ‏‏‏‏‏‏عَنْ بَحِيرٍ، ‏‏‏‏‏‏عَنْ خَالِدِ بْنِ مَعْدَانَ، ‏‏‏‏‏‏عَنْ كَثِيرِ بْنِ مُرَّةَ، ‏‏‏‏‏‏عَنْ عَمْرِو بْنِ عَبَسَةَ، ‏‏‏‏‏‏أَنّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قَالَ:‏‏‏‏ مَنْ بَنَى مَسْجِدًا يُذْكَرُ اللَّهُ فِيهِ، ‏‏‏‏‏‏بَنَى اللَّهُ عَزَّ وَجَلَّ لَهُ بَيْتًا فِي الْجَنَّةِ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "8",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 295,
				"chapterNumber": "8",
				"chapterEnglish": "The Book of the Masjids",
				"chapterUrdu": "مساجد کے فضائل و مسائل",
				"chapterArabic": "كتاب المساجد",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35730,
			"hadithNumber": "742",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated from Anas bin Malik that he saw the Messenger of Allah (ﷺ) praying on a donkey while he was riding, praying toward Khaibar with the Qiblah behind him. Abu 'Abdur-Rahman (An-Nasa'i) said: We do not know of anyone who reported anything to support what 'Amr bin Yahya said about praying on a donkey. As for the Hadith of Yahya bin Sa'eed from Anas, what is correct is that it is Mawquf. [1] And Allah knows best. [1] That is a saying or action of a Companion of the Prophet (ﷺ)",
			"hadithUrdu": "انہوں نے رسول اللہ صلی اللہ علیہ وسلم کو گدھے پر نماز پڑھتے دیکھا آپ سوار ہو کر خیبر کی طرف جا رہے تھے، اور قبلہ آپ کے پیچھے تھا۔ ابوعبدالرحمٰن  ( نسائی )  کہتے کہ ہم کسی ایسے شخص کو نہیں جانتے جس نے عمرو بن یحییٰ کی ان کے قول «يصلي على حمار» میں متابعت کی ہو ۱؎اور یحییٰ بن سعید کی حدیث جو انس رضی اللہ عنہ سے مروی ہے، صحیح یہ ہے کہ وہ موقوف ہے ۲؎ واللہ سبحانہ وتعالیٰ اعلم بالصواب۔",
			"urduNarrator": "انس بن مالک رضی اللہ عنہ سے روایت ہے کہ",
			"hadithArabic": "أَخْبَرَنَا مُحَمَّدُ بْنُ مَنْصُورٍ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا إِسْمَاعِيلُ بْنُ عُمَرَ، ‏‏‏‏‏‏قال:‏‏‏‏ حَدَّثَنَا دَاوُدُ بْنُ قَيْسٍ، ‏‏‏‏‏‏عَنْ مُحَمَّدِ بْنِ عَجْلَانَ، ‏‏‏‏‏‏عَنْيَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَنَسِ بْنِ مَالِكٍ، ‏‏‏‏‏‏أَنَّهُ رَأَى رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يُصَلِّي عَلَى حِمَارٍ وَهُوَ رَاكِبٌ إِلَى خَيْبَرَ وَالْقِبْلَةُ خَلْفَهُ . قَالَ أَبُو عَبْد الرَّحْمَنِ:‏‏‏‏ لَا نَعْلَمُ أَحَدًا تَابَعَ عَمْرَو بْنَ يَحْيَى عَلَى قَوْلِهِ يُصَلِّي عَلَى حِمَارٍ، ‏‏‏‏‏‏وَحَدِيثُ يَحْيَى بْنِ سَعِيدٍ، ‏‏‏‏‏‏عَنْ أَنَسٍ الصَّوَابُ، ‏‏‏‏‏‏مَوْقُوفٌ وَاللَّهُ سُبْحَانَهُ وَتَعَالَى أَعْلَمُ.",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "9",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 296,
				"chapterNumber": "9",
				"chapterEnglish": "The Book of the Qiblah",
				"chapterUrdu": "قبلہ کے احکام و مسائل",
				"chapterArabic": "كتاب القبلة",
				"bookSlug": "sunan-nasai"
			}
		},
		{
			"id": 35766,
			"hadithNumber": "778",
			"englishNarrator": "",
			"hadithEnglish": "It was narrated that 'Abdullah said: When the Messenger of Allah(ﷺ) passed away, the Ansar said: 'Let there be an Amir from among us and an Amir from among you.' Then 'Umar came to them and said: 'Do you not know that the Messenger of Allah(ﷺ) commanded Abu Bakr to lead the people in prayer? Who mong you could accept to put himself ahead of Abu Bakr?' They said: 'We seek refuge with Allah from putting ourselves ahead of Abu Bakr. '",
			"hadithUrdu": "جب رسول اللہ صلی اللہ علیہ وسلم کی وفات ہوئی تو انصار کہنے لگے: ایک امیر ہم  ( انصار )  میں سے ہو گا اور ایک امیر تم ( مہاجرین )  میں سے، تو عمر رضی اللہ عنہ ان کے پاس آئے، اور کہا: کیا تم لوگوں کو معلوم نہیں کہ رسول اللہ صلی اللہ علیہ وسلم نے ابوبکر رضی اللہ عنہ کو لوگوں کو نماز پڑھانے کا حکم دیا ہے ۱؎، تو اب بتاؤ ابوبکر رضی اللہ عنہ سے آگے بڑھنے پر تم میں سے کس کا جی خوش ہو گا؟ ۲؎ تو لوگوں نے کہا: ہم ابوبکر رضی اللہ عنہ سے آگے بڑھنے پر اللہ کی پناہ مانگتے ہیں ۳؎۔",
			"urduNarrator": "عبداللہ بن مسعود رضی اللہ عنہ کہتے ہیں کہ",
			"hadithArabic": "أَخْبَرَنَا إِسْحَاقُ بْنُ إِبْرَاهِيمَ، ‏‏‏‏‏‏وَهَنَّادُ بْنُ السَّرِيِّ، ‏‏‏‏‏‏عَنْ حُسَيْنِ بْنِ عَلَيٍّ، ‏‏‏‏‏‏عَنْ زَائِدَةَ، ‏‏‏‏‏‏عَنْ عَاصِمٍ، ‏‏‏‏‏‏عَنْ زِرٍّ، ‏‏‏‏‏‏عَنْ عَبْدِ اللَّهِ، ‏‏‏‏‏‏قال:‏‏‏‏ لَمَّا قُبِضَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، ‏‏‏‏‏‏قالتِ الْأَنْصَارُ:‏‏‏‏ مِنَّا أَمِيرٌ وَمِنْكُمْ أَمِيرٌ فَأَتَاهُمْ عُمَرُ، ‏‏‏‏‏‏فَقَالَ:‏‏‏‏ أَلَسْتُمْ تَعْلَمُونَ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ قَدْ أَمَرَ أَبَا بَكْرٍ أَنْ يُصَلِّيَ بِالنَّاسِ فَأَيُّكُمْ تَطِيبُ نَفْسُهُ أَنْ يَتَقَدَّمَ أَبَا بَكْرٍ قَالُوا نَعُوذُ بِاللَّهِ أَنْ نَتَقَدَّمَ أَبَا بَكْرٍ .",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "10",
			"bookSlug": "sunan-nasai",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 7,
				"bookName": "Sunan An-Nasa`i",
				"writerName": "Imam Ahmad an-Nasa`i",
				"aboutWriter": null,
				"writerDeath": "303",
				"bookSlug": "sunan-nasai"
			},
			"chapter": {
				"id": 297,
				"chapterNumber": "10",
				"chapterEnglish": "The Book of Leading the Prayer (Al-Imamah)",
				"chapterUrdu": "امامت کے احکام و مسائل",
				"chapterArabic": "كتاب الإمامة",
				"bookSlug": "sunan-nasai"
			}
		}
	],
	"mishkat": [
		{
			"id": 28696,
			"hadithNumber": "2",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "عمر بن خطابؓ بیان کرتے ہیں ، ہم ایک روز رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کی خدمت میں حاضر تھے کہ اس اثنا میں ایک آدمی ہمارے پاس آیا ، جس کے کپڑے بہت ہی سفید اور بال انتہائی سیاہ تھے ، اس پر سفر کے آثار نظر آتے تھے نہ ہم میں سے کوئی اسے جانتا تھا ، حتیٰ کہ وہ دو زانو ہو کر نبیصلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم کے سامنے بیٹھ گیا اور اس نے اپنے دونوں ہاتھ اپنی رانوں پر رکھ لیے ، اور کہا : محمدصلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم! اسلام کے متعلق مجھے بتائیں ، آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ اسلام یہ ہے کہ تم گواہی دو کہ اللہ کے سوا کوئی معبود برحق نہیں ، اور یہ کہ محمد اللہ کے رسول ہیں ، نماز قائم کرو ، زکوۃ ادا کرو ، رمضان کے روزے رکھو اور اگر استطاعت ہو تو بیت اللہ کا حج کرو ۔‘‘ اس نے کہا : آپ نے سچ فرمایا ، ہمیں اس سے تعجب ہوا کہ وہ آپ سے پوچھتا ہے اور آپ کی تصدیق بھی کرتا ہے ، اس نے کہا : ایمان کے بارے میں مجھے بتائیں ، آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ یہ کہ تم اللہ پر ، اس کے فرشتوں ، اس کی کتابوں ، اس کے رسولوں ، اور یوم آخرت پر ایمان لاؤ اور تم تقدیر کے اچھا اور برا ہونے پر ایمان لاؤ ۔‘‘ اس نے کہا : آپ نے سچ فرمایا ، پھر اس نے کہا ، احسان کے بارے میں مجھے بتائیں ، آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ یہ کہ تم اللہ کی عبادت اس طرح کرو گویا تم اسے دیکھ رہے ہو اور اگر تم اسے نہیں دیکھ سکے تو وہ یقیناً تمہیں دیکھ رہا ہے ۔‘‘ اس نے کہا، قیامت کے بارے میں مجھے بتائیں ، آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ مسٔول اس کے متعلق سائل سے زیادہ نہیں جانتا ۔‘‘ اس نے کہا ، اس کی نشانیوں کے بارے میں مجھے بتا دیں ۔ آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ یہ کہ لونڈی اپنی مالکہ کو جنم دے گی اور یہ کہ تم ننگے پاؤں ، ننگے بدن ، تنگ دست بکریوں کے چرواہوں کو بلند و بالا عمارتوں کی تعمیر اور ان پر فخر کرتے ہوئے دیکھو گے ۔‘‘ عمرؓ نے فرمایا : پھر وہ شخص چلا گیا ، میں کچھ دیر ٹھہرا ۔ پھر آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے مجھ سے پوچھا :’’ عمر ! کیا تم جانتے ہو سائل کون تھا ؟‘‘ میں نے عرض کیا ، اللہ اور اس کے رسول بہتر جانتے ہیں ، آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ وہ جبریل ؑ تھے ، وہ تمہیں تمہارا دین سکھانے کے لیے تمہارے پاس تشریف لائے تھے ۔‘‘ رواہ مسلم (۹۳) ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُ قَالَ: بَيْنَا نَحْنُ عِنْدَ رَسُولِ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ذَاتَ يَوْمٍ إِذْ طَلَعَ عَلَيْنَا رَجُلٌ شَدِيدُ بَيَاضِ الثِّيَابِ شَدِيدُ سَوَادِ الشَّعْرِ لَا يُرَى عَلَيْهِ أَثَرُ السَّفَرِ وَلَا يَعْرِفُهُ مِنَّا أَحَدٌ حَتَّى جَلَسَ إِلَى النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسلم فأسند رُكْبَتَيْهِ إِلَى رُكْبَتَيْهِ وَوَضَعَ كَفَّيْهِ عَلَى فَخْذَيْهِ وَقَالَ: يَا مُحَمَّدُ أَخْبِرْنِي عَنِ الْإِسْلَامِ قَالَ: الْإِسْلَامُ: أَنْ تَشْهَدَ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ وَتُقِيمَ الصَّلَاةَ وَتُؤْتِيَ الزَّكَاةَ وَتَصُومَ رَمَضَانَ وَتَحُجَّ الْبَيْتَ إِنِ اسْتَطَعْتَ إِلَيْهِ سَبِيلًا . قَالَ: صَدَقْتَ. فَعَجِبْنَا لَهُ يَسْأَلُهُ وَيُصَدِّقُهُ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِيمَانِ. قَالَ: «أَنْ تُؤْمِنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ وَالْيَوْمِ الْآخِرِ وَتُؤْمِنَ بِالْقَدَرِ خَيْرِهِ وَشَرِّهِ» . قَالَ صَدَقْتَ. قَالَ: فَأَخْبِرْنِي عَنِ الْإِحْسَانِ. قَالَ: «أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ» . قَالَ: فَأَخْبِرْنِي عَنِ السَّاعَةِ. قَالَ: «مَا المسؤول عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ» . قَالَ: فَأَخْبِرْنِي عَنْ أَمَارَاتِهَا. قَالَ: «أَنْ تَلِدَ الْأَمَةُ رَبَّتَهَا وَأَنْ تَرَى الْحُفَاةَ الْعُرَاةَ الْعَالَةَ رِعَاءَ الشَّاءِ يَتَطَاوَلُونَ فِي الْبُنْيَانِ» . قَالَ: ثُمَّ انْطَلَقَ فَلَبِثْتُ مَلِيًّا ثُمَّ قَالَ لِي: «يَا عُمَرُ أَتَدْرِي مَنِ السَّائِلُ» ؟ قُلْتُ: اللَّهُ وَرَسُولُهُ أَعْلَمُ. قَالَ: «فَإِنَّهُ جِبْرِيل أَتَاكُم يعلمكم دينكُمْ» . رَوَاهُ مُسلم",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "1",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 376,
				"chapterNumber": "1",
				"chapterEnglish": "Faith",
				"chapterUrdu": "ایمان کا بیان",
				"chapterArabic": "كتاب الإيمان",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 28892,
			"hadithNumber": "198",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "عبداللہ عمرو ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ میری طرف سے پہنچا دو خواہ ایک آیت ہی ہو ، بنی اسرائیل کے واقعات بیان کرو اس میں کوئی حرج نہیں ، اور جو شخص عمداً مجھ پر جھوٹ بولے وہ اپنا ٹھکانہ جہنم میں بنا لے ۔‘‘ رواہ البخاری (۳۴۶۱) ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «بَلِّغُوا عَنِّي وَلَوْ آيَةً وَحَدِّثُوا عَنْ بَنِي إِسْرَائِيلَ وَلَا حَرَجَ وَمَنْ كَذَبَ عَلَيَّ مُتَعَمِّدًا فَلْيَتَبَوَّأْ مَقْعَدَهُ مِنَ النَّارِ» . رَوَاهُ البُخَارِيّ",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "2",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 377,
				"chapterNumber": "2",
				"chapterEnglish": "Knowledge",
				"chapterUrdu": "علم اور اس کی فضیلت کا بیان",
				"chapterArabic": "كتاب العلم",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 28975,
			"hadithNumber": "281",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابومالک اشعری ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ پاکیزگی نصف ایمان ہے ، الحمدللہ میزان کو بھر دیتا ہے ، سبحان اللہ اور الحمدللہ دونوں یا (ان میں سے ہر کلمہ) زمین و آسمان کے مابین کو بھر دیتا ہے ، نماز نور ہے ، صدقہ برہان ہے ، صبر ضیا ہے اور قرآن تیرے حق میں یا تیرے خلاف دلیل ہو گا ۔ ہر آدمی صبح کے وقت اپنے نفس کا سودا کرتا ہے ، پس وہ اسے آزاد کرا لیتا ہے یا ہلاک کر دیتا ہے ۔‘‘ رواہ مسلم و الدارمی (۱ /۱۶۷ ح ۶۵۹) و النسائی فی الکبریٰ : ۹۹۹۶) ۔ اور ایک دوسری روایت میں ہے :((لا الہ الا للہ و اللہ اکبر)) زمین و آسمان کے مابین ہر چیز کو بھر دیتے ہیں ۔‘‘ میں نے یہ روایت صحیحین میں پائی ہے نہ حمیدی کی کتاب میں اور نہ ہی الجامع میں ۔ لیکن دارمی نے اسے سبحان اللہ و الحمدللہ کے بدلے ذکر کیا ہے ۔",
			"urduNarrator": "",
			"hadithArabic": "عَن أَبِي مَالِكٍ الْأَشْعَرِيِّ قَالَ قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الطُّهُورُ شَطْرُ الْإِيمَانِ وَالْحَمْدُ لِلَّهِ تَمْلَأُ الْمِيزَانَ وَسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ تَمْلَآنِ - أَوْ تَمْلَأُ - مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ وَالصَّلَاةُ نُورٌ وَالصَّدَقَةُ بُرْهَانٌ وَالصَّبْرُ ضِيَاءٌ وَالْقُرْآنُ حُجَّةٌ لَكَ أَوْ عَلَيْكَ كُلُّ النَّاسِ يَغْدُو فَبَائِعٌ نَفْسَهُ فَمُعْتِقُهَا أَوْ مُوبِقُهَا» . رَوَاهُ مُسْلِمٌ وَفِي رِوَايَةٍ: «لَا إِلَهَ إِلَّا اللَّهُ وَاللَّهُ أَكْبَرُ تَمْلَآنِ مَا بَيْنَ السَّمَاءِ وَالْأَرْضِ» . لَمْ أَجِدْ هَذِهِ الرِّوَايَةَ فِي الصَّحِيحَيْنِ وَلَا فِي كِتَابِ الْحُمَيْدِيِّ وَلَا فِي «الْجَامِعِ» وَلَكِنْ ذَكَرَهَا الدَّارِمِيُّ بدل «سُبْحَانَ الله وَالْحَمْد لله»",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "3",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 378,
				"chapterNumber": "3",
				"chapterEnglish": "Purification",
				"chapterUrdu": "پاکیزگی کا بیان",
				"chapterArabic": "كتاب الطهارة",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 29258,
			"hadithNumber": "564",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابوہریرہ ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ جب کبیرہ گناہوں سے بچا جائے تو پانچ نمازیں ، جمعہ دوسرے جمعہ تک اور رمضان دوسرے رمضان تک ہونے والے صغیرہ گناہوں کا کفارہ ہیں ۔‘‘ رواہ مسلم ۔",
			"urduNarrator": "",
			"hadithArabic": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «الصَّلَوَاتُ الْخَمْسُ وَالْجُمُعَةُ إِلَى الْجُمُعَةِ وَرَمَضَانُ إِلَى رَمَضَانَ مُكَفِّرَاتٌ لَمَّا بَيْنَهُنَّ إِذَا اجْتُنِبَتِ الْكَبَائِر» . رَوَاهُ مُسلم",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "4",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 379,
				"chapterNumber": "4",
				"chapterEnglish": "Prayer",
				"chapterUrdu": "نماز کا بیان",
				"chapterArabic": "كتاب الصلاة",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 30217,
			"hadithNumber": "1523",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابوموسی ٰ ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ بھوکے کو کھانا کھلاؤ ، مریض کی عیادت کرو اور قیدی کو رہائی دلاؤ ۔‘‘ رواہ البخاری ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ أَبِي مُوسَى قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «أَطْعِمُوا الْجَائِعَ وَعُودُوا الْمَرِيض وفكوا العاني» . رَوَاهُ البُخَارِيّ",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "5",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 380,
				"chapterNumber": "5",
				"chapterEnglish": "Funerals",
				"chapterUrdu": "جنازوں کا بیان",
				"chapterArabic": "كتاب الجنائز",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 30466,
			"hadithNumber": "1772",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابن عباس ؓ سے روایت ہے کہ رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے معاذ ؓ کو یمن بھیجا تو فرمایا :’’ تم اہل کتاب کے پاس جا رہے ہو ، انہیں اس گواہی دینے کی طرف دعوت دینا کہ اللہ کے سوا کوئی معبود برحق نہیں اور بے شک محمد (صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم) اللہ کے رسول ہیں ، اگر وہ اس میں تمہاری اطاعت کر لیں تو انہیں بتاؤ کہ اللہ نے دن رات میں ان پر پانچ نمازیں فرض کی ہیں ، اگر وہ اس میں بھی تمہاری اطاعت کریں تو انہیں بتانا کہ اللہ نے ان پر صدقہ فرض کیا ہے ، جو ان کے مال داروں سے لے کر ان کے ناداروں کو دیا جائے گا ، اگر وہ تمہاری یہ بات بھی مان لیں تو پھر ان کے اچھے اچھے مال لینے سے اجتناب کرنا ، اور مظلوم کی بددعا سے بچنا کیونکہ اس کے اور اللہ کے درمیان کوئی حجاب نہیں ۔‘‘ متفق علیہ ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنِ ابْنِ عَبَّاسٍ أَنَّ رَسُولَ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ بَعَثَ مُعَاذًا إِلَى الْيَمَنِ فَقَالَ: «إِنَّك تَأتي قوما من أهل الْكتاب. فَادْعُهُمْ إِلَى شَهَادَةِ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ. فَإِنْ هُمْ أطاعوا لذَلِك. فَأَعْلِمْهُمْ أَنَّ اللَّهَ قَدْ فَرَضَ عَلَيْهِمْ خَمْسَ صَلَوَاتٍ فِي الْيَوْمِ وَاللَّيْلَةِ. فَإِنْ هم أطاعوا لذَلِك فأعلمهم أَن الله قد فرض عَلَيْهِم صَدَقَة تُؤْخَذ من أغنيائهم فَترد فِي فُقَرَائِهِمْ. فَإِنْ هُمْ أَطَاعُوا لِذَلِكَ. فَإِيَّاكَ وَكَرَائِمَ أَمْوَالِهِمْ وَاتَّقِ دَعْوَةَ الْمَظْلُومِ فَإِنَّهُ لَيْسَ بَيْنَهَا وَبَين الله حجاب»",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "6",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 381,
				"chapterNumber": "6",
				"chapterEnglish": "Zakat",
				"chapterUrdu": "زکوۃ کا بیان",
				"chapterArabic": "كتاب الزكاة",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 30650,
			"hadithNumber": "1956",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابوہریرہ ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ جب رمضان آتا ہے تو آسمان کے دروازے کھول دیے جاتے ہیں ۔‘‘ اور ایک روایت میں ہے :’’ جنت کے دروازے کھول دیے جاتے ہیں اور جہنم کے دروازے بند کر دیے جاتے ہیں اور شیاطین کو جکڑ دیا جاتا ہے ۔‘‘ اور ایک روایت میں ہے :’’ رحمت کے دروازے کھول دیے جاتے ہیں ۔‘‘ متفق علیہ ۔",
			"urduNarrator": "",
			"hadithArabic": "وَعَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسلم: «إِذا دخل شهر رَمَضَانُ فُتِحَتْ أَبْوَابُ السَّمَاءِ» . وَفِي رِوَايَةٍ: «فُتِّحَتْ أَبْوَابُ الْجَنَّةِ وَغُلِّقَتْ أَبْوَابُ جَهَنَّمَ وَسُلْسِلَتِ الشَّيَاطِينُ» . وَفِي رِوَايَةٍ: «فُتِحَتْ أَبْوَابُ الرَّحْمَةِ»",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "7",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 382,
				"chapterNumber": "7",
				"chapterEnglish": "Fasting",
				"chapterUrdu": "روزوں کا بیان",
				"chapterArabic": "كتاب الصوم",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 30803,
			"hadithNumber": "2109",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "عثمان ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ تم میں سے بہترین شخص وہ ہے جس نے قرآن سیکھا اور (دوسروں کو) سکھایا ۔‘‘ رواہ البخاری ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ عُثْمَانَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «خَيْرُكُمْ من تعلم الْقُرْآن وَعلمه» . رَوَاهُ البُخَارِيّ",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "8",
			"bookSlug": "mishkat",
			"volume": "1",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 383,
				"chapterNumber": "8",
				"chapterEnglish": "The Excellent Qualities of the Qur'an",
				"chapterUrdu": "فضائل قرآن کا بیان",
				"chapterArabic": "كتاب فضائل القرآن",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 30917,
			"hadithNumber": "2223",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابوہریرہ ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ ہر نبی کی (اپنی امت کے بارے میں) ایک دعا قبول ہوتی ہے ، پس ہر نبی نے دعا کرنے میں جلدی کی ، جبکہ میں نے اپنی دعا کو اپنی امت کی شفاعت کے لیے روز قیامت کے لیے چھپا رکھا ہے ، اور وہ (شفاعت) ان شاء اللہ ہر اس شخص کو پہنچے گی جو اس حال میں فوت ہوا ہو گا کہ اس نے اللہ کے ساتھ کسی کو شریک نہیں ٹھہرایا ہو گا ۔‘‘ مسلم ۔ اور بخاری کی روایت اس سے مختصر ہے ۔ متفق علیہ، رواہ مسلم ، و البخاری (۶۳۰۴) ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللَّهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ: «لِكُلِّ نَبِيٍّ دَعْوَةٌ مُسْتَجَابَةٌ فَتَعَجَّلَ كُلُّ نَبِيٍّ دَعْوَتَهُ وَإِنِّي اخْتَبَأْتُ دَعْوَتِي شَفَاعَةً لِأُمَّتِي إِلَى يومِ القِيامةِ فَهِيَ نَائِلَةٌ إِنْ شَاءَ اللَّهُ مَنْ مَاتَ مِنْ أُمَّتِي لَا يُشْرِكُ بِاللَّهِ شَيْئًا» . رَوَاهُ مُسلم وللبخاري أقصر مِنْهُ",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "9",
			"bookSlug": "mishkat",
			"volume": "2",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 384,
				"chapterNumber": "9",
				"chapterEnglish": "Supplications",
				"chapterUrdu": "دعاؤں کا بیان",
				"chapterArabic": "كتاب الدعوات",
				"bookSlug": "mishkat"
			}
		},
		{
			"id": 31199,
			"hadithNumber": "2505",
			"englishNarrator": "",
			"hadithEnglish": "",
			"hadithUrdu": "ابوہریرہ ؓ بیان کرتے ہیں ، رسول اللہ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے ہمیں خطبہ ارشاد فرمایا :’’ لوگو ! تم پر حج فرض کر دیا گیا ہے لہذا تم حج کرو ۔‘‘ کسی آدمی نے عرض کیا : اللہ کے رسول ! کیا ہر سال ؟ آپ خاموش رہے ، حتیٰ کہ اس نے تین مرتبہ کہا ، پھر آپ صلی ‌اللہ ‌علیہ ‌وآلہ ‌وسلم نے فرمایا :’’ اگر میں ہاں کہہ دیتا تو (پھر ہر سال) واجب ہو جاتا ، اور تم استطاعت نہ رکھتے ۔‘‘ پھر فرمایا :’’ جب تک میں تمہیں کوئی مسئلہ نہ بتاؤں تو مجھے چھوڑے رکھو ، تم سے پہلے لوگ اپنے انبیا سے زیادہ سوال کرنے اور ان سے اختلاف کرنے کی وجہ سے ہلاک ہوئے ، جب میں کسی چیز کے بارے میں تمہیں حکم دوں تو مقدور بھر اس پر عمل کرو اور جب میں کسی چیز سے تمہیں منع کروں تو اسے چھوڑ دو ۔‘‘ رواہ مسلم ۔",
			"urduNarrator": "",
			"hadithArabic": "عَنْ أَبِي هُرَيْرَةَ قَالَ:: خَطَبَنَا رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فَقَالَ: «يَا أَيُّهَا النَّاسُ قَدْ فُرِضَ عَلَيْكُمُ الْحَجُّ فَحُجُّوا» فَقَالَ رَجُلٌ: أَكُلَّ عَامٍ يَا رَسُولَ اللَّهِ؟ فَسَكَتَ حَتَّى قَالَهَا ثَلَاثًا فَقَالَ: لَوْ قُلْتُ: نَعَمْ لَوَجَبَتْ وَلَمَا اسْتَطَعْتُمْ ثُمَّ قَالَ: ذَرُونِي مَا تَرَكْتُكُمْ فَإِنَّمَا هَلَكَ مَنْ كَانَ قَبْلَكُمْ بِكَثْرَةِ سُؤَالِهِمْ وَاخْتِلَافِهِمْ عَلَى أَنْبِيَائِهِمْ فَإِذَا أَمَرْتُكُمْ بِشَيْءٍ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ وَإِذَا نَهَيْتُكُمْ عَنْ شَيْء فدَعُوه . رَوَاهُ مُسلم",
			"headingArabic": null,
			"headingUrdu": null,
			"headingEnglish": null,
			"chapterId": "10",
			"bookSlug": "mishkat",
			"volume": "2",
			"status": "sahih",
			"book": {
				"id": 8,
				"bookName": "Mishkat Al-Masabih",
				"writerName": "Imam Khatib at-Tabrizi",
				"aboutWriter": null,
				"writerDeath": "741",
				"bookSlug": "mishkat"
			},
			"chapter": {
				"id": 385,
				"chapterNumber": "10",
				"chapterEnglish": "The Rites of Pilgrimage",
				"chapterUrdu": "افعال حج کا بیان",
				"chapterArabic": "كتاب المناسك",
				"bookSlug": "mishkat"
			}
		}
	],
	"musnad-ahmad": [],
	"al-silsila-sahiha": []
}
